{
 "PrintNo":"A4907","Version":"A","Session":2025,"Chamber":"ASSEMBLY","BillType":"Assembly",
 "Published":"2025-02-10T13:36:41.126918Z","Status":"IN_ASSEMBLY_COMM","Committee":"Higher Education",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2025-12-08","Committee":"Higher Education"}],
 "Actions":[
  {"Text":"REFERRED TO HIGHER EDUCATION","Date":"2025-02-10","Chamber":"ASSEMBLY"},
  {"Text":"AMEND (T) AND RECOMMIT TO HIGHER EDUCATION","Date":"2025-12-08","Chamber":"ASSEMBLY"},
  {"Text":"PRINT NUMBER 4907A","Date":"2025-12-08","Chamber":"ASSEMBLY","Version":"A"}
 ],
 "Sponsors":[{"ID":539,"Name":"J. Gary Pretlow","Short":"PRETLOW"}],
 "Title":"Repeals and reenacts provisions on time limitations on certain actions against professional engineers, architects, other designers and construction contractors; repealer",
 "Summary":"Repeals and reenacts statute of limitation provisions on wrongful death, personal injury and property damage actions against professional engineers, architects, landscape architects, land surveyors and construction contractors to provide for a limitations period of ten years after completion of improvement to real property; \"completion\", which constitutes the accrual date for the limitations period, is defined; provides for a one year extension for injuries to person or property or wrongful death which occur during the tenth year after completion.",
 "LawSection":"Civil Practice Law and Rules",
 "LawCode":"Rpld & add ยง214-d, amd ยง214, rpld R3211 sub (h), R3212 sub (i), CPLR",
 "ActClause":"AN ACT to amend the civil practice law and rules, in relation to providing a statute of limitations for certain actions against professional engineers, architects, landscape architects, land surveyors and construction contractors and to repeal section 214-d, subdivision (h) of rule 3211 and subdivision (i) of rule 3212 of the civil practice law and rules relating thereto",
 "PreviousVersions":["A2179-2007","A4394-2009","A2475-2011","A5301-2013","A2545-2015","A2198-2017","A3595-2019","A1706-2021","A4549-2023"]
}