{
 "PrintNo":"A5918","Version":"A","Session":2025,"Chamber":"ASSEMBLY","BillType":"Assembly",
 "Published":"2025-02-24T09:55:29.194638Z","Status":"IN_ASSEMBLY_COMM","Committee":"Governmental Operations",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2026-01-07","Committee":"Governmental Operations"}],
 "Actions":[
  {"Text":"REFERRED TO GOVERNMENTAL OPERATIONS","Date":"2025-02-24","Chamber":"ASSEMBLY"},
  {"Text":"AMEND (T) AND RECOMMIT TO GOVERNMENTAL OPERATIONS","Date":"2025-05-16","Chamber":"ASSEMBLY"},
  {"Text":"PRINT NUMBER 5918A","Date":"2025-05-16","Chamber":"ASSEMBLY","Version":"A"},
  {"Text":"REFERRED TO GOVERNMENTAL OPERATIONS","Date":"2026-01-07","Chamber":"ASSEMBLY","Version":"A"}
 ],
 "Sponsors":[
  {"ID":1565,"Name":"Gabriella Romero","Short":"ROMERO"},{"ID":662,"Name":"John T. McDonald III","Short":"MCDONALD"},
  {"ID":675,"Name":"Phil Steck","Short":"STECK"}
 ],
 "Title":"Directs empire state development, in conjunction with the office of general services, to create plans for the development of mixed-use commercial and residential property at, and redesign of, the Harriman campus",
 "Summary":"Directs empire state development, in conjunction with the office of general services, to create a plan to develop mixed-use commercial and residential property on a certain portion of the Harriman campus; directs such plan to be completed and made available for public comment no later than 180 days after the effective date; directs empire state development, in conjunction with the office of general services, to create a master plan for the redesign of the Harriman campus; directs that such plan be completed and made available for public comment no later than one year after the effective date.",
 "LawSection":"Economic Development",
 "ActClause":"AN ACT directing the empire state development corporation, in conjunction with the office of general services, to create plans for the development of mixed-use commercial and residential property on a certain portion of the Harriman campus, and for redesign of the Harriman campus",
 "SameAsPrintNo":"S1613-2025"
}