{
 "PrintNo":"A9463","Session":2025,"Chamber":"ASSEMBLY","BillType":"Assembly","Published":"2026-01-06T17:42:22.523327Z",
 "Status":"IN_ASSEMBLY_COMM","Committee":"Labor",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2026-01-07","Committee":"Labor"}],
 "Actions":[
  {"Text":"REFERRED TO LABOR","Date":"2026-01-06","Chamber":"ASSEMBLY"},
  {"Text":"REFERRED TO LABOR","Date":"2026-01-07","Chamber":"ASSEMBLY"}
 ],
 "Sponsors":[{"ID":633,"Name":"Harry B. Bronson","Short":"BRONSON"}],
 "Title":"Relates to the issuance of temporary elevator mechanic licenses during shortages, continuing education for certain elevator and accessibility lift licensees, and the use of unlicensed elevator mechanics; repealer",
 "Summary":"Relates to the determination of a verifiable shortage of licensed mechanics by the commissioner of labor for purposes of the issuance of a temporary elevator mechanic license, continuing education requirements for elevator mechanic's and accessibility lift technician's licensees, and authorizing the commissioner of labor to impose civil penalties for the employment or use of unlicensed mechanics; repeals certain provisions of the labor law related to the inspection of elevators and conveyances; amends the effectiveness of such related provisions.",
 "LawSection":"Labor Law",
 "LawCode":"Amd §§954 & 955, rpld §958, Lab L; amd §4, Chap of 2025 (as proposed in S.7944-A & A.8032-A)",
 "ActClause":"AN ACT to amend the labor law, in relation to the determination of a verifiable shortage of licensed mechanics by the commissioner of labor for purposes of the issuance of a temporary elevator mechanic license, continuing education requirements for elevator mechanic's and accessibility lift technician's licensees, and authorizing the commissioner of labor to impose civil penalties for the employment or use of unlicensed mechanics; to repeal certain provisions of such law related to the inspection of elevators and conveyances; and to amend a chapter of the laws of 2025 amending the labor law relating to clarifying key provisions around elevator licensing on examinations and experience, as proposed in legislative bills numbers S. 7944-A and A. 8032-A, in relation to the effectiveness thereof",
 "SameAsPrintNo":"S8774-2025"
}