{
 "PrintNo":"S109","Session":2025,"Chamber":"SENATE","BillType":"Senate","Published":"2024-12-18T14:57:06.509777Z",
 "Status":"IN_SENATE_COMM","Committee":"Judiciary",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2026-01-07","Committee":"Judiciary"}],
 "Actions":[
  {"Text":"REFERRED TO JUDICIARY","Date":"2025-01-08","Chamber":"SENATE"},
  {"Text":"TO ATTORNEY-GENERAL FOR OPINION","Date":"2025-01-08","Chamber":"SENATE"},
  {"Text":"OPINION REFERRED TO JUDICIARY","Date":"2025-01-31","Chamber":"SENATE"},
  {"Text":"REFERRED TO JUDICIARY","Date":"2026-01-07","Chamber":"SENATE"},
  {"Text":"TO ATTORNEY-GENERAL FOR OPINION","Date":"2026-01-08","Chamber":"SENATE"}
 ],
 "Sponsors":[
  {"ID":427,"Name":"Patrick M. Gallivan","Short":"GALLIVAN"},{"ID":1370,"Name":"George Borrello","Short":"BORRELLO"},
  {"ID":1499,"Name":"Peter Oberacker","Short":"OBERACKER"},{"ID":1489,"Name":"Anthony H. Palumbo","Short":"PALUMBO"},
  {"ID":1516,"Name":"Steve Rhoads","Short":"RHOADS"}
 ],
 "Title":"Prohibits persons convicted of murder or sentenced to life without parole from being eligible for commutation of sentence",
 "Summary":"Prohibits persons convicted of murder or sentenced to life without parole or where the defendant acting either alone or with one or more other persons, commits or attempts to commit robbery, burglary, kidnapping, arson, rape in the first degree, criminal sexual act in the first degree, sexual abuse in the first degree, aggravated sexual abuse, escape in the first degree, or escape in the second degree, and, in the course of and in furtherance of such crime or of immediate flight therefrom, such defendant, or another participant, if there be any, intentionally causes the death of: a police officer; a peace officer; a firefighter, emergency medical technician, ambulance driver, paramedic, physician or registered nurse involved in a first response team, or any other individual who, in the course of official duties, performs emergency response; or an employee of a state correctional institution or was an employee of a local correctional facility, when such person was engaged in the course of performing their official duties, from being eligible for commutation of sentence.",
 "LawSection":"Constitution, Concurrent Resolutions to Amend","LawCode":"Amd Art 4 ยง4, Constn",
 "ActClause":"Concurrent Resolution of the Senate and Assembly proposing an amendment to section 4 of article 4 of the constitution, in relation to prohibiting persons convicted of murder or sentenced to life without parole from being eligible for commutation of sentence",
 "PreviousVersions":["A8664-2021","S8199-2021","S72-2023"]
}