{
 "PrintNo":"S1564","Session":2025,"Chamber":"SENATE","BillType":"Senate","Published":"2025-01-10T14:51:32.904612Z",
 "Status":"IN_SENATE_COMM","Committee":"Corporations, Authorities And Commissions",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2026-01-07","Committee":"Corporations, Authorities And Commissions"}],
 "Actions":[
  {"Text":"REFERRED TO CORPORATIONS, AUTHORITIES AND COMMISSIONS","Date":"2025-01-10","Chamber":"SENATE"},
  {"Text":"REFERRED TO CORPORATIONS, AUTHORITIES AND COMMISSIONS","Date":"2026-01-07","Chamber":"SENATE"}
 ],
 "Sponsors":[{"ID":1103,"Name":"James Tedisco","Short":"TEDISCO"}],
 "Title":"Prohibits the New York Department of State from issuing a certificate of dissolution and filing a judgment or final order of dissolution for the pension fund for employees of the former St. Clare's Hospital",
 "Summary":"Prohibits the New York Department of State from issuing a certificate of dissolution and filing a judgment or final order of dissolution for the pension fund for employees of the former St. Clare's Hospital in the city of Schenectady, county of Schenectady, until an investigation and/or audit by the New York State Department of Health, the New York State Attorney General or the New York State Comptroller has been conducted to ascertain whether there was any impropriety in the handling and management of funds in such pension plan.",
 "LawSection":"Executive Department",
 "ActClause":"AN ACT prohibiting the New York Department of State from issuing a certificate of dissolution and filing a judgment or final order of dissolution for the pension fund for employees of the former St. Clare's Hospital in the city of Schenectady, county of Schenectady, until an investigation and/or audit by the New York State Department of Health, the New York State Attorney General or the New York State Comptroller has been conducted to ascertain whether there was any impropriety in the handling and management of funds in such pension plan",
 "SameAsPrintNo":"A1114-2025","PreviousVersions":["S5596-2019","S2041-2021","S1183-2023"]
}