{
 "PrintNo":"S4099","Session":2025,"Chamber":"SENATE","BillType":"Senate","Published":"2025-01-31T16:17:38.129096Z",
 "Status":"IN_SENATE_COMM","Committee":"Housing, Construction And Community Development",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2025-01-31","Committee":"Housing, Construction And Community Development"}],
 "Actions":[{"Text":"REFERRED TO HOUSING, CONSTRUCTION AND COMMUNITY DEVELOPMENT","Date":"2025-01-31","Chamber":"SENATE"}],
 "Sponsors":[
  {"ID":416,"Name":"Kevin S. Parker","Short":"PARKER"},{"ID":1230,"Name":"Robert Jackson","Short":"JACKSON"},
  {"ID":1142,"Name":"Luis R. Sepúlveda","Short":"SEPULVEDA"}
 ],
 "Title":"Requires landlord to grant access to engineer or architect hired by tenants to inspect major capital improvements in certain multiple dwellings",
 "Summary":"Provides that no landlord shall deny access to a licensed professional engineer or licensed registered architect hired by any tenant or tenant association representing tenants of a multiple dwelling of six units or more for the purpose of conducting an inspection of a major capital improvement for which an application for a maximum rent adjustment has been filed by the landlord; provides that such inspection shall be conducted after notice to the landlord and during normal business hours; provides for the filing of such inspection report by such tenants with the New York city rent agency or the state division of housing and community renewal for consideration in such application's determination.",
 "LawSection":"New York City Administrative Code",
 "LawCode":"Amd §§26-405 & 26-511, NYC Ad Cd; amd §6, Emerg Ten Prot Act of 1974; amd §4, Emerg Hous Rent Cont L",
 "ActClause":"AN ACT to amend the administrative code of the city of New York, the emergency tenant protection act of nineteen seventy-four and the emergency housing rent control law, in relation to inspection of major capital improvements for which rent increases are requested and in relation to extending the provisions of the rent stabilization law",
 "SameAsPrintNo":"A1886-2025",
 "PreviousVersions":["S1809-2007","S1443-2009","S1282-2011","S86-2013","S1721-2015","S3643-2017","S4818-2019","S5387-2021","S6852-2023"]
}