{
 "PrintNo":"S5801","Session":2025,"Chamber":"SENATE","BillType":"Senate","Published":"2025-03-03T10:40:26.80165Z",
 "Status":"IN_SENATE_COMM","Committee":"Transportation",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2025-03-03","Committee":"Transportation"}],
 "Actions":[{"Text":"REFERRED TO TRANSPORTATION","Date":"2025-03-03","Chamber":"SENATE"}],
 "Sponsors":[
  {"ID":1142,"Name":"Luis R. Sepúlveda","Short":"SEPULVEDA"},
  {"ID":384,"Name":"Joseph P. Addabbo Jr.","Short":"ADDABBO"}
 ],
 "Title":"Establishes an electric scooter operator's safety manual, licensing requirement and insurance requirement",
 "Summary":"Establishes a bicycle and electric scooter operator's safety manual; provides for the issuance of a license for residents who successfully read and comprehend the operator's safety manual; requires residents who operate an electric scooter in New York City to have a license to operate such devices; requires instruction in electric scooter safety as part of the drivers pre-licensing course; requires liability insurance for electric scooters in cities having a population of one million or more; prohibits the sale of an electric scooter to a purchaser unless the purchaser has a license to operate the electric scooter and has insurance in a city having a population of one million or more.",
 "LawSection":"Vehicle and Traffic Law",
 "LawCode":"Add Art 12-E §§399-aa - 399-cc, §§1290, 1291 & 1292, amd §§502 & 504, V & T L; amd §5103, Ins L",
 "ActClause":"AN ACT to amend the vehicle and traffic law, in relation to establishing an electric scooter operator's safety manual and licensing requirement; to amend the vehicle and traffic law, in relation to requiring instruction in electric scooter safety as part of the drivers pre-licensing course; to amend the vehicle and traffic law and the insurance law, in relation to requiring liability insurance for electric scooters in cities having a population of one million or more; and to amend the vehicle and traffic law, in relation to requirements for the sale and purchase of electric scooters",
 "SameAsPrintNo":"A116-2025","PreviousVersions":["S9614-2021","S5158-2023"]
}