{
 "PrintNo":"S8547","Session":2025,"Chamber":"SENATE","BillType":"Senate","Published":"2025-10-24T10:36:40.00568Z",
 "Status":"IN_SENATE_COMM","Committee":"Education",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2026-01-07","Committee":"Education"}],
 "Actions":[
  {"Text":"REFERRED TO RULES","Date":"2025-10-24","Chamber":"SENATE"},
  {"Text":"REFERRED TO EDUCATION","Date":"2026-01-07","Chamber":"SENATE"}
 ],
 "Sponsors":[
  {"ID":1493,"Name":"Alexis Weik","Short":"WEIK"},{"ID":1370,"Name":"George Borrello","Short":"BORRELLO"},
  {"ID":427,"Name":"Patrick M. Gallivan","Short":"GALLIVAN"},{"ID":1516,"Name":"Steve Rhoads","Short":"RHOADS"}
 ],
 "Title":"Relates to the electric school bus mandate; prohibits a mandate requiring school districts to purchase, operate or maintain any certain type of school buses; repeals certain provisions relating to electric buses",
 "Summary":"Removes references to the electric school bus mandate; provides that there shall be no mandate requiring school districts to purchase, operate or maintain any certain type of school buses and that the superintendent of each school district shall have the sole authority to determine the types of school buses such school district will purchase, operate and maintain; repeals certain provisions of law relating to electric school buses.",
 "LawSection":"Education Law",
 "LawCode":"Rpld §3638, §3623-a sub 2 ¶f, add §3638, amd §§3602, 3623-a, 1604 & 1709, Ed L; amd §11.00, Loc Fin L; rpld §1854 subs 22 & 23, §1884, Pub Auth L; amd §58-0701, rpld §58-0703 sub 1 ¶h, En Con L",
 "ActClause":"AN ACT to amend the education law, the local finance law and the environmental conservation law, in relation to removing references related to the electric school bus mandate; to amend the education law in relation to prohibiting mandates requiring school districts to use certain types of school buses; and to repeal certain provisions of the education law, the public authorities law and the environmental conservation law relating to electric school buses",
 "SameAsPrintNo":"A9308-2025"
}