{
 "PrintNo":"S8814","Session":2025,"Chamber":"SENATE","BillType":"Senate","Published":"2026-01-08T14:09:47.11303Z",
 "Status":"IN_SENATE_COMM","Committee":"Rules",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2026-01-08","Committee":"Rules"}],
 "Actions":[{"Text":"REFERRED TO RULES","Date":"2026-01-08","Chamber":"SENATE"}],
 "Sponsors":[{"ID":1571,"Name":"Patricia Fahy","Short":"FAHY"}],
 "Title":"Prohibits the sale of kratom to individuals under the age of twenty-one",
 "Summary":"Prohibits the sale of kratom to individuals under the age of twenty-one; prohibits the sale or dissemination of information recorded during transaction scans; imposes a civil penalty of not more than five hundred dollars for the sale or provision of kratom to any person under the age of twenty-one; repeals certain provisions relating thereto; repeals certain provisions requiring a study on kratom; relates to the effectiveness of a chapter of the laws of 2025 relating to prohibiting the sale of kratom to persons under the age of 21.",
 "LawSection":"Public Health Law",
 "LawCode":"Amd Art 13-F Art Head, rpld §1399-aa sub 19, §1399-mmm, add Art 13-I §1399-xx, Pub Health L; rpld §4, amd §5, Chap of 2025 (as proposed in S.4552-A & A.2340-A)",
 "ActClause":"AN ACT to amend the public health law, in relation to prohibiting the sale of kratom to individuals under the age of twenty-one; to repeal certain provisions of the public health law relating thereto; to repeal section 4 of a chapter of the laws of 2025 amending the public health law relating to the prohibition of the sale of kratom to individuals under the age of twenty-one, as proposed in legislative bills numbers S. 4552-A and A. 2340-A, relating to a study on kratom; and to amend a chapter of the laws of 2025 amending the public health law relating to the prohibition of the sale of kratom to individuals under the age of twenty-one, as proposed in legislative bills numbers S. 4552-A and A. 2340-A, in relation to the effectiveness thereof",
 "SameAsPrintNo":"A9472-2025"
}