{
 "PrintNo":"A10547","Session":2019,"Chamber":"ASSEMBLY","BillType":"Assembly","Published":"2020-05-28T23:59:28.266826Z",
 "Status":"IN_ASSEMBLY_COMM","Committee":"Health",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2020-05-28","Committee":"Health"}],
 "Actions":[{"Text":"REFERRED TO HEALTH","Date":"2020-05-28","Chamber":"ASSEMBLY"}],
 "Sponsors":[
  {"ID":655,"Name":"Maritza Davila","Short":"DAVILA"},{"ID":459,"Name":"Michael DenDekker","Short":"DENDEKKER"},
  {"ID":573,"Name":"Gary Finch","Short":"FINCH"},{"ID":906,"Name":"Rebecca Seawright","Short":"SEAWRIGHT"},
  {"ID":546,"Name":"Ellen C. Jaffee","Short":"JAFFEE"},{"ID":520,"Name":"Linda Rosenthal","Short":"ROSENTHAL L"},
  {"ID":504,"Name":"Felix Ortiz","Short":"ORTIZ"},{"ID":1243,"Name":"Simcha Eichenstein","Short":"EICHENSTEIN"},
  {"ID":663,"Name":"Walter T. Mosley","Short":"MOSLEY"},{"ID":907,"Name":"Jo Anne Simon","Short":"SIMON"},
  {"ID":908,"Name":"Karl Brabenec","Short":"BRABENEC"}
 ],
 "Title":"Requires the provision of video communication devices to certain patients during any time when visitor access is limited",
 "Summary":"Requires video communication devices for patients or residents in nursing homes, hospitals or facilities providing health related services when visitor access is limited; further requires that as part of a disaster preparedness plan that nursing homes, adult homes, enriched housing programs, and assisted living facilities provide video communication devices to patients for use when visitor access is limited, including, but not limited to during a designated state of emergency or a state disaster emergency.",
 "LawSection":"Public Health Law","LawCode":"Amd ยง2803-c, Pub Health L; amd ยง23-b, Exec L",
 "ActClause":"AN ACT to amend the public health law, in relation to video communication devices for patients or residents in nursing homes, hospitals or facilities providing health related services; and to amend the executive law, in relation to requiring as part of a disaster preparedness plan that nursing homes, adult homes, enriched housing programs, and assisted living facilities provide video communication devices to patients"
}