{
 "PrintNo":"A10601","Session":2019,"Chamber":"ASSEMBLY","BillType":"Assembly","Published":"2020-06-05T18:20:24.76389Z",
 "Status":"IN_ASSEMBLY_COMM","Committee":"Governmental Operations",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2020-06-05","Committee":"Governmental Operations"}],
 "Actions":[{"Text":"REFERRED TO GOVERNMENTAL OPERATIONS","Date":"2020-06-05","Chamber":"ASSEMBLY"}],
 "Sponsors":[
  {"ID":1249,"Name":"Marianne Buttenschon","Short":"BUTTENSCHON"},{"ID":549,"Name":"Aileen Gunther","Short":"GUNTHER"},
  {"ID":886,"Name":"Carrie Woerner","Short":"WOERNER"},{"ID":662,"Name":"John T. McDonald III","Short":"MCDONALD"},
  {"ID":464,"Name":"Fred Thiele","Short":"THIELE"},{"ID":1241,"Name":"Judy Griffin","Short":"GRIFFIN"},
  {"ID":527,"Name":"Richard Gottfried","Short":"GOTTFRIED R"},{"ID":1089,"Name":"Alicia Hyndman","Short":"HYNDMAN"},
  {"ID":621,"Name":"Sandy Galef","Short":"GALEF"},{"ID":546,"Name":"Ellen C. Jaffee","Short":"JAFFEE"},
  {"ID":625,"Name":"Didi Barrett","Short":"BARRETT"}
 ],
 "Title":"Requires the inclusion of diversity and inclusion training in the basic training and pre-employment course curricula for police, firefighters, correction officers and first responders",
 "Summary":"Requires the inclusion of diversity and inclusion training in the basic training and pre-employment course curricula for state police officers and municipal police officers and sheriffs, members of fire departments and companies, corrections officers, first responders, emergency medical technicians and advanced emergency medical technicians.",
 "LawSection":"Executive Law",
 "LawCode":"Add §214-g, Exec L; add §208-i, amd §204-d, Gen Muni L; add §155-a, Town L; add §22-b, Cor L; amd §3002, Pub Health L",
 "ActClause":"AN ACT to amend the executive law, the general municipal law and the town law, in relation to requiring the inclusion of diversity and inclusion training in the basic training and pre-employment course curriculums for state police officers and municipal police officers and sheriffs; to amend the general municipal law, in relation to requiring the inclusion of diversity and inclusion training in the basic training and pre-employment course curricula for members of fire departments and companies; to amend the correction law, in relation to requiring the inclusion of diversity and inclusion training in the basic training and pre-employment course curricula for correction officers; and to amend the public health law, in relation to requiring the inclusion of diversity and inclusion training in the basic training and pre-employment course curricula for first responders, emergency medical technicians and advanced emergency medical technicians",
 "SameAsPrintNo":"S8579-2019"
}