{
 "PrintNo":"A10905","Version":"A","Session":2019,"Chamber":"ASSEMBLY","BillType":"Assembly",
 "Published":"2020-08-17T12:37:27.796305Z","Status":"IN_ASSEMBLY_COMM","Committee":"Codes",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2020-09-11","Committee":"Codes"}],
 "Actions":[
  {"Text":"REFERRED TO CODES","Date":"2020-08-17","Chamber":"ASSEMBLY"},
  {"Text":"AMEND (T) AND RECOMMIT TO CODES","Date":"2020-09-11","Chamber":"ASSEMBLY"},
  {"Text":"PRINT NUMBER 10905A","Date":"2020-09-11","Chamber":"ASSEMBLY","Version":"A"}
 ],
 "Sponsors":[
  {"ID":511,"Name":"N. Nick Perry","Short":"PERRY"},{"ID":533,"Name":"Jeffrey Dinowitz","Short":"DINOWITZ"},
  {"ID":527,"Name":"Richard Gottfried","Short":"GOTTFRIED R"},{"ID":504,"Name":"Felix Ortiz","Short":"ORTIZ"},
  {"ID":906,"Name":"Rebecca Seawright","Short":"SEAWRIGHT"}
 ],
 "Title":"Relates to enacting the New York no citizen is above the law act",
 "Summary":"Provides that the period of immunity from prosecution for a criminal or civil action that a defendant is entitled to by virtue of holding the office of president of the United States shall not apply to the calculation of the time limitation applicable to commencement of such actions.",
 "LawSection":"Criminal Procedure Law","LawCode":"Amd ยง30.10, CP L; add ยง207-a, CPLR",
 "ActClause":"AN ACT to amend the criminal procedure law, in relation to the calculation of the time limitation applicable to commencement of a criminal action when the defendant is entitled to immunity from prosecution as a result of his or her entitlement to full, partial or qualified immunity by virtue of holding an elected public office; and to amend the civil practice law and rules, in relation to the calculation of the time in which certain prosecutions and actions must be commenced when the defendant is entitled to immunity from prosecution as a result of his or her entitlement to full, partial or qualified immunity by virtue of holding an elected public office",
 "SameAsPrintNo":"S8973-2019"
}