{
 "PrintNo":"A11040","Session":2019,"Chamber":"ASSEMBLY","BillType":"Assembly","Published":"2020-10-07T14:23:55.494987Z",
 "Status":"IN_ASSEMBLY_COMM","Committee":"Health",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2020-10-07","Committee":"Health"}],
 "Actions":[{"Text":"REFERRED TO HEALTH","Date":"2020-10-07","Chamber":"ASSEMBLY"}],
 "Sponsors":[
  {"ID":633,"Name":"Harry B. Bronson","Short":"BRONSON"},{"ID":576,"Name":"Donna Lupardo","Short":"LUPARDO"},
  {"ID":662,"Name":"John T. McDonald III","Short":"MCDONALD"},{"ID":906,"Name":"Rebecca Seawright","Short":"SEAWRIGHT"},
  {"ID":1147,"Name":"Steve Stern","Short":"STERN"},{"ID":1460,"Name":"Sarah Clark","Short":"CLARK"},
  {"ID":491,"Name":"Catherine Nolan","Short":"NOLAN"},{"ID":1259,"Name":"Jonathan Jacobson","Short":"JACOBSON"},
  {"ID":527,"Name":"Richard Gottfried","Short":"GOTTFRIED R"},{"ID":907,"Name":"Jo Anne Simon","Short":"SIMON"},
  {"ID":1462,"Name":"Demond Meeks","Short":"MEEKS"},{"ID":466,"Name":"Steven Englebright","Short":"ENGLEBRIGHT"}
 ],
 "Title":"Directs the department of health to publish the results of inspections conducted by the department in residential health care facilities in the state during the COVID-19 state disaster emergency",
 "Summary":"Directs the department of health to make publicly available the results of all inspections conducted by the department in nursing homes and other residential health care facilities in the state during the COVID-19 state disaster emergency, and to conduct a comparative study of practices utilized in nursing homes and other residential health care facilities in the state during the pendency of the COVID-19 state disaster emergency and identify best practices for ensuring the containment and prevention of future outbreaks of COVID-19 in residential health care facilities.",
 "LawSection":"Public Health",
 "ActClause":"AN ACT directing the department of health to make publicly available the results of all inspections conducted by such department in nursing homes and other residential health care facilities in the state during the COVID-19 state disaster emergency and to conduct a comparative study of practices utilized in nursing homes and other residential health care facilities in the state during the pendency of the COVID-19 state disaster emergency and identify best practices for ensuring the containment and prevention of future outbreaks of COVID-19 in residential health care facilities",
 "SameAsPrintNo":"S8890-2019"
}