{
 "PrintNo":"A1491","Session":2019,"Chamber":"ASSEMBLY","BillType":"Assembly","Published":"2019-01-15T13:32:35.613285Z",
 "Status":"IN_ASSEMBLY_COMM","Committee":"Governmental Operations",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2020-01-08","Committee":"Governmental Operations"}],
 "Actions":[
  {"Text":"REFERRED TO GOVERNMENTAL OPERATIONS","Date":"2019-01-15","Chamber":"ASSEMBLY"},
  {"Text":"REFERRED TO GOVERNMENTAL OPERATIONS","Date":"2020-01-08","Chamber":"ASSEMBLY"}
 ],
 "Sponsors":[
  {"ID":898,"Name":"Rodneyse Bichotte Hermelyn","Short":"BICHOTTE"},{"ID":907,"Name":"Jo Anne Simon","Short":"SIMON"},
  {"ID":663,"Name":"Walter T. Mosley","Short":"MOSLEY"},{"ID":1089,"Name":"Alicia Hyndman","Short":"HYNDMAN"},
  {"ID":896,"Name":"Latrice Walker","Short":"WALKER"},{"ID":673,"Name":"Michaelle C. Solages","Short":"SOLAGES"},
  {"ID":906,"Name":"Rebecca Seawright","Short":"SEAWRIGHT"},{"ID":899,"Name":"Michael Blake","Short":"BLAKE"},
  {"ID":527,"Name":"Richard Gottfried","Short":"GOTTFRIED R"},
  {"ID":901,"Name":"Kimberly Jean-Pierre","Short":"JEAN-PIERRE"},{"ID":457,"Name":"Vivian Cook","Short":"COOK"}
 ],
 "Title":"Requires utilization of minority and women-owned business enterprises as subcontractors as a condition when awarding sole source procurement contracts; relates to the issuance of waivers",
 "Summary":"Requires utilization of minority and women-owned business enterprises as subcontractors as a condition when awarding sole source procurement contracts; relates to the issuance of waivers of the obligation to comply with the minority and women-owned business enterprise participation requirements of a contract if such contract is a single source or sole source procurement contract; requires municipalities to require contract award recipients to utilize the services of minority and women-owned business enterprises; makes conforming changes.",
 "LawSection":"State Finance Law","LawCode":"Amd §163, St Fin L; amd §§313 & 310, Exec L; amd §103, Gen Muni L",
 "ActClause":"AN ACT to amend the state finance law, in relation to requiring utilization of minority and women-owned business enterprises as subcontractors as a condition when awarding sole source procurement contracts; to amend the executive law, in relation to the issuance of waivers of the obligation to comply with the minority and women-owned business enterprise participation requirements of a contract if such contract is a single source or sole source procurement contract; to amend the general municipal law, in relation to requiring municipalities to require contract award recipients to utilize the services of minority and women-owned business enterprises; to amend the executive law, in relation to making conforming changes; and providing for the repeal of certain provisions upon expiration thereof",
 "PreviousVersions":["A9700-2015","A240-2017"]
}