{
 "PrintNo":"A2730","Session":2019,"Chamber":"ASSEMBLY","BillType":"Assembly","Published":"2019-01-25T15:13:41.231253Z",
 "Status":"IN_ASSEMBLY_COMM","Committee":"Corporations, Authorities And Commissions",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2020-01-08","Committee":"Corporations, Authorities And Commissions"}],
 "Actions":[
  {"Text":"REFERRED TO CORPORATIONS, AUTHORITIES AND COMMISSIONS","Date":"2019-01-25","Chamber":"ASSEMBLY"},
  {"Text":"REFERRED TO CORPORATIONS, AUTHORITIES AND COMMISSIONS","Date":"2020-01-08","Chamber":"ASSEMBLY"}
 ],
 "Sponsors":[
  {"ID":503,"Name":"Joseph Lentol","Short":"LENTOL"},{"ID":1132,"Name":"Yuh-Line Niou","Short":"NIOU"},
  {"ID":655,"Name":"Maritza Davila","Short":"DAVILA"},{"ID":493,"Name":"Charles Barron","Short":"BARRON"},
  {"ID":663,"Name":"Walter T. Mosley","Short":"MOSLEY"}
 ],
 "Title":"Relates to mitigating the closure of the L subway line in the city of New York and establishing a temporary high-occupancy vehicle program on the Williamsburg bridge",
 "Summary":"Relates to mitigating the closure of the L subway line in the city of New York; directs the MTA in consultation with other relevant entities to develop a plan to mitigate the individual and economic hardships due to the L subway line closure; establishes a temporary high-occupancy vehicle program on the Williamsburg bridge by means of mobile or stationary photo devices.",
 "LawSection":"Public Authorities Law",
 "LawCode":"Add ยง1279-e, amd ยง1268, Pub Auth L; amd V & T L, generally; amd ยง87, Pub Off L",
 "ActClause":"AN ACT to amend the public authorities law and the vehicle and traffic law, in relation to mitigating the closure of the L subway line in the city of New York; and to amend the public authorities law, the vehicle and traffic law and the public officers law, in relation to establishing a temporary high-occupancy vehicle program on the Williamsburg bridge by means of mobile or stationary photo devices; and providing for the repeal of such provisions upon expiration thereof",
 "PreviousVersions":["A9861-2017"]
}