{
 "PrintNo":"A2987","Session":2019,"Chamber":"ASSEMBLY","BillType":"Assembly","Published":"2019-01-28T12:07:45.244256Z",
 "Status":"IN_ASSEMBLY_COMM","Committee":"Governmental Operations",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2020-01-08","Committee":"Governmental Operations"}],
 "Actions":[
  {"Text":"REFERRED TO GOVERNMENTAL OPERATIONS","Date":"2019-01-28","Chamber":"ASSEMBLY"},
  {"Text":"REFERRED TO GOVERNMENTAL OPERATIONS","Date":"2020-01-08","Chamber":"ASSEMBLY"}
 ],
 "Sponsors":[
  {"ID":898,"Name":"Rodneyse Bichotte Hermelyn","Short":"BICHOTTE"},{"ID":899,"Name":"Michael Blake","Short":"BLAKE"},
  {"ID":1089,"Name":"Alicia Hyndman","Short":"HYNDMAN"},{"ID":906,"Name":"Rebecca Seawright","Short":"SEAWRIGHT"},
  {"ID":896,"Name":"Latrice Walker","Short":"WALKER"},{"ID":675,"Name":"Phil Steck","Short":"STECK"},
  {"ID":1105,"Name":"Pamela J. Hunter","Short":"HUNTER"}
 ],
 "Title":"Eliminates the requirement that certain MWBE owners have a personal net worth of less than three million five hundred thousand dollars in order to obtain certification; repealer",
 "Summary":"Eliminates the requirement that certain minority and women-owned business enterprise owners have a personal net worth of less than three million five hundred thousand dollars in order to obtain certification as a certified minority and women-owned business enterprise; clarifies that an individual's net worth is to be considered in determining eligibility for certification under article 15-A of the executive law.",
 "LawSection":"Executive Law","LawCode":"Amd §§314 & 310, rpld §310 sub 19, Exec L",
 "ActClause":"AN ACT to amend the executive law, in relation to eliminating the requirement that certain minority and women-owned business enterprise owners have a personal net worth of less than three million five hundred thousand dollars in order to obtain certification as a qualifying minority and women-owned business enterprise; clarifying that an individual's net worth is not to be considered in determining eligibility for certification under Article 15-A of the executive law; and to repeal subdivision 19 of section 310 of the executive law relating to the definition of personal net worth",
 "PreviousVersions":["A9631-2017"]
}