{
 "PrintNo":"A3545","Session":2019,"Chamber":"ASSEMBLY","BillType":"Assembly","Published":"2019-01-29T15:26:05.508819Z",
 "Status":"IN_ASSEMBLY_COMM","Committee":"Local Governments",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2020-01-08","Committee":"Local Governments"}],
 "Actions":[
  {"Text":"REFERRED TO LOCAL GOVERNMENTS","Date":"2019-01-29","Chamber":"ASSEMBLY"},
  {"Text":"REFERRED TO LOCAL GOVERNMENTS","Date":"2020-01-08","Chamber":"ASSEMBLY"}
 ],
 "Sponsors":[
  {"ID":545,"Name":"Kenneth Zebrowski","Short":"ZEBROWSKI"},{"ID":590,"Name":"Robin Schimminger","Short":"SCHIMMINGER"},
  {"ID":1126,"Name":"Michael J. Norris","Short":"NORRIS"},{"ID":1133,"Name":"Monica P. Wallace","Short":"WALLACE"}
 ],
 "Title":"Authorizes municipalities and districts to enter into cooperative agreements for the provision of centralized public employee administrative and personnel services",
 "Summary":"Authorizes municipalities and districts to enter into cooperative agreements for the provision of centralized public employee administrative and personnel services; provides for health insurance coverage of municipal employees pursuant to standardized health insurance contracts; and authorizes the provision of reduced premiums for municipal health insurance plans which offer wellness programs.",
 "LawSection":"General Municipal Law",
 "LawCode":"Amd §§92-a, 119-n & 119-o, Gen Muni L; amd §§4702, 4704, 4705 & 4706, Ins L",
 "ActClause":"AN ACT to amend the general municipal law, in relation to authorizing cities, towns, villages, school districts, boards of cooperative educational services, library districts, fire districts, improvement districts and special districts to enter into cooperative agreements for the provision of centralized public employee administrative and personnel services; and to amend the insurance law, in relation to authorizing reduction of premiums for municipal cooperative health benefit plans which offer employee wellness programs",
 "PreviousVersions":["A6079-2011","A1448-2013","A5130-2015","A10133-2017"]
}