{
 "PrintNo":"A403","Session":2019,"Chamber":"ASSEMBLY","BillType":"Assembly","Published":"2019-01-07T11:32:44.115854Z",
 "Status":"IN_ASSEMBLY_COMM","Committee":"Education",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2020-01-08","Committee":"Education"}],
 "Actions":[
  {"Text":"REFERRED TO EDUCATION","Date":"2019-01-09","Chamber":"ASSEMBLY"},
  {"Text":"REFERRED TO EDUCATION","Date":"2020-01-08","Chamber":"ASSEMBLY"}
 ],
 "Sponsors":[
  {"ID":551,"Name":"Kevin Cahill","Short":"CAHILL"},{"ID":1144,"Name":"Harvey Epstein","Short":"EPSTEIN"},
  {"ID":591,"Name":"Crystal Peoples-Stokes","Short":"PEOPLES-STOKE"},{"ID":511,"Name":"N. Nick Perry","Short":"PERRY"},
  {"ID":464,"Name":"Fred Thiele","Short":"THIELE"}
 ],
 "Title":"Provides for the state to assume all costs of basic quality education; repealer",
 "Summary":"Makes provisions for the state to assume all costs of basic quality education and for the elimination of real property taxes for the support of education; requires board of regents to establish a schedule of mandatory basic services and costs thereof; provides that school districts shall submit an annual basic budget to the department of education for basic services; increases taxes on personal income and business; makes special provisions for reduction of tax in certain cities and for reduction in rent by tenants in such cities; provides for phased in methods of funding using a \"Basic Quality Education\" formula; repeals certain provisions of the tax law and real property tax law relating thereto.",
 "LawSection":"Education Law",
 "LawCode":"Add Title V Art 71 §§3501 - 3506, amd §§1909, 3601, 3602 & 3651, Ed L; rpld Art 13, amd RPT L, generally; rpld §§1204, 1211 & 1212, §1261 sub (e), §1262 sub (e), amd Tax L, generally",
 "ActClause":"AN ACT to amend the education law, the real property tax law and the tax law, in relation to abolishing certain school taxes, providing for alternative taxes and state distribution to school districts; and repealing certain provisions of the real property tax law and the tax law relating to certain taxes",
 "PreviousVersions":["A4746-2007","A6009-2009","A447-2011","A1598-2013","A1104-2015","A91-2017"]
}