{
 "PrintNo":"A4856","Session":2019,"Chamber":"ASSEMBLY","BillType":"Assembly","Published":"2019-02-05T14:33:34.819524Z",
 "Status":"IN_ASSEMBLY_COMM","Committee":"Consumer Affairs And Protection",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2020-01-08","Committee":"Consumer Affairs And Protection"}],
 "Actions":[
  {"Text":"REFERRED TO CONSUMER AFFAIRS AND PROTECTION","Date":"2019-02-05","Chamber":"ASSEMBLY"},
  {"Text":"REFERRED TO CONSUMER AFFAIRS AND PROTECTION","Date":"2020-01-08","Chamber":"ASSEMBLY"}
 ],
 "Sponsors":[
  {"ID":899,"Name":"Michael Blake","Short":"BLAKE"},{"ID":1144,"Name":"Harvey Epstein","Short":"EPSTEIN"},
  {"ID":1128,"Name":"Inez E. Dickens","Short":"DICKENS"},{"ID":536,"Name":"Carmen E. Arroyo","Short":"ARROYO"},
  {"ID":1258,"Name":"Nader Sayegh","Short":"SAYEGH"}
 ],
 "Title":"Authorizes the superintendent of financial services to oversee and regulate car dealer transactions with consumers",
 "Summary":"Authorizes the superintendent of financial services to oversee and regulate car dealer transactions with consumers; requires motor vehicle retail installment contracts to include an itemized listing of all costs related to the purchase of a motor vehicle and disclosure of the prohibition of conditional delivery; requires motor vehicle dealers to provide credit applicants with copies of all credit application documents; prohibits the conditional delivery of a motor vehicle.",
 "LawSection":"Financial Services Law",
 "LawCode":"Amd §301, Fin Serv L; amd §302, Pers Prop L; add §§417-d & 417-e, V & T L",
 "ActClause":"AN ACT to amend the financial services law, in relation to authorizing the superintendent of financial services to oversee and regulate sales of motor vehicles to consumers; to amend the personal property law, in relation to the contents of motor vehicle retail installment contracts; and to amend the vehicle and traffic law, in relation to requiring motor vehicle dealers to provide credit applicants with a copy of all loan application documents, and prohibiting conditional deliveries of motor vehicles",
 "PreviousVersions":["A7866-2015","A4619-2017"]
}