{
 "PrintNo":"S1328","Session":2019,"Chamber":"SENATE","BillType":"Senate","Published":"2019-01-14T10:04:48.787947Z",
 "Status":"IN_SENATE_COMM","Committee":"Codes",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2020-01-08","Committee":"Codes"}],
 "Actions":[
  {"Text":"REFERRED TO CODES","Date":"2019-01-14","Chamber":"SENATE"},
  {"Text":"REFERRED TO CODES","Date":"2020-01-08","Chamber":"SENATE"}
 ],
 "Sponsors":[
  {"ID":427,"Name":"Patrick M. Gallivan","Short":"GALLIVAN"},
  {"ID":406,"Name":"Michael H. Ranzenhofer","Short":"RANZENHOFER"}
 ],
 "Title":"Enacts the \"child victims protection and accountability act\"",
 "Summary":"Enacts the \"child victims protection and accountability act\"; relates to the period of limitation and commencement of actions for certain child abuse cases; requires that the office of court administration shall provide training for judges and justices with respect to crimes involving sexual abuse of minors (Part A); relates to reports of child abuse to law enforcement; relates to falsely reporting an incident in the third degree (Part B); and prohibits retaliatory personnel action by employers of corporations formed other than for profit (Part C).",
 "LawSection":"Criminal Procedure Law",
 "LawCode":"Amd §30.10, CP L; amd §208, CPLR; amd §§50-e & 50-i, Gen Muni L; amd §10, Ct Claims Act; amd §3813, Ed L; amd §219-c, Judy L; amd §413, add Art 6 Title 6-B §§429-a - 429-e, Soc Serv L; amd §240.50, Pen L; amd §740, add §742, Lab L",
 "ActClause":"AN ACT to amend the criminal procedure law and the civil practice law and rules, in relation to the period of limitation for certain child abuse cases; to amend the general municipal law, the court of claims act and the education law, in relation to certain notices of claim and commencement of certain actions; and to amend the judiciary law, in relation to requiring that the office of court administration shall provide training for judges and justices with respect to crimes involving sexual abuse of minors (Part A); to amend the social services law, in relation to reports of child abuse to law enforcement; and to amend the penal law, in relation to falsely reporting an incident in the third degree (Part B); and to amend the labor law, in relation to prohibiting retaliatory personnel action by employers of corporations formed other than for profit (Part C)",
 "PreviousVersions":["S9190-2017"]
}