{
 "PrintNo":"S1505","Version":"C","Session":2019,"Chamber":"SENATE","BillType":"Senate",
 "Published":"2019-01-18T18:29:38.408711Z","Status":"SIGNED_BY_GOV",
 "Milestones":[
  {"Type":"IN_SENATE_COMM","Date":"2019-03-28","Committee":"Finance"},{"Type":"SENATE_FLOOR","Date":"2019-03-31"},
  {"Type":"PASSED_SENATE","Date":"2019-03-31"},
  {"Type":"IN_ASSEMBLY_COMM","Date":"2019-03-31","Committee":"Ways And Means"},
  {"Type":"ASSEMBLY_FLOOR","Date":"2019-03-31"},{"Type":"PASSED_ASSEMBLY","Date":"2019-03-31"},
  {"Type":"DELIVERED_TO_GOV","Date":"2019-04-01"},{"Type":"SIGNED_BY_GOV","Date":"2019-04-12"}
 ],
 "Actions":[
  {"Text":"REFERRED TO FINANCE","Date":"2019-01-18","Chamber":"SENATE"},
  {"Text":"AMEND (T) AND RECOMMIT TO FINANCE","Date":"2019-02-19","Chamber":"SENATE"},
  {"Text":"PRINT NUMBER 1505A","Date":"2019-02-19","Chamber":"SENATE","Version":"A"},
  {"Text":"AMEND (T) AND RECOMMIT TO FINANCE","Date":"2019-03-12","Chamber":"SENATE","Version":"A"},
  {"Text":"PRINT NUMBER 1505B","Date":"2019-03-12","Chamber":"SENATE","Version":"B"},
  {"Text":"AMEND (T) AND RECOMMIT TO FINANCE","Date":"2019-03-28","Chamber":"SENATE","Version":"B"},
  {"Text":"PRINT NUMBER 1505C","Date":"2019-03-28","Chamber":"SENATE","Version":"C"},
  {"Text":"ORDERED TO THIRD READING CAL.357","Date":"2019-03-31","Chamber":"SENATE","Version":"C"},
  {"Text":"PASSED SENATE","Date":"2019-03-31","Chamber":"SENATE","Version":"C"},
  {"Text":"DELIVERED TO ASSEMBLY","Date":"2019-03-31","Chamber":"SENATE","Version":"C"},
  {"Text":"REFERRED TO WAYS AND MEANS","Date":"2019-03-31","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"SUBSTITUTED FOR A2005C","Date":"2019-03-31","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"ORDERED TO THIRD READING RULES CAL.43","Date":"2019-03-31","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"PASSED ASSEMBLY","Date":"2019-03-31","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"RETURNED TO SENATE","Date":"2019-03-31","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"DELIVERED TO GOVERNOR","Date":"2019-04-01","Chamber":"SENATE","Version":"C"},
  {"Text":"SIGNED CHAP.55","Date":"2019-04-12","Chamber":"SENATE","Version":"C"}
 ],
 "Votes":[
  {
   "VoteType":"COMMITTEE","Date":"2019-03-31","Version":"C","Chamber":"SENATE","Committee":"Finance",
   "Votes":[
    {"ID":1102,"Name":"Jamaal Bailey","Short":"BAILEY","Vote":"Aye"},
    {"ID":1136,"Name":"Brian Benjamin","Short":"BENJAMIN","Vote":"Aye"},
    {"ID":372,"Name":"Neil D. Breslin","Short":"BRESLIN","Vote":"Aye"},
    {"ID":888,"Name":"Leroy Comrie","Short":"COMRIE","Vote":"Aye"},
    {"ID":438,"Name":"Brad Hoylman-Sigal","Short":"HOYLMAN","Vote":"Aye"},
    {"ID":429,"Name":"Timothy M. Kennedy","Short":"KENNEDY","Vote":"Aye"},
    {"ID":401,"Name":"Liz Krueger","Short":"KRUEGER","Vote":"Aye"},
    {"ID":1225,"Name":"John Liu","Short":"LIU","Vote":"Aye"},
    {"ID":381,"Name":"Velmanette Montgomery","Short":"MONTGOMERY","Vote":"Aye"},
    {"ID":416,"Name":"Kevin S. Parker","Short":"PARKER","Vote":"Aye"},
    {"ID":377,"Name":"Gustavo Rivera","Short":"RIVERA","Vote":"Aye"},
    {"ID":403,"Name":"Diane J. Savino","Short":"SAVINO","Vote":"Aye"},
    {"ID":1232,"Name":"James Skoufis","Short":"SKOUFIS","Vote":"Aye"},
    {"ID":400,"Name":"Toby Ann Stavisky","Short":"STAVISKY","Vote":"Aye"},
    {"ID":1223,"Name":"Kevin Thomas","Short":"THOMAS","Vote":"Aye"},
    {"ID":1236,"Name":"Bob Antonacci","Short":"ANTONACCI","Vote":"Nay"},
    {"ID":409,"Name":"Andrew J. Lanza","Short":"LANZA","Vote":"Nay"},
    {"ID":419,"Name":"Kenneth P. LaValle","Short":"LAVALLE","Vote":"Nay"},
    {"ID":379,"Name":"Betty Little","Short":"LITTLE","Vote":"Nay"},
    {"ID":406,"Name":"Michael H. Ranzenhofer","Short":"RANZENHOFER","Vote":"Nay"},
    {"ID":423,"Name":"Patty Ritchie","Short":"RITCHIE","Vote":"Nay"},
    {"ID":417,"Name":"Joseph E. Robach","Short":"ROBACH","Vote":"Nay"},
    {"ID":371,"Name":"James L. Seward","Short":"SEWARD","Vote":"Nay"}
   ]
  },
  {
   "VoteType":"FLOOR","Date":"2019-03-31","Version":"C",
   "Votes":[
    {"ID":384,"Name":"Joseph P. Addabbo Jr.","Short":"ADDABBO","Vote":"Aye"},
    {"ID":1102,"Name":"Jamaal Bailey","Short":"BAILEY","Vote":"Aye"},
    {"ID":1136,"Name":"Brian Benjamin","Short":"BENJAMIN","Vote":"Aye"},
    {"ID":1231,"Name":"Alessandra Biaggi","Short":"BIAGGI","Vote":"Aye"},
    {"ID":372,"Name":"Neil D. Breslin","Short":"BRESLIN","Vote":"Aye"},
    {"ID":1101,"Name":"John E. Brooks","Short":"BROOKS","Vote":"Aye"},
    {"ID":370,"Name":"David Carlucci","Short":"CARLUCCI","Vote":"Aye"},
    {"ID":888,"Name":"Leroy Comrie","Short":"COMRIE","Vote":"Aye"},
    {"ID":439,"Name":"Simcha Felder","Short":"FELDER","Vote":"Aye"},
    {"ID":1222,"Name":"Jim Gaughran","Short":"GAUGHRAN","Vote":"Aye"},
    {"ID":383,"Name":"Michael Gianaris","Short":"GIANARIS","Vote":"Aye"},
    {"ID":1229,"Name":"Andrew Gounardes","Short":"GOUNARDES","Vote":"Aye"},
    {"ID":1233,"Name":"Pete Harckham","Short":"HARCKHAM","Vote":"Aye"},
    {"ID":438,"Name":"Brad Hoylman-Sigal","Short":"HOYLMAN","Vote":"Aye"},
    {"ID":1230,"Name":"Robert Jackson","Short":"JACKSON","Vote":"Aye"},
    {"ID":918,"Name":"Todd Kaminsky","Short":"KAMINSKY","Vote":"Aye"},
    {"ID":1224,"Name":"Anna Kaplan","Short":"KAPLAN","Vote":"Aye"},
    {"ID":1140,"Name":"Brian Kavanagh","Short":"KAVANAGH","Vote":"Aye"},
    {"ID":429,"Name":"Timothy M. Kennedy","Short":"KENNEDY","Vote":"Aye"},
    {"ID":401,"Name":"Liz Krueger","Short":"KRUEGER","Vote":"Aye"},
    {"ID":1225,"Name":"John Liu","Short":"LIU","Vote":"Aye"},
    {"ID":1221,"Name":"Monica Martinez","Short":"MARTINEZ","Vote":"Aye"},
    {"ID":1237,"Name":"Rachel May","Short":"MAY","Vote":"Aye"},
    {"ID":1143,"Name":"Shelley Mayer","Short":"MAYER","Vote":"Aye"},
    {"ID":1234,"Name":"Jen Metzger","Short":"METZGER","Vote":"Aye"},
    {"ID":381,"Name":"Velmanette Montgomery","Short":"MONTGOMERY","Vote":"Aye"},
    {"ID":1228,"Name":"Zellnor Myrie","Short":"MYRIE","Vote":"Aye"},
    {"ID":416,"Name":"Kevin S. Parker","Short":"PARKER","Vote":"Aye"},
    {"ID":914,"Name":"Roxanne J. Persaud","Short":"PERSAUD","Vote":"Aye"},
    {"ID":1226,"Name":"Jessica Ramos","Short":"RAMOS","Vote":"Aye"},
    {"ID":377,"Name":"Gustavo Rivera","Short":"RIVERA","Vote":"Aye"},
    {"ID":1227,"Name":"Julia Salazar","Short":"SALAZAR","Vote":"Aye"},
    {"ID":432,"Name":"James Sanders Jr.","Short":"SANDERS","Vote":"Aye"},
    {"ID":403,"Name":"Diane J. Savino","Short":"SAVINO","Vote":"Aye"},
    {"ID":1142,"Name":"Luis R. Sepúlveda","Short":"SEPULVEDA","Vote":"Aye"},
    {"ID":373,"Name":"José M. Serrano","Short":"SERRANO","Vote":"Aye"},
    {"ID":1232,"Name":"James Skoufis","Short":"SKOUFIS","Vote":"Aye"},
    {"ID":400,"Name":"Toby Ann Stavisky","Short":"STAVISKY","Vote":"Aye"},
    {"ID":396,"Name":"Andrea Stewart-Cousins","Short":"STEWART-COUSINS","Vote":"Aye"},
    {"ID":1223,"Name":"Kevin Thomas","Short":"THOMAS","Vote":"Aye"},
    {"ID":913,"Name":"Fredrick J. Akshar II","Short":"AKSHAR","Vote":"Nay"},
    {"ID":892,"Name":"George Amedore","Short":"AMEDORE","Vote":"Nay"},
    {"ID":1236,"Name":"Bob Antonacci","Short":"ANTONACCI","Vote":"Nay"},
    {"ID":433,"Name":"Phil Boyle","Short":"BOYLE","Vote":"Nay"},
    {"ID":399,"Name":"John J. Flanagan","Short":"FLANAGAN","Vote":"Nay"},
    {"ID":887,"Name":"Rich Funke","Short":"FUNKE","Vote":"Nay"},
    {"ID":427,"Name":"Patrick M. Gallivan","Short":"GALLIVAN","Vote":"Nay"},
    {"ID":393,"Name":"Joseph A. Griffo","Short":"GRIFFO","Vote":"Nay"},
    {"ID":951,"Name":"Pamela Helming","Short":"HELMING","Vote":"Nay"},
    {"ID":1099,"Name":"Chris Jacobs","Short":"JACOBS","Vote":"Nay"},
    {"ID":1235,"Name":"Daphne Jordan","Short":"JORDAN","Vote":"Nay"},
    {"ID":409,"Name":"Andrew J. Lanza","Short":"LANZA","Vote":"Nay"},
    {"ID":419,"Name":"Kenneth P. LaValle","Short":"LAVALLE","Vote":"Nay"},
    {"ID":379,"Name":"Betty Little","Short":"LITTLE","Vote":"Nay"},
    {"ID":415,"Name":"Thomas F. O'Mara","Short":"O'MARA","Vote":"Nay"},
    {"ID":885,"Name":"Robert Ortt","Short":"ORTT","Vote":"Nay"},
    {"ID":406,"Name":"Michael H. Ranzenhofer","Short":"RANZENHOFER","Vote":"Nay"},
    {"ID":423,"Name":"Patty Ritchie","Short":"RITCHIE","Vote":"Nay"},
    {"ID":417,"Name":"Joseph E. Robach","Short":"ROBACH","Vote":"Nay"},
    {"ID":890,"Name":"Susan Serino","Short":"SERINO","Vote":"Nay"},
    {"ID":371,"Name":"James L. Seward","Short":"SEWARD","Vote":"Nay"},
    {"ID":1103,"Name":"James Tedisco","Short":"TEDISCO","Vote":"Nay"}
   ]
  }
 ],
 "Title":"Enacts into law major components of legislation necessary to implement the state public protection and general government budget for the 2019-2020 state fiscal year",
 "Summary":"Enacts into law major components of legislation necessary to implement the state public protection and general government budget for the 2019-2020 state fiscal year; relates to the protection of the personal privacy of public employees (Part E); extends the authorization for public arbitration panels (Part F); creates a class one reassessment exemption in a special assessing unit that is not a city (Part J); extends certain provisions related to opportunities for service-disabled veteran-owned business enterprises (Part L); extends certain provisions relating to expanding the geographic area of employment of certain police officers, prisoner furloughs in certain cases and the crime of absconding therefrom, inmate work release, certain appropriations made by chapter 50 of the laws of 1994 enacting the state operations budget, the incarceration fee, merging the department of correctional services and division of parole into the department of corrections and community supervision, prison and jail housing and alternatives to detention and incarceration programs, the ignition interlock device program, the use of closed-circuit television and other protective measures for certain child witnesses, electronic court appearance in certain counties, enacting the interstate compact for adult offender supervision, limiting the closing of certain correctional facilities, providing for the custody by the department of correctional services of inmates serving definite sentences, providing for custody of federal prisoners and requiring the closing of certain correctional facilities, military funds of the organized militia, providing for community treatment facilities and establishing the crime of absconding from the community treatment facility, pre-criminal proceeding settlements in the city of New York, the psychological testing of correctional candidates, and other provisions relating thereto (Part O); relates to the admissibility of a victim's sexual conduct in a sex offense (Part R); extends the workers' compensation board's authority to resolve medical bill disputes and simplify the process (Part CC); increases certain court fees and increases the amount of such fees which are deposited in the indigent legal services fund (Part DD); authorizes the alienation of certain parklands in the town of Hastings, county of Oswego (Part FF); authorizes the use of centralized services by public authorities and public benefit corporations to acquire energy products as a centralized service from the office of general services; extends certain provisions relating to authorizing the aggregate purchases of energy for state agencies, institutions, local governments, public authorities and public benefit corporations; and amends the effectiveness of certain provisions providing centralized service to political subdivisions and the authority of the commissioner of general services to aggregate purchases of energy for state agencies and political subdivisions (Part GG); increases the maximum contract amount during construction emergencies to $1,500,000 and extends provisions relating to value limitations on contracts to June 30, 2022 (Part HH); removes unnecessary barriers to reentry of people with criminal histories into society; relates to licensing consideration for check cashers (Subpart A); relates to eligibility for serving on a New York city community district education council and city wide council (Subpart B); relates to licensing consideration for bingo suppliers (Subpart C); relates to licensing consideration for notary publics (Subpart D); relates to licensing considerations for suppliers of games of chance, for games of chance licensees, for bingo licensees, and for lessors of premises to bingo licensees (Subpart E); relates to licensing considerations for insurer adjusters and for employment with insurance adjusters (Subpart F); relates to licensing considerations for real estate brokers or real estate salesmen (Subpart G); relates to participation as employer in subsidized employer programs (Subpart H); relates to eligibility for employment by a driver's school (Subpart I); relates to a certificate of relief from a disability and repeals certain provisions of the vehicle and traffic law, relating to mandatory suspension of drivers' licenses for certain offenses (Subpart J); prohibits disclosure of law enforcement booking information and photographs (Subpart K); relates to exclusion of undisposed cases from criminal history record searches (Subpart L); directs the commissioner of the division of criminal justice services to seal certain records of any action or proceeding terminated in favor of the accused or convictions for certain traffic violations; and relates to certain reports of criminal history record searches (Subpart M); prevents employment discrimination against persons whose criminal charges have been adjourned in contemplation of dismissal (Subpart N); prevents employment discrimination against persons whose criminal charges have been adjourned in contemplation of dismissal (Subpart O)(Part II); relates to shock incarceration (Part KK); reduces certain sentences of imprisonment for misdemeanors to three hundred sixty-four days (Part OO); restricts forfeiture actions and creates greater accountability for seized assets; creates an asset forfeiture escrow fund; relates to reporting certain demographic information (Part PP); relates to requiring reports on the use of force (Part RR); authorizes the Suffolk county clerk to charge a block fee (Part SS); relates to the closure of correctional facilities; and provides for the repeal of such provisions upon expiration thereof (Part TT); makes provisions permanent relating to notice of foreclosure and mandatory settlement conferences in residential foreclosure actions (Part VV); includes felony drug offender sentences as eligible for a reduced sentence in certain circumstances where such offender was a victim of domestic violence (Part WW); authorizes computer generated registration lists; relates to the list of supplies to be delivered to poll sites (Part XX); relates to time allowed for employees to vote (Part YY); requires the establishment and regular updating of a model law enforcement use of force policy suitable for adoption by any agency that employs police or peace officers (Part ZZ); prohibits certain loans to be made to candidates or political committees (Part AAA); provides uniform polling hours during primary elections (Part BBB); establishes the voter enfranchisement modernization act (Part CCC).",
 "LawSection":"Budget Bills","LawCode":"Amd Various Laws, generally",
 "ActClause":"AN ACT intentionally omitted (Part A); intentionally omitted (Part B); intentionally omitted (Part C); intentionally omitted (Part D); to amend the civil service law, in relation to protection of the personal privacy of public employees (Part E); to amend the civil service law, in relation to the expiration of public arbitration panels (Part F); intentionally omitted (Part G); intentionally omitted (Part H); intentionally omitted (Part I); to amend the real property tax law, in relation to a class one reassessment exemption in a special assessing unit that is not a city (Part J); intentionally omitted (Part K); to amend chapter 22 of the laws of 2014, relating to expanding opportunities for service-disabled veteran-owned business enterprises, in relation to extending the provisions thereof (Part L); intentionally omitted (Part M); intentionally omitted (Part N); to amend chapter 887 of the laws of 1983, amending the correction law relating to the psychological testing of candidates, in relation to the effectiveness thereof; to amend chapter 428 of the laws of 1999, amending the executive law and the criminal procedure law relating to expanding the geographic area of employment of certain police officers, in relation to extending the expiration of such chapter; to amend chapter 886 of the laws of 1972, amending the correction law and the penal law relating to prisoner furloughs in certain cases and the crime of absconding therefrom, in relation to the effectiveness thereof; to amend chapter 261 of the laws of 1987, amending chapters 50, 53 and 54 of the laws of 1987, the correction law, the penal law and other chapters and laws relating to correctional facilities, in relation to the effectiveness thereof; to amend chapter 55 of the laws of 1992, amending the tax law and other laws relating to taxes, surcharges, fees and funding, in relation to extending the expiration of certain provisions of such chapter; to amend chapter 339 of the laws of 1972, amending the correction law and the penal law relating to inmate work release, furlough and leave, in relation to the effectiveness thereof; to amend chapter 60 of the laws of 1994 relating to certain provisions which impact upon expenditure of certain appropriations made by chapter 50 of the laws of 1994 enacting the state operations budget, in relation to the effectiveness thereof; to amend chapter 3 of the laws of 1995, amending the correction law and other laws relating to the incarceration fee, in relation to extending the expiration of certain provisions of such chapter; to amend chapter 62 of the laws of 2011, amending the correction law and the executive law relating to merging the department of correctional services and division of parole into the department of corrections and community supervision, in relation to the effectiveness thereof; to amend chapter 907 of the laws of 1984, amending the correction law, the New York city criminal court act and the executive law relating to prison and jail housing and alternatives to detention and incarceration programs, in relation to extending the expiration of certain provisions of such chapter; to amend chapter 166 of the laws of 1991, amending the tax law and other laws relating to taxes, in relation to extending the expiration of certain provisions of such chapter; to amend the vehicle and traffic law, in relation to extending the expiration of the mandatory surcharge and victim assistance fee; to amend chapter 713 of the laws of 1988, amending the vehicle and traffic law relating to the ignition interlock device program, in relation to extending the expiration thereof; to amend chapter 435 of the laws of 1997, amending the military law and other laws relating to various provisions, in relation to extending the expiration date of the merit provisions of the correction law and the penal law of such chapter; to amend chapter 412 of the laws of 1999, amending the civil practice law and rules and the court of claims act relating to prisoner litigation reform, in relation to extending the expiration of the inmate filing fee provisions of the civil practice law and rules and general filing fee provision and inmate property claims exhaustion requirement of the court of claims act of such chapter; to amend chapter 222 of the laws of 1994 constituting the family protection and domestic violence intervention act of 1994, in relation to extending the expiration of certain provisions of the criminal procedure law requiring the arrest of certain persons engaged in family violence; to amend chapter 505 of the laws of 1985, amending the criminal procedure law relating to the use of closed-circuit television and other protective measures for certain child witnesses, in relation to extending the expiration of the provisions thereof; to amend chapter 3 of the laws of 1995, enacting the sentencing reform act of 1995, in relation to extending the expiration of certain provisions of such chapter; to amend chapter 689 of the laws of 1993 amending the criminal procedure law relating to electronic court appearance in certain counties, in relation to extending the expiration thereof; to amend chapter 688 of the laws of 2003, amending the executive law relating to enacting the interstate compact for adult offender supervision, in relation to the effectiveness thereof; to amend chapter 56 of the laws of 2009, amending the correction law relating to limiting the closing of certain correctional facilities, providing for the custody by the department of correctional services of inmates serving definite sentences, providing for custody of federal prisoners and requiring the closing of certain correctional facilities, in relation to the effectiveness of such chapter; to amend chapter 152 of the laws of 2001 amending the military law relating to military funds of the organized militia, in relation to the effectiveness thereof; to amend chapter 554 of the laws of 1986, amending the correction law and the penal law relating to providing for community treatment facilities and establishing the crime of absconding from the community treatment facility, in relation to the effectiveness thereof; and to amend chapter 55 of the laws of 2018 amending the criminal procedure law relating to pre-criminal proceeding settlements in the city of New York, in relation to the effectiveness thereof (Part O); intentionally omitted (Part P); intentionally omitted (Part Q); to amend the criminal procedure law, in relation to admissibility of a victim's sexual conduct in a sex offense (Part R); intentionally omitted (Part S); intentionally omitted (Part T); intentionally omitted (Part U); intentionally omitted (Part V); intentionally omitted (Part W); intentionally omitted (Part X); intentionally omitted (Part Y); intentionally omitted (Part Z); intentionally omitted (Part AA); intentionally omitted (Part BB); to amend the workers' compensation law, in relation to extending the board's authority to resolve medical bill disputes and simplify the process (Part CC); to amend section 14 of part J of chapter 62 of the laws of 2003, amending the county law and other laws relating to fees collected, in relation to certain fees collected by the office of court administration (Part DD); intentionally omitted (Part EE); authorizing the alienation of certain parklands in the town of Hastings, county of Oswego (Part FF); to amend the state finance law, in relation to authorizing use of centralized services by public authorities and public benefit corporations to acquire energy products as centralized services from the office of general services; to amend chapter 410 of the laws of 2009, amending the state finance law relating to authorizing the aggregate purchases of energy for state agencies, institutions, local governments, public authorities and public benefit corporations, in relation to the effectiveness thereof; and to amend part C of chapter 97 of the laws of 2011, amending the state finance law and other laws relating to providing certain centralized service to political subdivisions and extending the authority of the commissioner of general services to aggregate purchases of energy for state agencies and political subdivisions, in relation to the effectiveness thereof (Part GG); to amend the public buildings law, in relation to increasing the maximum contract amount during construction emergencies; and to amend chapter 674 of the laws of 1993, amending the public buildings law relating to value limitations on contracts, in relation to extending such provisions thereof (Part HH); to amend the banking law, in relation to licensing considerations for check cashers (Subpart A); to amend the education law, in relation to eligibility for serving on a New York city community district education council and city-wide council (Subpart B); to amend the executive law, in relation to licensing considerations for bingo suppliers (Subpart C); to amend the executive law, in relation to licensing considerations for notary publics (Subpart D); to amend the general municipal law, in relation to licensing considerations for suppliers of games of chance, for games of chance licensees, for bingo licensees, and for lessors of premises to bingo licensees (Subpart E); to amend the insurance law, in relation to licensing considerations for insurer adjusters and for employment with insurance adjusters; and to repeal certain provisions of such law relating thereto (Subpart F); to amend the real property law, in relation to licensing considerations for real estate brokers or real estate salesmen (Subpart G); to amend the social services law, in relation to participation as employer in subsidized employer programs (Subpart H); to amend the vehicle and traffic law, in relation to eligibility for employment by a driver's school (Subpart I); to amend the correction law, in relation to a certificate of relief from a disability; and to repeal certain provisions of the vehicle and traffic law, relating to mandatory suspension of drivers' licenses for certain offenses (Subpart J); to amend the public officers law, in relation to prohibiting disclosure of law enforcement booking information and photographs (Subpart K); to amend the executive law and the judiciary law, in relation to exclusion of undisposed cases from criminal history record searches (Subpart L); directs the commissioner of the division of criminal justice services to seal certain records of any action or proceeding terminated in favor of the accused or convictions for certain traffic violations; and to amend the judiciary law, in relation to certain reports of criminal history record searches (Subpart M); to amend the executive law and the judiciary law, in relation to preventing employment discrimination against persons whose criminal charges have been adjourned in contemplation of dismissal (Subpart N); to amend the executive law, in relation to preventing employment discrimination against persons whose criminal charges have been adjourned in contemplation of dismissal (Subpart O); intentionally omitted (Subpart P) (Part II); intentionally omitted (Part JJ); to amend the penal law and the correction law, in relation to shock incarceration (Part KK); intentionally omitted (Part LL); intentionally omitted (Part MM); intentionally omitted (Part NN); to amend the penal law and the criminal procedure law, in relation to reducing certain sentences of imprisonment for misdemeanors to three hundred sixty-four days (Part OO); to amend the civil practice law and rules, the county law and the general municipal law, in relation to restricting forfeiture actions and creating greater accountability for seized assets; and to amend the criminal procedure law and the penal law, in relation to reporting certain demographic data (Part PP); intentionally omitted (Part QQ); to amend the executive law, in relation to requiring reports on the use of force (Part RR); to amend the civil practice law and rules, in relation to authorizing the Suffolk county clerk to charge a block fee (Part SS); in relation to the closure of correctional facilities; and providing for the repeal of such provisions upon expiration thereof (Part TT); intentionally omitted (Part UU); to amend chapter 507 of the laws of 2009, amending the real property actions and proceedings law and other laws relating to home mortgage loans, in relation to making provisions permanent relating to notice of foreclosure and mandatory settlement conferences in residential foreclosure actions (Part VV); to amend the penal law, in relation to sentencing in domestic violence cases (Part WW); to amend the election law, in relation to authorizing computer generated registration lists; in relation to the list of supplies to be delivered to poll sites (Part XX); to amend the election law, in relation to time allowed for employees to vote (Part YY); to amend the executive law, in relation to requiring the establishment and regular updating of a model law enforcement use of force policy suitable for adoption by any law enforcement agency in the state (Part ZZ); to amend the election law, in relation to prohibiting certain loans to be made to candidates or political committees (Part AAA); to amend the election law, in relation to providing uniform polling hours during primary elections (Part BBB); and to amend the election law, in relation to enacting the Voter Enfranchisement Modernization Act of 2019; in relation to establishing the electronic personal voter registration process (Part CCC)",
 "SameAsPrintNo":"A2005-2019"
}