{
 "PrintNo":"S1527","Version":"C","Session":2019,"Chamber":"SENATE","BillType":"Senate",
 "Published":"2019-01-15T10:23:06.164627Z","Status":"IN_SENATE_COMM","Committee":"Finance",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2020-03-12","Committee":"Finance"}],
 "Actions":[
  {"Text":"REFERRED TO FINANCE","Date":"2019-01-15","Chamber":"SENATE"},
  {"Text":"AMEND (T) AND RECOMMIT TO FINANCE","Date":"2019-05-24","Chamber":"SENATE"},
  {"Text":"PRINT NUMBER 1527A","Date":"2019-05-24","Chamber":"SENATE","Version":"A"},
  {"Text":"AMEND AND RECOMMIT TO FINANCE","Date":"2019-06-12","Chamber":"SENATE","Version":"A"},
  {"Text":"PRINT NUMBER 1527B","Date":"2019-06-12","Chamber":"SENATE","Version":"B"},
  {"Text":"REFERRED TO FINANCE","Date":"2020-01-08","Chamber":"SENATE","Version":"B"},
  {"Text":"AMEND AND RECOMMIT TO FINANCE","Date":"2020-03-12","Chamber":"SENATE","Version":"B"},
  {"Text":"PRINT NUMBER 1527C","Date":"2020-03-12","Chamber":"SENATE","Version":"C"}
 ],
 "Sponsors":[
  {"ID":401,"Name":"Liz Krueger","Short":"KRUEGER"},{"ID":1102,"Name":"Jamaal Bailey","Short":"BAILEY"},
  {"ID":1231,"Name":"Alessandra Biaggi","Short":"BIAGGI"},{"ID":370,"Name":"David Carlucci","Short":"CARLUCCI"},
  {"ID":888,"Name":"Leroy Comrie","Short":"COMRIE"},{"ID":383,"Name":"Michael Gianaris","Short":"GIANARIS"},
  {"ID":438,"Name":"Brad Hoylman-Sigal","Short":"HOYLMAN"},{"ID":1230,"Name":"Robert Jackson","Short":"JACKSON"},
  {"ID":429,"Name":"Timothy M. Kennedy","Short":"KENNEDY"},{"ID":1225,"Name":"John Liu","Short":"LIU"},
  {"ID":1237,"Name":"Rachel May","Short":"MAY"},{"ID":1234,"Name":"Jen Metzger","Short":"METZGER"},
  {"ID":381,"Name":"Velmanette Montgomery","Short":"MONTGOMERY"},{"ID":1228,"Name":"Zellnor Myrie","Short":"MYRIE"},
  {"ID":416,"Name":"Kevin S. Parker","Short":"PARKER"},{"ID":1226,"Name":"Jessica Ramos","Short":"RAMOS"},
  {"ID":377,"Name":"Gustavo Rivera","Short":"RIVERA"},{"ID":1227,"Name":"Julia Salazar","Short":"SALAZAR"},
  {"ID":432,"Name":"James Sanders Jr.","Short":"SANDERS"},{"ID":403,"Name":"Diane J. Savino","Short":"SAVINO"},
  {"ID":1142,"Name":"Luis R. Sepúlveda","Short":"SEPULVEDA"},{"ID":373,"Name":"José M. Serrano","Short":"SERRANO"}
 ],
 "Title":"Enacts the \"marihuana regulation and taxation act\"; repealer",
 "Summary":"Enacts the \"marihuana regulation and taxation act\"; relates to the description of cannabis, and the growing of and use of cannabis by persons twenty-one years of age or older; makes technical changes regarding the definition of cannabis; relates to removing certain references to marijuana relating to forfeiture actions; relates to the qualification of certain offenses involving cannabis and exempts certain persons from prosecution for the use, consumption, display, production or distribution of cannabis; relates to the definition of smoking; provides for the licensure of persons authorized to produce, process and sell marihuana; levies an excise tax on certain sales of cannabis; repeals certain provisions of the penal law relating to the criminal sale of cannabis and provisions of the general business law relating to drug paraphernalia; creates the New York state cannabis revenue fund, the New York state drug treatment and public education fund and the New York state community grants reinvestment fund.",
 "LawSection":"Public Health Law","LawCode":"Amd Various Laws, generally",
 "ActClause":"AN ACT in relation to constituting chapter 7-A of the consolidated laws, in relation to the creation of a new office of cannabis management, as an independent entity within the division of alcoholic beverage control, providing for the licensure of persons authorized to cultivate, process, distribute and sell cannabis and the use of cannabis by persons aged twenty-one or older; to amend the public health law, in relation to the description of cannabis; to amend the penal law, in relation to the growing and use of cannabis by persons twenty-one years of age or older; to amend the tax law, in relation to providing for the levying of taxes on cannabis; to amend the criminal procedure law, the civil practice law and rules, the general business law, the state finance law, the executive law, the penal law, the alcoholic beverage control law, the general obligations law, the social services law, the agriculture and markets law and the vehicle and traffic law, in relation to making conforming changes; to amend the public health law, in relation to the definition of smoking; to amend the state finance law, in relation to establishing the New York state cannabis revenue fund, the New York state drug treatment and public education fund and the New York state community grants reinvestment fund; to amend chapter 90 of the laws of 2014 amending the public health law, the tax law, the state finance law, the general business law, the penal law and the criminal procedure law relating to medical use of marihuana, in relation to the effectiveness thereof; to repeal certain provisions of the public health law relating to growing of cannabis and medical use of marihuana; to repeal article 221 of the penal law relating to offenses involving marihuana; to repeal paragraph (f) of subdivision 2 of section 850 of the general business law relating to drug related paraphernalia; to repeal certain provisions of the criminal procedure law relating to certain criminal actions; and to repeal certain provisions of the agriculture and markets law relating to industrial hemp",
 "SameAsPrintNo":"A1617-2019","PreviousVersions":["S6005-2013","S1747-2015","S3040-2017"]
}