{
 "PrintNo":"S2852","Version":"A","Session":2019,"Chamber":"SENATE","BillType":"Senate",
 "Published":"2019-01-30T09:23:34.736099Z","Status":"IN_SENATE_COMM","Committee":"Finance",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2020-01-08","Committee":"Finance"}],
 "Actions":[
  {"Text":"REFERRED TO FINANCE","Date":"2019-01-30","Chamber":"SENATE"},
  {"Text":"AMEND AND RECOMMIT TO FINANCE","Date":"2019-03-26","Chamber":"SENATE"},
  {"Text":"PRINT NUMBER 2852A","Date":"2019-03-26","Chamber":"SENATE","Version":"A"},
  {"Text":"REFERRED TO FINANCE","Date":"2020-01-08","Chamber":"SENATE","Version":"A"}
 ],
 "Sponsors":[
  {"ID":399,"Name":"John J. Flanagan","Short":"FLANAGAN"},{"ID":419,"Name":"Kenneth P. LaValle","Short":"LAVALLE"},
  {"ID":1222,"Name":"Jim Gaughran","Short":"GAUGHRAN"}
 ],
 "Title":"Relates to authorizing funds to municipalities from the UDC in the case of certain tax certiorari challenges or agreed upon settlements and permits tax certiorari stabilization reserve funds",
 "Summary":"Authorizes funds to municipalities from the UDC in the case of certain tax certiorari challenges or agreed upon settlements resulting in loss of tax revenues or increased tax levies of over twenty percent or in regards to a settlement agreement, a reduction in real property taxes or a payment in lieu of taxes of at least twenty percent in the aggregate over the term of such settlement agreement; and permits the establishment of tax certiorari stabilization reserve funds.",
 "LawSection":"New York State Urban Development and Research Corp. Act",
 "LawCode":"Amd Part C Subpart H ยง1, Chap 20 of 2015",
 "ActClause":"AN ACT to amend subpart H of part C of chapter 20 of the laws of 2015, relating to appropriating money for certain municipal corporations and school districts, in relation to authorizing funds in the case of certain tax certiorari challenges or agreed upon settlements; and to permit certain boards of education to establish a tax certiorari stabilization reserve fund",
 "PreviousVersions":["S8235-2017"]
}