{
 "PrintNo":"S6039","Version":"A","Session":2019,"Chamber":"SENATE","BillType":"Senate",
 "Published":"2019-05-16T17:30:57.248429Z","Status":"IN_SENATE_COMM","Committee":"Civil Service And Pensions",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2020-01-08","Committee":"Civil Service And Pensions"}],
 "Actions":[
  {"Text":"REFERRED TO CIVIL SERVICE AND PENSIONS","Date":"2019-05-16","Chamber":"SENATE"},
  {"Text":"AMEND AND RECOMMIT TO CIVIL SERVICE AND PENSIONS","Date":"2019-06-18","Chamber":"SENATE"},
  {"Text":"PRINT NUMBER 6039A","Date":"2019-06-18","Chamber":"SENATE","Version":"A"},
  {"Text":"REFERRED TO CIVIL SERVICE AND PENSIONS","Date":"2020-01-08","Chamber":"SENATE","Version":"A"}
 ],
 "Sponsors":[{"ID":403,"Name":"Diane J. Savino","Short":"SAVINO"}],
 "Title":"Establishes disability retirement benefits for certain members who suffer any condition or impairment of health caused by diseases of the lung",
 "Summary":"Establishes disability retirement benefits for certain members who suffer any condition or impairment of health caused by diseases of the lung; covers certain titles under the New York city employees' retirement system; provides that covered members who are diagnosed with any condition of impairment of health caused by diseases of the lung, resulting in disability to such member, presently employed, and who shall have sustained such disability while so employed, shall have such diagnosis be presumptive evidence that such disability was incurred in the performance and discharge of duty, unless the contrary be proven by competent evidence.",
 "LawSection":"Retirement and Social Security Law","LawCode":"Add ยง605-f, R & SS L; add ยง13-168.1, NYC Ad Cd",
 "ActClause":"AN ACT to amend the retirement and social security law and the administrative code of the city of New York, in relation to establishing disability retirement benefits for certain members who suffer any condition or impairment of health caused by diseases of the lung",
 "SameAsPrintNo":"A9873-2019"
}