{
 "PrintNo":"S6810","Session":2019,"Chamber":"SENATE","BillType":"Senate","Published":"2019-10-25T16:00:21.033044Z",
 "Status":"IN_SENATE_COMM","Committee":"Judiciary",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2020-01-08","Committee":"Judiciary"}],
 "Actions":[
  {"Text":"REFERRED TO RULES","Date":"2019-10-25","Chamber":"SENATE"},
  {"Text":"REFERRED TO JUDICIARY","Date":"2020-01-08","Chamber":"SENATE"}
 ],
 "Sponsors":[
  {"ID":438,"Name":"Brad Hoylman-Sigal","Short":"HOYLMAN"},{"ID":1231,"Name":"Alessandra Biaggi","Short":"BIAGGI"},
  {"ID":1229,"Name":"Andrew Gounardes","Short":"GOUNARDES"},{"ID":1230,"Name":"Robert Jackson","Short":"JACKSON"},
  {"ID":1224,"Name":"Anna Kaplan","Short":"KAPLAN"},{"ID":429,"Name":"Timothy M. Kennedy","Short":"KENNEDY"},
  {"ID":1225,"Name":"John Liu","Short":"LIU"},{"ID":1237,"Name":"Rachel May","Short":"MAY"},
  {"ID":1234,"Name":"Jen Metzger","Short":"METZGER"},{"ID":1227,"Name":"Julia Salazar","Short":"SALAZAR"}
 ],
 "Title":"Relates to the statute of limitations for civil actions related to certain sexual offenses committed against a person eighteen years of age or older",
 "Summary":"Relates to the statute of limitations for civil actions related to certain sexual offenses committed against a person eighteen years of age or older, revives such actions otherwise barred by the existing statute of limitations and grants trial preference to such actions; directs the chief administrator of the courts to promulgate rules for the timely adjudication of certain revived actions.",
 "LawSection":"Civil Practice Law and Rules","LawCode":"Add ยง214-h, amd R3403, CPLR; add ยง219-e, Judy L",
 "ActClause":"AN ACT to amend the civil practice law and rules, in relation to the statute of limitations for civil actions related to certain sexual offenses committed against a person eighteen years of age or older, reviving such actions otherwise barred by the existing statute of limitations and granting trial preference to such actions; and to amend the judiciary law, in relation to directing the chief administrator of the courts to promulgate rules for the timely adjudication of certain revived actions",
 "SameAsPrintNo":"A8726-2019"
}