{
 "PrintNo":"S6849","Session":2019,"Chamber":"SENATE","BillType":"Senate","Published":"2019-11-13T09:35:16.01095Z",
 "Status":"IN_SENATE_COMM","Committee":"Codes",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2020-01-08","Committee":"Codes"}],
 "Actions":[
  {"Text":"REFERRED TO RULES","Date":"2019-11-13","Chamber":"SENATE"},
  {"Text":"REFERRED TO CODES","Date":"2020-01-08","Chamber":"SENATE"}
 ],
 "Sponsors":[
  {"ID":1103,"Name":"James Tedisco","Short":"TEDISCO"},{"ID":913,"Name":"Fredrick J. Akshar II","Short":"AKSHAR"},
  {"ID":1370,"Name":"George Borrello","Short":"BORRELLO"},{"ID":887,"Name":"Rich Funke","Short":"FUNKE"},
  {"ID":951,"Name":"Pamela Helming","Short":"HELMING"},{"ID":1099,"Name":"Chris Jacobs","Short":"JACOBS"},
  {"ID":1235,"Name":"Daphne Jordan","Short":"JORDAN"},{"ID":379,"Name":"Betty Little","Short":"LITTLE"},
  {"ID":415,"Name":"Thomas F. O'Mara","Short":"O'MARA"},{"ID":885,"Name":"Robert Ortt","Short":"ORTT"},
  {"ID":423,"Name":"Patty Ritchie","Short":"RITCHIE"},{"ID":417,"Name":"Joseph E. Robach","Short":"ROBACH"},
  {"ID":371,"Name":"James L. Seward","Short":"SEWARD"}
 ],
 "Title":"Repeals certain provisions relating to the issuance of securing orders to conforming changes",
 "Summary":"Repeals certain provisions relating to the issuance of securing orders to conforming changes, time limits for a speedy trial, establishing new criminal discovery rules, certain resentencing by operation of law, reducing certain sentences of imprisonment for misdemeanors to three hundred sixty-four days, requiring reports on the use of force, requiring the establishment and regular updating of a model law enforcement use of force policy suitable for adoption by any law enforcement agency in the state.",
 "LawSection":"Criminal Procedure",
 "LawCode":"Rpld Parts JJJ, KKK, LLL & MMM, Chap 59 of 2019; rpld Parts OO, RR & ZZ, Chap 55 of 2019",
 "ActClause":"AN ACT to repeal part JJJ of chapter 59 of the laws of 2019, amending the criminal procedure law relating to the issuance of securing orders and to making conforming changes; to repeal part KKK of chapter 59 of the laws of 2019, amending the criminal procedure law relating to time limits for a speedy trial; to repeal part LLL of chapter 59 of the laws of 2019, amending the criminal procedure law and the penal law relating to establishing new criminal discovery rules; to repeal part MMM of chapter 59 of the laws of 2019, amending the penal law relating to certain resentencing by operation of law; to repeal part OO of chapter 55 of the laws of 2019, amending the penal law and the criminal procedure law relating to reducing certain sentences of imprisonment for misdemeanors to three hundred sixty-four days; to repeal part RR of chapter 55 of the laws of 2019, amending the executive law relating to requiring reports on the use of force; and to repeal part ZZ of chapter 55 of the laws of 2019, amending the executive law relating to requiring the establishment and regular updating of a model law enforcement use of force policy suitable for adoption by any law enforcement agency in the state",
 "SameAsPrintNo":"A8855-2019"
}