{
 "PrintNo":"S7505","Version":"B","Session":2019,"Chamber":"SENATE","BillType":"Senate",
 "Published":"2020-01-22T18:21:32.374353Z","Status":"SIGNED_BY_GOV",
 "Milestones":[
  {"Type":"IN_SENATE_COMM","Date":"2020-03-31","Committee":"Finance"},{"Type":"SENATE_FLOOR","Date":"2020-03-31"},
  {"Type":"PASSED_SENATE","Date":"2020-03-31"},
  {"Type":"IN_ASSEMBLY_COMM","Date":"2020-03-31","Committee":"Ways And Means"},
  {"Type":"ASSEMBLY_FLOOR","Date":"2020-04-01"},{"Type":"PASSED_ASSEMBLY","Date":"2020-04-01"},
  {"Type":"DELIVERED_TO_GOV","Date":"2020-04-03"},{"Type":"SIGNED_BY_GOV","Date":"2020-04-03"}
 ],
 "Actions":[
  {"Text":"REFERRED TO FINANCE","Date":"2020-01-22","Chamber":"SENATE"},
  {"Text":"AMEND (T) AND RECOMMIT TO FINANCE","Date":"2020-02-22","Chamber":"SENATE"},
  {"Text":"PRINT NUMBER 7505A","Date":"2020-02-22","Chamber":"SENATE","Version":"A"},
  {"Text":"AMEND (T) AND RECOMMIT TO FINANCE","Date":"2020-03-31","Chamber":"SENATE","Version":"A"},
  {"Text":"PRINT NUMBER 7505B","Date":"2020-03-31","Chamber":"SENATE","Version":"B"},
  {"Text":"ORDERED TO THIRD READING CAL.620","Date":"2020-03-31","Chamber":"SENATE","Version":"B"},
  {"Text":"MESSAGE OF NECESSITY - 3 DAY MESSAGE","Date":"2020-03-31","Chamber":"SENATE","Version":"B"},
  {"Text":"PASSED SENATE","Date":"2020-03-31","Chamber":"SENATE","Version":"B"},
  {"Text":"DELIVERED TO ASSEMBLY","Date":"2020-03-31","Chamber":"SENATE","Version":"B"},
  {"Text":"REFERRED TO WAYS AND MEANS","Date":"2020-03-31","Chamber":"ASSEMBLY","Version":"B"},
  {"Text":"SUBSTITUTED FOR A9505B","Date":"2020-04-01","Chamber":"ASSEMBLY","Version":"B"},
  {"Text":"ORDERED TO THIRD READING RULES CAL.19","Date":"2020-04-01","Chamber":"ASSEMBLY","Version":"B"},
  {"Text":"MESSAGE OF NECESSITY - 3 DAY MESSAGE","Date":"2020-04-01","Chamber":"ASSEMBLY","Version":"B"},
  {"Text":"PASSED ASSEMBLY","Date":"2020-04-01","Chamber":"ASSEMBLY","Version":"B"},
  {"Text":"RETURNED TO SENATE","Date":"2020-04-01","Chamber":"ASSEMBLY","Version":"B"},
  {"Text":"DELIVERED TO GOVERNOR","Date":"2020-04-03","Chamber":"SENATE","Version":"B"},
  {"Text":"SIGNED CHAP.55","Date":"2020-04-03","Chamber":"SENATE","Version":"B"}
 ],
 "Votes":[
  {
   "VoteType":"COMMITTEE","Date":"2020-03-31","Version":"B","Chamber":"SENATE","Committee":"Finance",
   "Votes":[
    {"ID":1102,"Name":"Jamaal Bailey","Short":"BAILEY","Vote":"Aye"},
    {"ID":1136,"Name":"Brian Benjamin","Short":"BENJAMIN","Vote":"Aye"},
    {"ID":372,"Name":"Neil D. Breslin","Short":"BRESLIN","Vote":"Aye"},
    {"ID":888,"Name":"Leroy Comrie","Short":"COMRIE","Vote":"Aye"},
    {"ID":438,"Name":"Brad Hoylman-Sigal","Short":"HOYLMAN","Vote":"Aye"},
    {"ID":429,"Name":"Timothy M. Kennedy","Short":"KENNEDY","Vote":"Aye"},
    {"ID":401,"Name":"Liz Krueger","Short":"KRUEGER","Vote":"Aye"},
    {"ID":1225,"Name":"John Liu","Short":"LIU","Vote":"Aye"},
    {"ID":381,"Name":"Velmanette Montgomery","Short":"MONTGOMERY","Vote":"Aye"},
    {"ID":416,"Name":"Kevin S. Parker","Short":"PARKER","Vote":"Aye"},
    {"ID":377,"Name":"Gustavo Rivera","Short":"RIVERA","Vote":"Aye"},
    {"ID":403,"Name":"Diane J. Savino","Short":"SAVINO","Vote":"Aye"},
    {"ID":1232,"Name":"James Skoufis","Short":"SKOUFIS","Vote":"Aye"},
    {"ID":400,"Name":"Toby Ann Stavisky","Short":"STAVISKY","Vote":"Aye"},
    {"ID":1223,"Name":"Kevin Thomas","Short":"THOMAS","Vote":"Aye"},
    {"ID":419,"Name":"Kenneth P. LaValle","Short":"LAVALLE","Vote":"Aye"},
    {"ID":427,"Name":"Patrick M. Gallivan","Short":"GALLIVAN","Vote":"Nay"},
    {"ID":409,"Name":"Andrew J. Lanza","Short":"LANZA","Vote":"Nay"},
    {"ID":379,"Name":"Betty Little","Short":"LITTLE","Vote":"Nay"},
    {"ID":406,"Name":"Michael H. Ranzenhofer","Short":"RANZENHOFER","Vote":"Nay"},
    {"ID":423,"Name":"Patty Ritchie","Short":"RITCHIE","Vote":"Nay"},
    {"ID":417,"Name":"Joseph E. Robach","Short":"ROBACH","Vote":"Nay"},
    {"ID":371,"Name":"James L. Seward","Short":"SEWARD","Vote":"Excused"}
   ]
  },
  {
   "VoteType":"FLOOR","Date":"2020-03-31","Version":"B",
   "Votes":[
    {"ID":384,"Name":"Joseph P. Addabbo Jr.","Short":"ADDABBO","Vote":"Aye"},
    {"ID":1102,"Name":"Jamaal Bailey","Short":"BAILEY","Vote":"Aye"},
    {"ID":1136,"Name":"Brian Benjamin","Short":"BENJAMIN","Vote":"Aye"},
    {"ID":1231,"Name":"Alessandra Biaggi","Short":"BIAGGI","Vote":"Aye"},
    {"ID":372,"Name":"Neil D. Breslin","Short":"BRESLIN","Vote":"Aye"},
    {"ID":1101,"Name":"John E. Brooks","Short":"BROOKS","Vote":"Aye"},
    {"ID":370,"Name":"David Carlucci","Short":"CARLUCCI","Vote":"Aye"},
    {"ID":888,"Name":"Leroy Comrie","Short":"COMRIE","Vote":"Aye"},
    {"ID":439,"Name":"Simcha Felder","Short":"FELDER","Vote":"Aye"},
    {"ID":1222,"Name":"Jim Gaughran","Short":"GAUGHRAN","Vote":"Aye"},
    {"ID":383,"Name":"Michael Gianaris","Short":"GIANARIS","Vote":"Aye"},
    {"ID":1229,"Name":"Andrew Gounardes","Short":"GOUNARDES","Vote":"Aye"},
    {"ID":1233,"Name":"Pete Harckham","Short":"HARCKHAM","Vote":"Aye"},
    {"ID":438,"Name":"Brad Hoylman-Sigal","Short":"HOYLMAN","Vote":"Aye"},
    {"ID":1230,"Name":"Robert Jackson","Short":"JACKSON","Vote":"Aye"},
    {"ID":918,"Name":"Todd Kaminsky","Short":"KAMINSKY","Vote":"Aye"},
    {"ID":1224,"Name":"Anna Kaplan","Short":"KAPLAN","Vote":"Aye"},
    {"ID":1140,"Name":"Brian Kavanagh","Short":"KAVANAGH","Vote":"Aye"},
    {"ID":429,"Name":"Timothy M. Kennedy","Short":"KENNEDY","Vote":"Aye"},
    {"ID":401,"Name":"Liz Krueger","Short":"KRUEGER","Vote":"Aye"},
    {"ID":1225,"Name":"John Liu","Short":"LIU","Vote":"Aye"},
    {"ID":1221,"Name":"Monica Martinez","Short":"MARTINEZ","Vote":"Aye"},
    {"ID":1237,"Name":"Rachel May","Short":"MAY","Vote":"Aye"},
    {"ID":1143,"Name":"Shelley Mayer","Short":"MAYER","Vote":"Aye"},
    {"ID":1234,"Name":"Jen Metzger","Short":"METZGER","Vote":"Aye"},
    {"ID":381,"Name":"Velmanette Montgomery","Short":"MONTGOMERY","Vote":"Aye"},
    {"ID":416,"Name":"Kevin S. Parker","Short":"PARKER","Vote":"Aye"},
    {"ID":914,"Name":"Roxanne J. Persaud","Short":"PERSAUD","Vote":"Aye"},
    {"ID":377,"Name":"Gustavo Rivera","Short":"RIVERA","Vote":"Aye"},
    {"ID":432,"Name":"James Sanders Jr.","Short":"SANDERS","Vote":"Aye"},
    {"ID":403,"Name":"Diane J. Savino","Short":"SAVINO","Vote":"Aye"},
    {"ID":1142,"Name":"Luis R. Sepúlveda","Short":"SEPULVEDA","Vote":"Aye"},
    {"ID":373,"Name":"José M. Serrano","Short":"SERRANO","Vote":"Aye"},
    {"ID":1232,"Name":"James Skoufis","Short":"SKOUFIS","Vote":"Aye"},
    {"ID":400,"Name":"Toby Ann Stavisky","Short":"STAVISKY","Vote":"Aye"},
    {"ID":396,"Name":"Andrea Stewart-Cousins","Short":"STEWART-COUSINS","Vote":"Aye"},
    {"ID":1223,"Name":"Kevin Thomas","Short":"THOMAS","Vote":"Aye"},
    {"ID":913,"Name":"Fredrick J. Akshar II","Short":"AKSHAR","Vote":"Nay"},
    {"ID":892,"Name":"George Amedore","Short":"AMEDORE","Vote":"Nay"},
    {"ID":1370,"Name":"George Borrello","Short":"BORRELLO","Vote":"Nay"},
    {"ID":433,"Name":"Phil Boyle","Short":"BOYLE","Vote":"Nay"},
    {"ID":399,"Name":"John J. Flanagan","Short":"FLANAGAN","Vote":"Nay"},
    {"ID":887,"Name":"Rich Funke","Short":"FUNKE","Vote":"Nay"},
    {"ID":427,"Name":"Patrick M. Gallivan","Short":"GALLIVAN","Vote":"Nay"},
    {"ID":393,"Name":"Joseph A. Griffo","Short":"GRIFFO","Vote":"Nay"},
    {"ID":951,"Name":"Pamela Helming","Short":"HELMING","Vote":"Nay"},
    {"ID":1099,"Name":"Chris Jacobs","Short":"JACOBS","Vote":"Nay"},
    {"ID":1235,"Name":"Daphne Jordan","Short":"JORDAN","Vote":"Nay"},
    {"ID":409,"Name":"Andrew J. Lanza","Short":"LANZA","Vote":"Nay"},
    {"ID":419,"Name":"Kenneth P. LaValle","Short":"LAVALLE","Vote":"Nay"},
    {"ID":379,"Name":"Betty Little","Short":"LITTLE","Vote":"Nay"},
    {"ID":1228,"Name":"Zellnor Myrie","Short":"MYRIE","Vote":"Nay"},
    {"ID":415,"Name":"Thomas F. O'Mara","Short":"O'MARA","Vote":"Nay"},
    {"ID":885,"Name":"Robert Ortt","Short":"ORTT","Vote":"Nay"},
    {"ID":1226,"Name":"Jessica Ramos","Short":"RAMOS","Vote":"Nay"},
    {"ID":406,"Name":"Michael H. Ranzenhofer","Short":"RANZENHOFER","Vote":"Nay"},
    {"ID":423,"Name":"Patty Ritchie","Short":"RITCHIE","Vote":"Nay"},
    {"ID":417,"Name":"Joseph E. Robach","Short":"ROBACH","Vote":"Nay"},
    {"ID":1227,"Name":"Julia Salazar","Short":"SALAZAR","Vote":"Nay"},
    {"ID":890,"Name":"Susan Serino","Short":"SERINO","Vote":"Nay"},
    {"ID":1103,"Name":"James Tedisco","Short":"TEDISCO","Vote":"Nay"},
    {"ID":371,"Name":"James L. Seward","Short":"SEWARD","Vote":"Excused"}
   ]
  }
 ],
 "Title":"Enacts into law major components of legislation necessary to implement the state public protection and general government budget for the 2020-2021 state fiscal year",
 "Summary":"Enacts into law major components of legislation necessary to implement the state public protection and general government budget for the 2020-2021 state fiscal year; relates to extending the effectiveness of certain provisions of law relating to various criminal justice and public safety programs (Part A); establishes the criminal justice discovery compensation fund (Part E); relates to the closure of correctional facilities (Part F); relates to moving adolescent offenders to the office of children and family services (Part G); relates to suspending the transfer of monies into the emergency services revolving loan fund from the public safety communications account (Part I); establishesg the safe homes and families act (Part M); relates to firearm licenses, requires a list of offenses in states and territories of the United States other than New York that include all of the essential elements of a serious offense be maintained and updated annually (Part N); relates to determining whether certain misdemeanor crimes are serious offenses under the penal law (Part Q); enacts the \"Josef Neumann Hate Crimes Domestic Terrorism Act\" which makes it a crime for a person to commit a domestic act of terrorism motivated by hate (Part R); relates to continuing to protect and strengthen unions (Part W); relates to defining the term technology for purposes of state purchasing requirements (Part Y); relates to statewide financial system procurements for joint appointing authority for the state financial system project (Part Z); relates to leases of premises in the county of Albany, and elsewhere as required, for providing space for departments, commissions, boards and officers of the state government (Part AA); relates to the sale of alcoholic beverages in certain international airports (Part FF); relates to conducting full manual recounts on ballots (Part JJ); relates to AIM-related sales tax payments in the counties of Nassau and Erie (Part NN); includes acts of domestic violence in the criteria the court shall consider in determining the equitable disposition of property during divorce proceedings (Part PP); relates to ensuring pay equity at state and local public authorities (Part QQ); relates to disclosure requirements for certain nonprofits (Part UU); relates to the powers of the members of the commission on legislative, judicial and executive compensation (Part WW); relates to rights of sexual offense victims; provides that sexual offense victims shall be informed that a rape crisis or victim assistance organization is available to provide victims with transportation from a medical facility (Subpart A); provides guidelines to determine regulatory fines for small businesses and amends the effective date for S. 5815-C and A. 7540-B to be repealed two years after the effective date (Subpart B); relates to specifying the use for which certain state lands are to be transferred to the city of New Rochelle (Subpart C); relates to exempting income earned by persons under the age of 24 from certain workforce development programs from the determination of need for public assistance programs (Subpart D); permits special districts to adopt local laws providing for an exemption for improvements to residential real proeprty for the purpose of facilitating accessibility of such property to a physcially disabed owner (Subpart E); relates to adding components sold with instructions to combine such components to create combustion or detonation to the definition of \"explosives\" (Subpart F); qualifies the amount of rental surcharge persons or families shall pay in company projects (Subpart G); relates to renaming certain subway stations (Subpart H); provides for the continuity of the Roosevelt Island operating corporation (Subpart I); establishes a sexual discrimination training program within the state office for the aging (Subpart J); details policies or contracts which are not included in the definition of student accident and health insurance (Subpart K); relates to notice of indicated reports of child maltreatment and changes of placement in child protective and voluntary foster care placement and review proceedings (Subpart L); provides access to students on information pertaining to voter education (Subpart M); relates to canvass of ballots cast by certain voters (Subpart N); relates to the licensing of persons engaged in the design, construction, inspection, maintenance, alteration, and repair of elevators and other automated people moving devices; qualifies fund availability from the elevator and related conveyances safety program account; specifies what is not included in the definition of elevator work; sets forth qualifications and exemptions for licensing as an elevator agency technician; repeals certain sections of the labor law and the administrative code of the city of New York and changes the effective date for the licensing requirements of persons engaged in design, construction, inspection, maintenance, alteration and repair of elevators to two years after the act takes effect (Subpart O); relates to proof of eligibility for volunteer firefighter enhanced cancer disability benefits (Subpart P); relates to \"lease-end\" charges (Subpart Q); enacts the New York call center jobs act (Subpart R); provides for payment assistance and other information for HIV post-exposure prophylaxis and other health care services for sexual assault victims (Subpart S); relates to authorizing retail licenses to purchase beer with a business payment card (Subpart T); relates to the senior wellness in nutrition fund (Subpart U); relates to the definition of a research tobacco product (Subpart V); authorizes retail licensees to purchase beer with a business payment card (Subpart W); relates to a television writers' and directors' fees and salaries credit (Subpart X); relates to the payment of wages to workers (Subpart Y); relates to reverse mortgage loans (Subpart Z); relates to the regulation of toxic chemicals in children's products (Subpart AA); relates to the electronic open auction public bond sale pilot program (Subpart BB); relates to allowing the commissioner of transportation to impound or immobilize stretch limousines in certain situations (Subpart CC)(Part XX); relates to the Nassau county interim finance authority (Part YY); relates to repealing certain provisions requiring voter approval for the issuance of bonds or bonds and capital notes in an amount in excess of ten million dollars to finance any capital improvement in Westchester county (Part ZZ); relates to permitting employees at least two hours paid time off for voting (Part AAA).",
 "LawSection":"Budget Bills","LawCode":"Amd Various Laws, generally",
 "ActClause":"AN ACT to amend chapter 887 of the laws of 1983, amending the correction law relating to the psychological testing of candidates, in relation to the effectiveness thereof; to amend chapter 428 of the laws of 1999, amending the executive law and the criminal procedure law relating to expanding the geographic area of employment of certain police officers, in relation to extending the expiration of such chapter; to amend chapter 886 of the laws of 1972, amending the correction law and the penal law relating to prisoner furloughs in certain cases and the crime of absconding therefrom, in relation to the effectiveness thereof; to amend chapter 261 of the laws of 1987, amending chapters 50, 53 and 54 of the laws of 1987, the correction law, the penal law and other chapters and laws relating to correctional facilities, in relation to the effectiveness thereof; to amend chapter 55 of the laws of 1992, amending the tax law and other laws relating to taxes, surcharges, fees and funding, in relation to extending the expiration of certain provisions of such chapter; to amend chapter 339 of the laws of 1972, amending the correction law and the penal law relating to inmate work release, furlough and leave, in relation to the effectiveness thereof; to amend chapter 60 of the laws of 1994 relating to certain provisions which impact upon expenditure of certain appropriations made by chapter 50 of the laws of 1994 enacting the state operations budget, in relation to the effectiveness thereof; to amend chapter 3 of the laws of 1995, amending the correction law and other laws relating to the incarceration fee, in relation to extending the expiration of certain provisions of such chapter; to amend chapter 62 of the laws of 2011, amending the correction law and the executive law relating to merging the department of correctional services and division of parole into the department of corrections and community supervision, in relation to the effectiveness thereof; to amend chapter 907 of the laws of 1984, amending the correction law, the New York city criminal court act and the executive law relating to prison and jail housing and alternatives to detention and incarceration programs, in relation to extending the expiration of certain provisions of such chapter; to amend chapter 166 of the laws of 1991, amending the tax law and other laws relating to taxes, in relation to extending the expiration of certain provisions of such chapter; to amend the vehicle and traffic law, in relation to extending the expiration of the mandatory surcharge and victim assistance fee; to amend chapter 713 of the laws of 1988, amending the vehicle and traffic law relating to the ignition interlock device program, in relation to extending the expiration thereof; to amend chapter 435 of the laws of 1997, amending the military law and other laws relating to various provisions, in relation to extending the expiration date of the merit provisions of the correction law and the penal law of such chapter; to amend chapter 412 of the laws of 1999, amending the civil practice law and rules and the court of claims act relating to prisoner litigation reform, in relation to extending the expiration of the inmate filing fee provisions of the civil practice law and rules and general filing fee provision and inmate property claims exhaustion requirement of the court of claims act of such chapter; to amend chapter 222 of the laws of 1994 constituting the family protection and domestic violence intervention act of 1994, in relation to extending the expiration of certain provisions of the criminal procedure law requiring the arrest of certain persons engaged in family violence; to amend chapter 505 of the laws of 1985, amending the criminal procedure law relating to the use of closed-circuit television and other protective measures for certain child witnesses, in relation to extending the expiration of the provisions thereof; to amend chapter 3 of the laws of 1995, enacting the sentencing reform act of 1995, in relation to extending the expiration of certain provisions of such chapter; to amend chapter 689 of the laws of 1993 amending the criminal procedure law relating to electronic court appearance in certain counties, in relation to extending the expiration thereof; to amend chapter 688 of the laws of 2003, amending the executive law relating to enacting the interstate compact for adult offender supervision, in relation to the effectiveness thereof; to amend chapter 56 of the laws of 2009, amending the correction law relating to limiting the closing of certain correctional facilities, providing for the custody by the department of correctional services of inmates serving definite sentences, providing for custody of federal prisoners and requiring the closing of certain correctional facilities, in relation to the effectiveness of such chapter; to amend chapter 152 of the laws of 2001, amending the military law relating to military funds of the organized militia, in relation to the effectiveness thereof; to amend chapter 554 of the laws of 1986, amending the correction law and the penal law relating to providing for community treatment facilities and establishing the crime of absconding from the community treatment facility, in relation to the effectiveness thereof; and to amend chapter 55 of the laws of 2018 amending the criminal procedure law relating to pre-criminal proceeding settlements in the city of New York, in relation to the effectiveness thereof (Part A); intentionally omitted (Part B); intentionally omitted (Part C); intentionally omitted (Part D); to amend the state finance law, in relation to establishing the criminal justice discovery compensation fund; to amend the criminal procedure law, in relation to monies recovered by county district attorneys before the filing of an accusatory instrument; and providing for the repeal of certain provisions upon expiration thereof (Part E); in relation to the closure of correctional facilities; and providing for the repeal of such provisions upon expiration thereof (Part F); to amend the correction law and the executive law, in relation to moving adolescent offenders to the office of children and family services; to repeal paragraph (a-1) of subdivision 4 of section 70.20 of the penal law and section 77 of the correction law relating thereto; to repeal paragraphs (a) through (e) of section 508 of the executive law relating to a technical correction; and providing for the repeal of certain provisions upon expiration thereof (Part G); intentionally omitted (Part H); to amend the tax law, in relation to suspending the transfer of monies into the emergency services revolving loan fund from the public safety communications account (Part I); intentionally omitted (Part J); intentionally omitted (Part K); intentionally omitted (Part L); to amend the criminal procedure law and the family court act, in relation to establishing the safe homes and families act (Part M); to amend the penal law and the executive law, in relation to firearm licenses (Part N); intentionally omitted (Part O); intentionally omitted (Part P); to amend the criminal procedure law, in relation to determining whether certain misdemeanor crimes are serious offenses under the penal law (Part Q); to amend the penal law and the criminal procedure law, in relation to enacting the \"Josef Neumann Hate Crimes Domestic Terrorism Act\" (Part R); intentionally omitted (Part S); intentionally omitted (Part T); intentionally omitted (Part U); intentionally omitted (Part V); to amend the civil service law, in relation to continuing to protect and strengthen unions (Part W); intentionally omitted (Part X); to amend the state finance law and the state technology law, in relation to defining the term technology to include computer information, electronic information, interconnected systems and related material thereto (Part Y); to amend section 1 of part S of chapter 56 of the laws of 2010, relating to establishing a joint appointing authority for the state financial system project, in relation to statewide financial system procurements (Part Z); to amend chapter 95 of the laws of 2000 amending the state finance law, the general municipal law, the public buildings law and other laws relating to bonds, notes and revenues, in relation to extending the effectiveness thereof (Part AA); intentionally omitted (Part BB); intentionally omitted (Part CC); intentionally omitted (Part DD); intentionally omitted (Part EE); to amend the alcoholic beverage control law, in relation to establishing the hours during which alcoholic beverages may be sold in certain international airport property (Part FF); intentionally omitted (Part GG); intentionally omitted (Part HH); intentionally omitted (Part II); to amend the election law, in relation to conducting a full manual recount on all ballots (Part JJ); intentionally omitted (Part KK); intentionally omitted (Part LL); intentionally omitted (Part MM); to amend the tax law and the public authorities law, in relation to AIM-related sales tax payments in the counties of Nassau and Erie (Part NN); intentionally omitted (Part OO); to amend the domestic relations law, in relation to including acts of domestic violence in the criteria the court shall consider in determining the equitable disposition of property during divorce proceedings (Part PP); to amend the public authorities law, in relation to ensuring pay equity at state and local public authorities (Part QQ); intentionally omitted (Part RR); intentionally omitted (Part SS); intentionally omitted (Part TT); to amend the executive law, in relation to disclosure requirements for certain nonprofits (Part UU); intentionally omitted (Part VV); to amend part E of chapter 60 of the laws of 2015, establishing a commission on legislative, judicial and executive compensation, and providing for the powers and duties of the commission and for the dissolution of the commission, in relation to the powers of the members of the commission (Part WW); to amend the public health law, in relation to rights of sexual offense victims; and to repeal section 631-b of the executive law relating thereto (Subpart A); to amend the executive law, in relation to regulatory fines for small businesses; and to amend a chapter of the laws of 2019, amending the executive law relating to regulatory fines for small businesses, in relation to the effectiveness thereof (Subpart B); to amend a chapter of the laws of 2019, authorizing the commissioner of general services to transfer and convey certain state land to the city of New Rochelle, as proposed in legislative bills numbers S.6228-A and A.7846-A, in relation to specifying the use for which certain state lands are to be transferred to the city of New Rochelle (Subpart C); to amend the social services law, in relation to exempting income earned by persons under the age of twenty-four from certain workforce development programs from the determination of need for public assistance programs (Subpart D); to amend the real property tax law, in relation to making technical changes to allow exemption from certain special districts (Subpart E); to amend the labor law, in relation to adding components sold with instructions to combine such components to create combustion or detonation to the definition of \"explosives\"; and to repeal certain provisions of such law relating thereto (Subpart F); to amend the private housing finance law, in relation to persons and families in company projects who are required to pay a rental surcharge (Subpart G); to amend a chapter of the laws of 2019, relating to directing the metropolitan transportation authority to rename certain subway stations, as proposed in legislative bills numbers S. 3439-A and A. 1512-A, in relation to directing the metropolitan transportation authority and the New York City transit authority to rename certain subway stations (Subpart H); to amend chapter 383 of the laws of 2019 amending the public authorities law relating to the Roosevelt Island operating corporation, in relation to the continuity of the Roosevelt Island operating corporation (Subpart I); to amend the elder law, in relation to the state office for the aging sexual discrimination training program; and to repeal certain provisions of such law related thereto (Subpart J); to amend the insurance law, in relation to policies or contracts which are not included in the definition of student accident and health insurance (Subpart K); to amend the family court act and the social services law, in relation to notice of indicated reports of child maltreatment and changes of placement in child protective and voluntary foster care placement and review proceedings (Subpart L); to amend the election law, in relation to voter registration form distribution and assistance (Subpart M); to amend the election law, in relation to canvass of ballots cast by certain voters (Subpart N); to amend the labor law, in relation to requiring the licensing of persons engaged in the design, construction, inspection, maintenance, alteration, and repair of elevators and other automated people moving devices; to amend the state finance law, in relation to availability of funds from the elevator and related conveyances safety program account; to amend the administrative code of the city of New York, in relation to the definition of elevator work and elevator agency technician license qualifications and exemptions; to amend part B of a chapter of the laws of 2019, amending the administrative code of the city of New York relating to the licensing of approved elevator agency directors, inspectors, and technicians performing elevator work in the city of New York as proposed in legislative bills numbers S. 4080-C and A. 4509-A, in relation to the effectiveness thereof; to amend part A of a chapter of the laws of 2019, amending the labor law and the state finance law relating to requiring the licensing of persons engaged in the design, construction, inspection, maintenance, alteration, and repair of elevators and other automated people moving devices, as proposed in legislative bills numbers S. 4080-C and A. 4509-A, in relation to the effectiveness thereof; and repealing certain provisions of the labor law and the administrative code of the city of New York relating thereto (Subpart O); to amend the general municipal law, in relation to proof of eligibility for volunteer firefighter enhanced cancer disability benefits; and to repeal certain provisions of the general municipal law relating thereto (Subpart P); to amend the insurance law, in relation to \"lease-end\" charges (Subpart Q); to amend the labor law, in relation to the New York call center jobs act (Subpart R); to amend the public health law and the executive law, in relation to HIV post-exposure prophylaxis and other health care services for sexual assault victims; and to amend a chapter of the laws of 2019, amending the public health law and the executive law relating to HIV post-exposure prophylaxis and other health care services for sexual assault victims, as proposed in legislative bills numbers S. 2279-A and A. 1204-A in relation to the effectiveness thereof (Subpart S); to amend a chapter of the laws of 2019 amending the tax law and the state finance law relating to gifts for the support of the New York state council on the arts, as proposed in legislative bills numbers S. 3570 and A. 7994, in relation to making technical corrections thereto (Subpart T); to amend the tax law, in relation to the senior wellness in nutrition fund (Subpart U); to amend the tax law and administrative code of the city of New York, in relation to the definition of a research tobacco product (Subpart V); to amend the alcoholic beverage control law, in relation to authorizing retail licensees to purchase beer with a business payment card; and to repeal certain provisions of such law relating thereto (Subpart W); to amend the tax law, in relation to a television writers' and directors' fees and salaries credit; and to amend a chapter of the laws of 2019 amending the tax law relating to a television writers' and directors' fees and salaries credit, as proposed in legislative bills numbers S. 5864-A and A. 6683-B, in relation to a television writers' and directors' fees and salaries credit and the effectiveness thereof (Subpart X); to amend the public service law, in relation to the payment of wages to workers; and to repeal a chapter of the laws of 2019, amending the labor law relating to ensuring that utility employees receive the prevailing wage (Subpart Y); to amend the real property law, in relation to regulation of reverse mortgage loans issued under the federal home equity conversion mortgage for seniors program (Subpart Z); to amend the environmental conservation law, in relation to regulation of toxic chemicals in children's products (Subpart AA); to amend the local finance law, in relation to the electronic open auction public bond sale pilot program (Subpart BB); and to amend chapter 9 of the laws of 2020 relating to allowing the commissioner of transportation to impound or immobilize stretch limousines in certain situations, in relation to the effectiveness thereof (Subpart CC)(Part XX); to amend the public authorities law, in relation to the Nassau county interim finance authority (Part YY); to repeal subdivision 1 of paragraph b of section 33.10 of the local finance law, relating to the issuance of bonds in the county of Westchester (Part ZZ); and to amend the election law, in relation to time allowed employees to vote (Part AAA)",
 "SameAsPrintNo":"A9505-2019"
}