{
 "PrintNo":"S966","Session":2019,"Chamber":"SENATE","BillType":"Senate","Published":"2019-01-09T14:38:00.475291Z",
 "Status":"IN_SENATE_COMM","Committee":"Finance",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2019-01-09","Committee":"Finance"}],
 "Actions":[{"Text":"REFERRED TO FINANCE","Date":"2019-01-09","Chamber":"SENATE"}],
 "Sponsors":[
  {"ID":414,"Name":"Catharine Young","Short":"YOUNG"},{"ID":427,"Name":"Patrick M. Gallivan","Short":"GALLIVAN"},
  {"ID":951,"Name":"Pamela Helming","Short":"HELMING"},{"ID":885,"Name":"Robert Ortt","Short":"ORTT"},
  {"ID":406,"Name":"Michael H. Ranzenhofer","Short":"RANZENHOFER"}
 ],
 "Title":"Enacts \"Renee's law\" to provide greater protection and disclosure to employees of facilities where juvenile delinquents and youthful offenders are placed",
 "Summary":"Enacts \"Renee's Law\"; directs the commissioner of children and family services to provide training to all employees of programs and facilities in which youths are placed or committed; grants access to office of children and family services' records, juvenile delinquency records, youthful offender records and juvenile offender records of youths placed or committed to a facility, to staff members and employees who are exposed to such youths and to foster parents who take custody of such person after his or her release; grants courts and attorneys access to such records in any proceeding for the commission of a crime while a youth is in the custody of the office of children and family services; prohibits the release, discharge or transfer of any youth who has engaged in criminal activity while in custody; requires the reporting to law enforcement authorities of criminal activity by a youth in the custody of the office of children and family services; requires a police officer to escort an employee sent to find a youth who is absent without authorization.",
 "LawSection":"Executive Law",
 "LawCode":"Amd §§501, 501-c, 504, 507-a, 510-c & 837, add §501-i, Art 19-G Title 2 §510, Exec L; amd §166, Fam Ct Act; amd §§720.35 & 725.15, CP L; amd §212, Judy L",
 "ActClause":"AN ACT to amend the executive law, the family court act, the criminal procedure law and the judiciary law, in relation to enacting \"Renee's law\"",
 "PreviousVersions":["S5565-2011","S2625-2013","S3071-2015","S555-2017"]
}