{
 "PrintNo":"A5309","Session":2021,"Chamber":"ASSEMBLY","BillType":"Assembly","Published":"2021-02-12T13:02:08.965711Z",
 "Status":"IN_ASSEMBLY_COMM","Committee":"Agriculture",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2022-01-05","Committee":"Agriculture"}],
 "Actions":[
  {"Text":"REFERRED TO AGRICULTURE","Date":"2021-02-12","Chamber":"ASSEMBLY"},
  {"Text":"REFERRED TO AGRICULTURE","Date":"2022-01-05","Chamber":"ASSEMBLY"}
 ],
 "Sponsors":[
  {"ID":1481,"Name":"Joe Angelino","Short":"ANGELINO"},{"ID":1135,"Name":"Angelo J. Morinello","Short":"MORINELLO"},
  {"ID":656,"Name":"David DiPietro","Short":"DIPIETRO"},{"ID":1238,"Name":"Joe DeStefano","Short":"DESTEFANO"},
  {"ID":480,"Name":"David McDonough","Short":"MCDONOUGH"},{"ID":1152,"Name":"Chris Tague","Short":"TAGUE"},
  {"ID":1125,"Name":"Brian D. Miller","Short":"MILLER B"},{"ID":1251,"Name":"Brian Manktelow","Short":"MANKTELOW"},
  {"ID":1250,"Name":"John Salka","Short":"SALKA"},{"ID":1466,"Name":"Michael Durso","Short":"DURSO"},
  {"ID":1483,"Name":"John Lemondes","Short":"LEMONDES"},{"ID":908,"Name":"Karl Brabenec","Short":"BRABENEC"},
  {"ID":1252,"Name":"Marjorie Byrnes","Short":"BYRNES"}
 ],
 "Title":"Enacts the \"New York farmer recruitment and retention act of 2022\" and appropriates monies to implement certain provisions thereof",
 "Summary":"Enacts the \"New York farmer recruitment and retention act\"; directs the board of regents and the education department to investigate and study undergraduate agricultural programs with the goal of identifying programs which encourage entry into agricultural production; establishes agriculture producer scholarships for students who agree to be agriculture producers in the state for a certain period of time after graduation; establishes the producer's loan forgiveness program; directs the board of regents and the education department to establish and implement an outreach program to encourage elementary and secondary school students to enter the agricultural field; directs the commissioner of agriculture and markets to report to the governor and the legislature on reducing taxation on land used in agricultural production; appropriates funds therefor.",
 "LawSection":"Education Law","LawCode":"Amd ยง605, add ยง671-a, Ed L",
 "ActClause":"AN ACT to enact the \"New York farmer recruitment and retention act of 2022\"; to direct the board of regents and education department to study agricultural education programs (Part A); to amend the education law, in relation to enacting the \"agriculture producer scholarship act\"; and making appropriations therefor (Part B); to amend the education law, in relation to establishing the producer's loan forgiveness program (Part C); to direct the board of regents and the education department to implement an outreach program to encourage elementary and secondary students to enter the agricultural field (Part D); and to direct the commissioner of agriculture and markets to report on reducing the taxation for landowners who use their land for agricultural production (Part E)",
 "PreviousVersions":["A1849-2007","A5205-2009","A4590-2011","A2236-2013","A2952-2015","A777-2017","A940-2019"]
}