{
 "PrintNo":"A6882","Session":2021,"Chamber":"ASSEMBLY","BillType":"Assembly","Published":"2021-04-13T13:09:57.634184Z",
 "Status":"IN_ASSEMBLY_COMM","Committee":"Ways And Means",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2022-01-05","Committee":"Ways And Means"}],
 "Actions":[
  {"Text":"REFERRED TO WAYS AND MEANS","Date":"2021-04-13","Chamber":"ASSEMBLY"},
  {"Text":"REFERRED TO WAYS AND MEANS","Date":"2022-01-05","Chamber":"ASSEMBLY"}
 ],
 "Sponsors":[
  {"ID":551,"Name":"Kevin Cahill","Short":"CAHILL"},
  {"ID":1468,"Name":"Jessica Gonzalez-Rojas","Short":"GONZALEZ-ROJAS"},
  {"ID":1472,"Name":"Marcela Mitaynes","Short":"MITAYNES"},{"ID":907,"Name":"Jo Anne Simon","Short":"SIMON"},
  {"ID":1116,"Name":"Jaime R. Williams","Short":"WILLIAMS"},{"ID":527,"Name":"Richard Gottfried","Short":"GOTTFRIED"},
  {"ID":520,"Name":"Linda Rosenthal","Short":"ROSENTHAL L"},{"ID":1469,"Name":"Zohran Mamdani","Short":"MAMDANI"},
  {"ID":1482,"Name":"Anna Kelles","Short":"KELLES"}
 ],
 "Title":"Relates to tax on sales of motor fuel and petroleum products; and repeals certain provisions of law relating thereto",
 "Summary":"Relates to tax on sales of motor fuel and petroleum products; repeals certain provisions of law relating thereto.",
 "LawSection":"Tax Law","LawCode":"Amd Tax L, generally",
 "ActClause":"AN ACT to amend the tax law, in relation to tax on sales of motor fuel and petroleum products; to repeal paragraph 3 of subdivision (f) and paragraph 4 of subdivision (g) of section 301-a of the tax law, relating to manufacturing gallonage for purposes of the imposition of certain taxes; to repeal subdivisions (i), (j), and (l) of section 301-c of the tax law relating to reimbursement; to repeal section 301-d of the tax law relating to a utility credit or reimbursement; to repeal subdivision (f) of section 301-e of the tax law relating to an aviation fuel business which services four or more cities; to repeal subparagraph (xi) of paragraph 3 of subdivision (c) of section 1105 of the tax law relating to services rendered with respect to certain property; to repeal paragraph 9 of subdivision (a) of section 1115 of the tax law relating to fuel sold to an airline for use in its airplanes; and to amend the tax law, in relation to making conforming technical changes",
 "SameAsPrintNo":"S4816-2021"
}