{
 "PrintNo":"A9138","Version":"A","Session":2021,"Chamber":"ASSEMBLY","BillType":"Assembly",
 "Published":"2022-01-31T10:17:40.253427Z","Status":"IN_ASSEMBLY_COMM","Committee":"Ways And Means",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2022-05-26","Committee":"Ways And Means"}],
 "Actions":[
  {"Text":"REFERRED TO WAYS AND MEANS","Date":"2022-01-31","Chamber":"ASSEMBLY"},
  {"Text":"AMEND AND RECOMMIT TO WAYS AND MEANS","Date":"2022-05-26","Chamber":"ASSEMBLY"},
  {"Text":"PRINT NUMBER 9138A","Date":"2022-05-26","Chamber":"ASSEMBLY","Version":"A"}
 ],
 "Sponsors":[
  {"ID":1486,"Name":"Jen Lunsford","Short":"LUNSFORD"},{"ID":1487,"Name":"William Conrad","Short":"CONRAD"},
  {"ID":1105,"Name":"Pamela J. Hunter","Short":"HUNTER"},{"ID":621,"Name":"Sandy Galef","Short":"GALEF"},
  {"ID":1133,"Name":"Monica P. Wallace","Short":"WALLACE"},{"ID":1132,"Name":"Yuh-Line Niou","Short":"NIOU"}
 ],
 "Title":"Establishes the child victims act fund; appropriation",
 "Summary":"Establishes the child victims act fund which provides grant awards in reimbursement to public school districts and voluntary foster care agencies located within the state who have been named as defendants in certain child sexual abuse legal cases and in which it can be demonstrated by the public school district or voluntary foster care agency that no insurance policy for the covered period can be located after a good-faith effort to do so has been made, there was a monetary judgment issued or settlement agreement with regard to such action and where it can be demonstrated by the public school district or voluntary foster care agency that payment in full of such judgment or settlement would put a substantial burden on the district's or agency's ability to execute its mission and negatively impact its existing student population.",
 "LawSection":"State Finance Law","LawCode":"Add §99-pp, St Fin L; add §§209-p & 630-k, Tax L",
 "ActClause":"AN ACT to amend the state finance law and the tax law, in relation to establishing the child victims act fund; and making an appropriation therefor"
}