{
 "PrintNo":"S1118","Session":2021,"Chamber":"SENATE","BillType":"Senate","Published":"2021-01-07T12:15:42.604142Z",
 "Status":"IN_SENATE_COMM","Committee":"Finance",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2022-01-05","Committee":"Finance"}],
 "Actions":[
  {"Text":"REFERRED TO FINANCE","Date":"2021-01-07","Chamber":"SENATE"},
  {"Text":"REFERRED TO FINANCE","Date":"2022-01-05","Chamber":"SENATE"}
 ],
 "Sponsors":[
  {"ID":432,"Name":"James Sanders Jr.","Short":"SANDERS"},{"ID":1231,"Name":"Alessandra Biaggi","Short":"BIAGGI"},
  {"ID":1504,"Name":"Cordell Cleare","Short":"CLEARE"},{"ID":888,"Name":"Leroy Comrie","Short":"COMRIE"},
  {"ID":438,"Name":"Brad Hoylman-Sigal","Short":"HOYLMAN"},{"ID":1230,"Name":"Robert Jackson","Short":"JACKSON"},
  {"ID":416,"Name":"Kevin S. Parker","Short":"PARKER"},{"ID":377,"Name":"Gustavo Rivera","Short":"RIVERA"},
  {"ID":1142,"Name":"Luis R. Sepúlveda","Short":"SEPULVEDA"}
 ],
 "Title":"Establishes the New York State Community Commission on Reparations Remedies; makes an appropriation of $250,000",
 "Summary":"Relates to acknowledging the fundamental injustice, cruelty, brutality, and inhumanity of slavery in the city of New York and the state of New York; establishes the New York state community commission on reparations remedies to examine the institution of slavery, subsequently de jure and de facto racial and economic discrimination against African-Americans, the impact of these forces on living African-Americans and to make recommendations on appropriate remedies; makes an appropriation therefor; provides for the repeal of such provisions.",
 "LawSection":"Appropriations",
 "ActClause":"AN ACT to acknowledge the fundamental injustice, cruelty, brutality and inhumanity of slavery in the city of New York and the state of New York; to establish the New York state community commission on reparations remedies, to examine the institution of slavery, subsequently de jure and de facto racial and economic discrimination against African-Americans, and the impact of these forces on living African-Americans and to make determinations regarding compensation; making an appropriation therefor; and providing for the repeal of such provisions upon expiration thereof",
 "PreviousVersions":["S5624-2017","S2904-2019"]
}