{
 "PrintNo":"S2509","Version":"C","Session":2021,"Chamber":"SENATE","BillType":"Senate",
 "Published":"2021-01-20T19:09:39.137732Z","Status":"SIGNED_BY_GOV",
 "Milestones":[
  {"Type":"IN_SENATE_COMM","Date":"2021-04-06","Committee":"Finance"},{"Type":"SENATE_FLOOR","Date":"2021-04-06"},
  {"Type":"PASSED_SENATE","Date":"2021-04-06"},
  {"Type":"IN_ASSEMBLY_COMM","Date":"2021-04-06","Committee":"Ways And Means"},
  {"Type":"ASSEMBLY_FLOOR","Date":"2021-04-07"},{"Type":"PASSED_ASSEMBLY","Date":"2021-04-07"},
  {"Type":"DELIVERED_TO_GOV","Date":"2021-04-07"},{"Type":"SIGNED_BY_GOV","Date":"2021-04-19"}
 ],
 "Actions":[
  {"Text":"REFERRED TO FINANCE","Date":"2021-01-20","Chamber":"SENATE"},
  {"Text":"AMEND (T) AND RECOMMIT TO FINANCE","Date":"2021-02-24","Chamber":"SENATE"},
  {"Text":"PRINT NUMBER 2509A","Date":"2021-02-24","Chamber":"SENATE","Version":"A"},
  {"Text":"AMEND (T) AND RECOMMIT TO FINANCE","Date":"2021-03-14","Chamber":"SENATE","Version":"A"},
  {"Text":"PRINT NUMBER 2509B","Date":"2021-03-14","Chamber":"SENATE","Version":"B"},
  {"Text":"AMEND (T) AND RECOMMIT TO FINANCE","Date":"2021-04-06","Chamber":"SENATE","Version":"B"},
  {"Text":"PRINT NUMBER 2509C","Date":"2021-04-06","Chamber":"SENATE","Version":"C"},
  {"Text":"ORDERED TO THIRD READING CAL.654","Date":"2021-04-06","Chamber":"SENATE","Version":"C"},
  {"Text":"MESSAGE OF NECESSITY - APPROPRIATION","Date":"2021-04-06","Chamber":"SENATE","Version":"C"},
  {"Text":"MESSAGE OF NECESSITY - 3 DAY MESSAGE","Date":"2021-04-06","Chamber":"SENATE","Version":"C"},
  {"Text":"PASSED SENATE","Date":"2021-04-06","Chamber":"SENATE","Version":"C"},
  {"Text":"DELIVERED TO ASSEMBLY","Date":"2021-04-06","Chamber":"SENATE","Version":"C"},
  {"Text":"REFERRED TO WAYS AND MEANS","Date":"2021-04-06","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"SUBSTITUTED FOR A3009C","Date":"2021-04-07","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"ORDERED TO THIRD READING RULES CAL.59","Date":"2021-04-07","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"MESSAGE OF NECESSITY - 3 DAY MESSAGE","Date":"2021-04-07","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"PASSED ASSEMBLY","Date":"2021-04-07","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"RETURNED TO SENATE","Date":"2021-04-07","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"DELIVERED TO GOVERNOR","Date":"2021-04-07","Chamber":"SENATE","Version":"C"},
  {"Text":"SIGNED CHAP.59","Date":"2021-04-19","Chamber":"SENATE","Version":"C"}
 ],
 "Votes":[
  {
   "VoteType":"COMMITTEE","Date":"2021-04-06","Version":"C","Chamber":"SENATE","Committee":"Finance",
   "Votes":[
    {"ID":1102,"Name":"Jamaal Bailey","Short":"BAILEY","Vote":"Aye"},
    {"ID":1136,"Name":"Brian Benjamin","Short":"BENJAMIN","Vote":"Aye"},
    {"ID":372,"Name":"Neil D. Breslin","Short":"BRESLIN","Vote":"Aye"},
    {"ID":888,"Name":"Leroy Comrie","Short":"COMRIE","Vote":"Aye"},
    {"ID":1233,"Name":"Pete Harckham","Short":"HARCKHAM","Vote":"Aye"},
    {"ID":438,"Name":"Brad Hoylman-Sigal","Short":"HOYLMAN","Vote":"Aye"},
    {"ID":429,"Name":"Timothy M. Kennedy","Short":"KENNEDY","Vote":"Aye"},
    {"ID":401,"Name":"Liz Krueger","Short":"KRUEGER","Vote":"Aye"},
    {"ID":1225,"Name":"John Liu","Short":"LIU","Vote":"Aye"},
    {"ID":416,"Name":"Kevin S. Parker","Short":"PARKER","Vote":"Aye"},
    {"ID":377,"Name":"Gustavo Rivera","Short":"RIVERA","Vote":"Aye"},
    {"ID":1227,"Name":"Julia Salazar","Short":"SALAZAR","Vote":"Aye"},
    {"ID":403,"Name":"Diane J. Savino","Short":"SAVINO","Vote":"Aye"},
    {"ID":1232,"Name":"James Skoufis","Short":"SKOUFIS","Vote":"Aye"},
    {"ID":400,"Name":"Toby Ann Stavisky","Short":"STAVISKY","Vote":"Aye"},
    {"ID":1223,"Name":"Kevin Thomas","Short":"THOMAS","Vote":"Aye"},
    {"ID":1370,"Name":"George Borrello","Short":"BORRELLO","Vote":"Nay"},
    {"ID":427,"Name":"Patrick M. Gallivan","Short":"GALLIVAN","Vote":"Nay"},
    {"ID":393,"Name":"Joseph A. Griffo","Short":"GRIFFO","Vote":"Nay"},
    {"ID":415,"Name":"Thomas F. O'Mara","Short":"O'MARA","Vote":"Nay"},
    {"ID":423,"Name":"Patty Ritchie","Short":"RITCHIE","Vote":"Nay"},
    {"ID":890,"Name":"Susan Serino","Short":"SERINO","Vote":"Nay"},
    {"ID":1103,"Name":"James Tedisco","Short":"TEDISCO","Vote":"Nay"}
   ]
  },
  {
   "VoteType":"FLOOR","Date":"2021-04-06","Version":"C",
   "Votes":[
    {"ID":384,"Name":"Joseph P. Addabbo Jr.","Short":"ADDABBO","Vote":"Aye"},
    {"ID":1102,"Name":"Jamaal Bailey","Short":"BAILEY","Vote":"Aye"},
    {"ID":1136,"Name":"Brian Benjamin","Short":"BENJAMIN","Vote":"Aye"},
    {"ID":1231,"Name":"Alessandra Biaggi","Short":"BIAGGI","Vote":"Aye"},
    {"ID":372,"Name":"Neil D. Breslin","Short":"BRESLIN","Vote":"Aye"},
    {"ID":1494,"Name":"Jabari Brisport","Short":"BRISPORT","Vote":"Aye"},
    {"ID":1500,"Name":"Samra Brouk","Short":"BROUK","Vote":"Aye"},
    {"ID":888,"Name":"Leroy Comrie","Short":"COMRIE","Vote":"Aye"},
    {"ID":1501,"Name":"Jeremy Cooney","Short":"COONEY","Vote":"Aye"},
    {"ID":383,"Name":"Michael Gianaris","Short":"GIANARIS","Vote":"Aye"},
    {"ID":1229,"Name":"Andrew Gounardes","Short":"GOUNARDES","Vote":"Aye"},
    {"ID":1233,"Name":"Pete Harckham","Short":"HARCKHAM","Vote":"Aye"},
    {"ID":1497,"Name":"Michelle Hinchey","Short":"HINCHEY","Vote":"Aye"},
    {"ID":438,"Name":"Brad Hoylman-Sigal","Short":"HOYLMAN","Vote":"Aye"},
    {"ID":1230,"Name":"Robert Jackson","Short":"JACKSON","Vote":"Aye"},
    {"ID":918,"Name":"Todd Kaminsky","Short":"KAMINSKY","Vote":"Aye"},
    {"ID":1224,"Name":"Anna Kaplan","Short":"KAPLAN","Vote":"Aye"},
    {"ID":1140,"Name":"Brian Kavanagh","Short":"KAVANAGH","Vote":"Aye"},
    {"ID":429,"Name":"Timothy M. Kennedy","Short":"KENNEDY","Vote":"Aye"},
    {"ID":401,"Name":"Liz Krueger","Short":"KRUEGER","Vote":"Aye"},
    {"ID":1225,"Name":"John Liu","Short":"LIU","Vote":"Aye"},{"ID":1237,"Name":"Rachel May","Short":"MAY","Vote":"Aye"},
    {"ID":1143,"Name":"Shelley Mayer","Short":"MAYER","Vote":"Aye"},
    {"ID":1228,"Name":"Zellnor Myrie","Short":"MYRIE","Vote":"Aye"},
    {"ID":416,"Name":"Kevin S. Parker","Short":"PARKER","Vote":"Aye"},
    {"ID":914,"Name":"Roxanne J. Persaud","Short":"PERSAUD","Vote":"Aye"},
    {"ID":1226,"Name":"Jessica Ramos","Short":"RAMOS","Vote":"Aye"},
    {"ID":1495,"Name":"Elijah Reichlin-Melnick","Short":"REICHLIN-MELNICK","Vote":"Aye"},
    {"ID":377,"Name":"Gustavo Rivera","Short":"RIVERA","Vote":"Aye"},
    {"ID":1491,"Name":"Sean Ryan","Short":"RYAN","Vote":"Aye"},
    {"ID":1227,"Name":"Julia Salazar","Short":"SALAZAR","Vote":"Aye"},
    {"ID":432,"Name":"James Sanders Jr.","Short":"SANDERS","Vote":"Aye"},
    {"ID":403,"Name":"Diane J. Savino","Short":"SAVINO","Vote":"Aye"},
    {"ID":1142,"Name":"Luis R. Sepúlveda","Short":"SEPULVEDA","Vote":"Aye"},
    {"ID":373,"Name":"José M. Serrano","Short":"SERRANO","Vote":"Aye"},
    {"ID":1232,"Name":"James Skoufis","Short":"SKOUFIS","Vote":"Aye"},
    {"ID":400,"Name":"Toby Ann Stavisky","Short":"STAVISKY","Vote":"Aye"},
    {"ID":396,"Name":"Andrea Stewart-Cousins","Short":"STEWART-COUSINS","Vote":"Aye"},
    {"ID":913,"Name":"Fredrick J. Akshar II","Short":"AKSHAR","Vote":"Nay"},
    {"ID":1370,"Name":"George Borrello","Short":"BORRELLO","Vote":"Nay"},
    {"ID":433,"Name":"Phil Boyle","Short":"BOYLE","Vote":"Nay"},
    {"ID":1101,"Name":"John E. Brooks","Short":"BROOKS","Vote":"Nay"},
    {"ID":439,"Name":"Simcha Felder","Short":"FELDER","Vote":"Nay"},
    {"ID":427,"Name":"Patrick M. Gallivan","Short":"GALLIVAN","Vote":"Nay"},
    {"ID":1222,"Name":"Jim Gaughran","Short":"GAUGHRAN","Vote":"Nay"},
    {"ID":393,"Name":"Joseph A. Griffo","Short":"GRIFFO","Vote":"Nay"},
    {"ID":951,"Name":"Pamela Helming","Short":"HELMING","Vote":"Nay"},
    {"ID":1235,"Name":"Daphne Jordan","Short":"JORDAN","Vote":"Nay"},
    {"ID":409,"Name":"Andrew J. Lanza","Short":"LANZA","Vote":"Nay"},
    {"ID":1498,"Name":"John Mannion","Short":"MANNION","Vote":"Nay"},
    {"ID":1496,"Name":"Mike Martucci","Short":"MARTUCCI","Vote":"Nay"},
    {"ID":1492,"Name":"Mario Mattera","Short":"MATTERA","Vote":"Nay"},
    {"ID":415,"Name":"Thomas F. O'Mara","Short":"O'MARA","Vote":"Nay"},
    {"ID":1499,"Name":"Peter Oberacker","Short":"OBERACKER","Vote":"Nay"},
    {"ID":885,"Name":"Robert Ortt","Short":"ORTT","Vote":"Nay"},
    {"ID":1489,"Name":"Anthony H. Palumbo","Short":"PALUMBO","Vote":"Nay"},
    {"ID":1502,"Name":"Edward Rath","Short":"RATH","Vote":"Nay"},
    {"ID":423,"Name":"Patty Ritchie","Short":"RITCHIE","Vote":"Nay"},
    {"ID":890,"Name":"Susan Serino","Short":"SERINO","Vote":"Nay"},
    {"ID":1490,"Name":"Dan Stec","Short":"STEC","Vote":"Nay"},
    {"ID":1103,"Name":"James Tedisco","Short":"TEDISCO","Vote":"Nay"},
    {"ID":1223,"Name":"Kevin Thomas","Short":"THOMAS","Vote":"Nay"},
    {"ID":1493,"Name":"Alexis Weik","Short":"WEIK","Vote":"Nay"}
   ]
  }
 ],
 "Title":"Enacts into law major components of legislation which are necessary to implement the state fiscal plan for the 2021-2022 state fiscal year",
 "Summary":"Enacts into law major components of legislation which are necessary to implement the state fiscal plan for the 2021-2022 state fiscal year; extends the top rate of income tax (Part A); imposes a pass-through entity tax (Part C); relates to child care services expenditures under the excelsior jobs program and the employer provided child care credit (Part D); reforms and simplifies various business tax provisions (Part E); extends the empire state film production credit and the empire state film post production credit (Part F); increases penalties for failure of an employer to provide complete and correct employee withholding information (Part G); relates to taxes imposed on admission to race tracks and simulcast facilities; repeals certain provisions of law relating thereto (Part J); exempts from sales and use tax certain tangible personal property or services (Part M); increases the total dollar amount for vendors' gross receipts necessary for registration filing (Part N); imposes liability for real estate transfer taxes on responsible persons; prohibits grantors from passing real estate transfer tax to grantees; exempts certain organizations from the LLC disclosure requirement (Part O); relates to restrictions on certain cigarette and tobacco retail dealers whose registrations have been revoked or who have been forbidden from selling such products (Part P); relates to the timing and method for filing certain returns (Part Q); relates to determining liability for the collection of taxes on medallion taxicab trips and congestion surcharges (Part R); relates to penalties for failure of tax return preparers to register; requires tax return preparers to display certain documents (Part S); relates to electronic submission of consolidated real property transfer forms (Part U); relates to the STAR credit for mobile homes (Part V); relates to the administration of real property taxes and local laws or resolutions regarding such taxes (Part W); promotes the development of renewable energy projects, including solar or wind energy systems (Part X); provides for regulation of sports wagering and mobile sports wagering; defines terms; implements a tax on sports wagering gross revenue; requires reporting; provides for civil penalties for violations (Part Y); authorizes a request from the gaming commission for information related to interest in gaming facility licenses (Part Z); relates to the frequency at which certain lottery draw games may be offered (Part BB); relates to transferring powers and duties of the office of the gaming inspector general to the office of the state inspector general (Part CC); extends certain provisions of law related to simulcasting (Part DD); extends the alternative fuels tax exemptions for five years (Part EE); extends the farm workforce retention credit (Part FF); extends the credit against income tax for persons or entities investing in low-income housing (Part GG); extends the musical and theatrical production tax credit; increases the aggregate cap on such credit (Part HH); extends the hire a vet tax credit (Part II); extends the tax credits under the economic transformation and facility redevelopment program (Part JJ); requires the implementation of the secure choice savings program by December 31, 2021 (Part KK); modifies certain racing support payments (Part LL); exempts breast pump replacement parts and certain supplies from sales and compensating use taxes (Part MM); relates to applying work-location based tax credits to remote work performed during COVID-19 (Part NN); exempts certain tax underpayments from interest accumulation (Part OO); enacts the restaurant return-to-work tax credit (Subpart A); enacts the New York city musical and theatrical production tax credit; creates the New York state council on the arts cultural program fund (Subpart B)(Part PP); relates to modifying the minimum amount of personal income and corporate tax overpayment by an individual in which interest can be allowed or paid (Part QQ); provides a modification reducing federal adjusted gross income by the amount of the COVID-19 family death benefit paid pursuant to the metropolitan transportation authority program established in 2020 for purposes of determining New York state taxable income (Part RR); extends sales tax exemption for certain food and drink vending machines (Part SS); enacts the environmental bond act of 2022 \"restore mother nature\"; authorizes state debt not exceeding $3,000,000,000 for making environmental improvements that preserve, enhance, and restore New York's natural resources and reduce the impact of climate change (Part TT); implements the environmental bond act of 2022 \"restore mother nature\" for projects including flood risk reduction, open space land conservation and recreation, climate change mitigation, water quality improvement and resilient infrastructure, and environmental justice (Part UU); establishes the COVID-19 pandemic small business recovery grant program to provide assistance to small businesses and for-profit independent arts and cultural organizations who have experienced economic hardship during the COVID-19 pandemic (Part VV); subjects certain state lands in Orange county to real property taxation (Part WW); relates to increasing the maximum amount of grants and loans under the airport improvement and revitalization grant and loan program (Part XX); renames the Newkirk Avenue subway station on the IRT Nostrand Avenue line the \"Newkirk Avenue -- Little Haiti station\" (Part YY); relates to the minimum combined single limit amount of a bond or insurance policy for commuter vans (Part ZZ); enacts the \"New York state professional policing act of 2021\"; requires the inspector general and attorney general to notify the division of criminal justice services of any allegations or abuse by any police officer in a covered agency; requires the law enforcement agency accreditation council to create a mandatory certification process for agencies employing certain police officers; makes related provisions (Part BBB); relates to the rehabilitation of historic properties tax credit; provides that small projects of $2,500,000 or less are entitled to 150% of the amount of credit allowed the taxpayer under the internal revenue code (Part CCC); modifies inclusions and exclusions for certain definitions of income (Part DDD); creates the excluded worker fund to provide benefits for persons not eligible for funds under other state or federal programs or assistance and who has suffered a loss of income due to the COVID-19 pandemic (Part EEE); extends COLA provisions in the amount of one percent for the purposes of establishing rates of payments for the period beginning April 1, 2021 and ending March 31, 2022 (Part FFF); relates to aid and incentives for municipalities base level grants (Part GGG); relates to the computation of franchise tax on a business income base and capital base (Part HHH); establishes the real property tax relief credit (Part III); provides for the administration of certain funds and accounts related to the 2021-2022 budget; authorizes certain payments and transfers; relates to the issuance of bonds and notes; relates to personal income tax notes for 2022, lines of credit for the dormitory authority and the urban development corporation for 2022 and state-supported debt for 2022; makes related provisions (Part JJJ); authorizes the city of New York and the board of education of the city of New York to offer temporary retirement incentives (Subpart A); provides an age 55/25 years temporary retirement incentive for certain public employees of the city of New York and the board of education of the city of New York (Subpart B) (Part KKK); relates to the utilization of funds in the Catskill region and Capital region off-track betting corporation's capital acquisition funds (Part LLL); extends certain provisions relating to the operation and administration of the legislature (Part MMM); makes technical and clarifying changes relating to restricting the use of segregated confinement and the creation of alternative therapeutic and rehabilitative confinement options (Part NNN); relates to the taxes imposed on revenue from gaming facilities (Part OOO).",
 "LawSection":"Budget Bills","LawCode":"Amd Various Laws, generally",
 "ActClause":"AN ACT to amend the tax law, in relation to extending the top state income tax rate (Part A); intentionally omitted (Part B); to amend the tax law and the state finance law, in relation to the imposition of a pass-through entity tax (Part C); to amend the economic development law and the tax law, in relation to child care services expenditures under the excelsior jobs program and the employer provided child care credit (Part D); to amend the tax law, in relation to an exemption from certain franchise taxes (Part E); to amend the tax law, in relation to the empire state film production credit and the empire state film post production credit (Part F); to amend the tax law, in relation to wage filer reporting and reconciliation (Part G); intentionally omitted (Part H); intentionally omitted (Part I); to amend the tax law, in relation to imposing sales tax on admissions to race tracks and simulcast facilities; and to repeal section 227, section 306, section 406, subparagraph (ii) of paragraph b of subdivision 4 of section 1008 and paragraph b of subdivision 5 of section 1009 of the racing, pari-mutuel wagering and breeding law, relating to certain taxes on admissions to race tracks and simulcast facilities (Part J); intentionally omitted (Part K); intentionally omitted (Part L); to amend the tax law, in relation to exempting from sales and use tax certain tangible personal property or services (Part M); to amend the tax law, in relation to increasing the total dollar amount for vendors' gross receipts necessary for registration filing (Part N); to amend the tax law, in relation to imposing liability for real estate transfer taxes on responsible persons, prohibiting grantors from passing real estate transfer tax to grantees, and exempting certain organizations from the LLC disclosure requirement (Part O); to amend the tax law, in relation to restrictions on certain retail dealers whose registrations have been revoked or who have been forbidden from selling cigarettes or tobacco products (Part P); to amend the tax law, in relation to the timing and method for filing certain returns (Part Q); to amend the tax law, in relation to determining liability for the collection of taxes on medallion taxicab trips and congestion surcharges (Part R); to amend the tax law, in relation to increasing tax return preparer penalties for failure to register and requiring the display of certain documents by tax return preparers (Part S); intentionally omitted (Part T); to amend the real property law and the tax law, in relation to electronic submission of consolidated real property transfer forms; and to repeal certain provisions of the real property law relating thereto (Part U); to amend the real property law, in relation to exemptions for manufactured home park owners or operators and mobile home owners; and to repeal certain provisions of such law relating thereto (Part V); to amend the real property tax law, in relation to facilitating the administration of the real property tax, and to repeal section 307 of such law relating thereto (Part W); to amend the real property tax law and the general municipal law, in relation to promoting the development of renewable energy projects (Part X); to amend the racing, pari-mutuel wagering and breeding law, in relation to regulation of sports wagering (Part Y); authorizing a request for information related to gaming facility licenses (Part Z); intentionally omitted (Part AA); to amend the tax law, in relation to restrictions on certain lottery draw game offerings (Part BB); to amend the racing, pari-mutuel wagering and breeding law, in relation to the office of the gaming inspector general; and to repeal certain provisions of such law relating thereto (Part CC); to amend the racing, pari-mutuel wagering and breeding law, in relation to licenses for simulcast facilities, sums relating to track simulcast, simulcast of out-of-state thoroughbred races, simulcasting of races run by out-of-state harness tracks and distributions of wagers; to amend chapter 281 of the laws of 1994 amending the racing, pari-mutuel wagering and breeding law and other laws relating to simulcasting and to amend chapter 346 of the laws of 1990 amending the racing, pari-mutuel wagering and breeding law and other laws relating to simulcasting and the imposition of certain taxes, in relation to extending certain provisions thereof; and to amend the racing, pari-mutuel wagering and breeding law, in relation to extending certain provisions thereof (Part DD); to amend chapter 109 of the laws of 2006 amending the tax law and other laws relating to providing exemptions, reimbursements and credits from various taxes for certain alternative fuels, in relation to extending the alternative fuels tax exemptions for five years (Part EE); to amend the tax law and chapter 60 of the laws of 2016 amending the tax law relating to creating a farm workforce retention credit, in relation to extending the provisions of such credit through tax year 2024 (Part FF); to amend the public housing law, in relation to extending the credit against income tax for persons or entities investing in low-income housing (Part GG); to amend chapter 59 of the laws of 2014, amending the tax law relating to a musical and theatrical production credit, in relation to the effectiveness thereof; and to amend the tax law, in relation to increasing the aggregate cap on the amount of such credit (Part HH); to amend the tax law, in relation to extending hire a veteran credit for an additional year (Part II); to amend chapter 61 of the laws of 2011 amending the economic development law, the tax law and the real property tax law, relating to establishing the economic transformation and facility redevelopment program and providing tax benefits under that program and to amend the economic development law, in relation to extending the tax credits under the economic transformation and facility redevelopment program (Part JJ); to amend the general business law, in relation to requiring the implementation of the secure choice program by a certain date (Part KK); to amend the racing, pari-mutuel wagering and breeding law, inrelation to modifying certain racing support payments (Part LL); to amend the tax law, in relation to exempting breast pump replacement parts and certain supplies from sales and compensating use taxes (Part MM); clarifying for certain tax credit programs that work performed remotely within the state due to the outbreak of novel coronavirus, COVID-19, qualifies for certain tax credit programs; and providing for the repeal of such provisions upon expiration thereof (Part NN); to exempt certain underpayments from interest accumulation (Part OO); to amend the economic development law and the tax law, in relation to establishing the restaurant return-to-work tax credit program (Subpart A); and to amend the tax law and the state finance law, in relation to establishing the New York city musical and theatrical production tax credit and establishing the New York state council on the arts cultural program fund; and providing for the repeal of such provisions upon the expiration thereof (Subpart B) (Part PP); to amend the tax law, in relation to modifying interest rules on overpayments of personal income and corporate tax (Part QQ); to amend the tax law, in relation to providing a modification reducing federal adjusted gross income by the amount of the COVID-19 family death benefit paid pursuant to the metropolitan transportation authority program established in 2020 for purposes of determining New York state taxable income (Part RR); to amend the tax law, in relation to extending sales tax exemption for certain food and drink vending machines (Part SS); authorizing the creation of state debt in the amount of three billion dollars, in relation to creating the environmental bond act of 2022 \"restore mother nature\" for the purposes of environmental improvements that preserve, enhance, and restore New York's natural resources and reduce the impact of climate change; and providing for the submission to the people of a proposition or question therefor to be voted upon at the general election to be held in November, 2022 (Part TT); to amend the environmental conservation law and the state finance law, in relation to the implementation of the environmental bond act of 2022 \"restore mother nature\" (Part UU); to amend the New York state urban development corporation act, in relation to establishing the COVID-19 pandemic small business recovery grant program (Part VV); to amend the real property tax law, in relation to subjecting certain state lands in Orange county to real property taxation (Part WW); to amend the transportation law, in relation to increasing the maximum amount of grants and loans under the airport improvement and revitalization grant and loan program (Part XX); in relation to renaming the Newkirk Avenue subway station on the IRT Nostrand Avenue line the \"Newkirk Avenue - Little Haiti station\" (Part YY); to amend the vehicle and traffic law, in relation to indemnity bonds or insurance policies for commuter vans (Part ZZ); intentionally omitted (Part AAA); to amend the executive law, the criminal procedure law, the general municipal law, the public authorities law and the civil service law, in relation to police officers; and to repeal certain provisions of the executive law relating thereto (Part BBB); to amend the tax law, in relation to the rehabilitation of historic properties tax credit (Part CCC); to amend the tax law and the administrative code of the city of New York, in relation to investment income (Part DDD); establishing the excluded workers fund to provide payments to workers who suffered a loss of work-related earnings or a major source of household income during a state of emergency declared by the governor and who are otherwise ineligible for unemployment insurance or other state or federal unemployment benefits (Part EEE); to amend part C of chapter 57 of the laws of 2006 relating to establishing a cost of living adjustment for designated human services programs, in relation to extending COLA provisions for the purpose of establishing rates of payments and in relation to the effectiveness thereof (Part FFF); to amend the state finance law, in relation to aid and incentives for municipalities base level grants (Part GGG); to amend the tax law, in relation to the amount of the business income base and capital base for the computation of tax (Part HHH); to amend the tax law, in relation to the real property tax relief credit (Part III); to provide for the administration of certain funds and accounts related to the 2021-2022 budget, authorizing certain payments and transfers; to amend the state finance law, in relation to the administration of certain funds and accounts; to amend part D of chapter 389 of the laws of 1997 relating to the financing of the correctional facilities improvement fund and the youth facility improvement fund, in relation to the issuance of certain bonds or notes; to amend part Y of chapter 61 of the laws of 2005, relating to providing for the administration of certain funds and accounts related to the 2005-2006 budget, in relation to the issuance of certain bonds or notes; to amend the public authorities law, in relation to the issuance of certain bonds or notes; to amend the New York state medical care facilities finance agency act, in relation to the issuance of certain bonds or notes; to amend the New York state urban development corporation act, in relation to the issuance of certain bonds or notes; to amend chapter 329 of the laws of 1991, amending the state finance law and other laws relating to the establishment of the dedicated highway and bridge trust fund, in relation to the issuance of certain bonds or notes; to amend the public authorities law, in relation to the issuance of certain bonds or notes; to amend the New York state urban development corporation act, in relation to the issuance of certain bonds or notes; to amend the private housing finance law, in relation to housing program bonds and notes; to amend the New York state urban development corporation act, in relation to personal income tax notes for 2022, in relation to authorizing the dormitory authority of the state of New York and the urban development corporation to enter into line of credit facilities for 2022, and in relation to state-supported debt issued during the 2022 fiscal year; to amend the state finance law, in relation to payments of bonds; to amend the state finance law, in relation to the mental health services fund; to amend the public health law, in relation to secured hospital project bonds; to amend the state finance law, in relation to the issuance of revenue bonds; to repeal paragraph c of subdivision 5 of section 89-b of the state finance law relating to the dedicated highway and bridge trust fund; to repeal subdivision (j) of section 92-dd of the state finance law relating to the HCRA resources fund; to repeal subdivision 3-a of the public health law relating to eligible secured hospital borrower; and providing for the repeal of certain provisions upon expiration thereof (Part JJJ); to authorize certain employers to provide a temporary retirement incentive for certain public employees in the city of New York (Subpart A); and an age 55/25 years temporary retirement incentive for certain public employees in the city of New York (Subpart B)(Part KKK); to amend the racing, pari-mutuel wagering and breeding law, in relation to the utilization of funds in the Catskill and Capital regions off-track betting corporation's capital acquisition funds; and providing for the repeal of such provisions upon the expiration thereof (Part LLL); to amend chapter 141 of the laws of 1994, amending the legislative law and the state finance law relating to the operation and administration of the legislature, in relation to extending such provisions (Part MMM); to amend the correction law, in relation to restricting the use of segregated confinement and creating alternative therapeutic and rehabilitative confinement options (Part NNN); and to amend the racing, pari-mutuel wagering and breeding law, in relation to the tax on gaming revenues; and providing for the repeal of such provisions upon the expiration thereof (Part OOO)",
 "SameAsPrintNo":"A3009-2021"
}