{
 "PrintNo":"S2720","Session":2021,"Chamber":"SENATE","BillType":"Senate","Published":"2021-01-22T16:12:32.857945Z",
 "Status":"IN_SENATE_COMM","Committee":"Codes",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2022-01-05","Committee":"Codes"}],
 "Actions":[
  {"Text":"REFERRED TO CODES","Date":"2021-01-22","Chamber":"SENATE"},
  {"Text":"REFERRED TO CODES","Date":"2022-01-05","Chamber":"SENATE"}
 ],
 "Sponsors":[
  {"ID":427,"Name":"Patrick M. Gallivan","Short":"GALLIVAN"},{"ID":913,"Name":"Fredrick J. Akshar II","Short":"AKSHAR"},
  {"ID":409,"Name":"Andrew J. Lanza","Short":"LANZA"}
 ],
 "Title":"Relates to the crimes of criminal impersonation in the first degree and fraud in connection with a primary election, caucus or convention; repealer",
 "Summary":"Relates to the crimes of fraud in connection with a primary election, caucus or convention, and criminal impersonation in the first degree where a person pretends to be an elected official or candidate for an elected office and acts by impersonating such an elected official, or candidate or campaign for such an elected office, by communication by internet website or electronic means, with intent to obtain a benefit or injure or defraud another; requires social media companies to establish practical mechanisms for closing accounts within twenty-four hours of receiving notice that such account involves either such crime; authorizes the state board of elections chief enforcement counsel to investigate allegations or claims of such crimes, including subpoena powers and to issue cease and desist orders to the relevant social media companies upon proof of such impersonation or fraudulent or wrongful act.",
 "LawSection":"Penal Law",
 "LawCode":"Amd §190.26, Pen L; rpld §17-102 sub 5, amd §17-102, add §§17-101 & 3-104-b, El L; add §392-k, Gen Bus L",
 "ActClause":"AN ACT to amend the penal law, the election law and the general business law, in relation to the crime of criminal impersonation in the first degree and fraud in connection with a primary election, caucus or convention; and to repeal certain provisions of the election law relating thereto",
 "SameAsPrintNo":"A7008-2021","PreviousVersions":["S6795-2019"]
}