{
 "PrintNo":"S3032","Session":2021,"Chamber":"SENATE","BillType":"Senate","Published":"2021-01-27T10:57:37.041105Z",
 "Status":"IN_SENATE_COMM","Committee":"Energy And Telecommunications",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2022-01-05","Committee":"Energy And Telecommunications"}],
 "Actions":[
  {"Text":"REFERRED TO ENERGY AND TELECOMMUNICATIONS","Date":"2021-01-27","Chamber":"SENATE"},
  {"Text":"REFERRED TO ENERGY AND TELECOMMUNICATIONS","Date":"2022-01-05","Chamber":"SENATE"}
 ],
 "Sponsors":[
  {"ID":416,"Name":"Kevin S. Parker","Short":"PARKER"},{"ID":1231,"Name":"Alessandra Biaggi","Short":"BIAGGI"},
  {"ID":383,"Name":"Michael Gianaris","Short":"GIANARIS"},{"ID":438,"Name":"Brad Hoylman-Sigal","Short":"HOYLMAN"},
  {"ID":1227,"Name":"Julia Salazar","Short":"SALAZAR"},{"ID":432,"Name":"James Sanders Jr.","Short":"SANDERS"}
 ],
 "Title":"Relates to providing the New York power authority with the right of first offer and refusal; bans non-state run energy services companies; repealer",
 "Summary":"Provides the New York power authority with the right of first offer and refusal for acquiring any renewable generation facility, renewable energy generation project and any power or energy created by a renewable generation facility or renewable energy generation project; bans non-state run energy services companies; allows the New York power authority to take over and operate as an energy services company.",
 "LawSection":"Public Authorities Law",
 "LawCode":"Amd ยง1005, Pub Auth L; add ยง28, amd ยง44, Pub Serv L; rpld ยง349-d, Gen Bus L",
 "ActClause":"AN ACT to amend the public authorities law and the public service law, in relation to providing the New York power authority with the right of first offer and refusal for certain renewable generation facilities and any power or energy created by such renewable generation facilities; bans energy services companies; and to repeal certain provisions of the general business law relating thereto",
 "SameAsPrintNo":"A1382-2021","PreviousVersions":["S7243-2019"]
}