{
 "PrintNo":"S4353","Version":"A","Session":2021,"Chamber":"SENATE","BillType":"Senate",
 "Published":"2021-02-03T15:37:52.787227Z","Status":"IN_SENATE_COMM","Committee":"Crime Victims, Crime And Correction",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2022-01-05","Committee":"Crime Victims, Crime And Correction"}],
 "Actions":[
  {"Text":"REFERRED TO CRIME VICTIMS, CRIME AND CORRECTION","Date":"2021-02-03","Chamber":"SENATE"},
  {"Text":"AMEND (T) AND RECOMMIT TO CRIME VICTIMS, CRIME AND CORRECTION","Date":"2021-03-10","Chamber":"SENATE"},
  {"Text":"PRINT NUMBER 4353A","Date":"2021-03-10","Chamber":"SENATE","Version":"A"},
  {"Text":"REFERRED TO CRIME VICTIMS, CRIME AND CORRECTION","Date":"2022-01-05","Chamber":"SENATE","Version":"A"}
 ],
 "Sponsors":[{"ID":1142,"Name":"Luis R. Sepúlveda","Short":"SEPULVEDA"}],
 "Title":"Repeals certain provisions of the correction law, the penal law and the executive law, relating to inmates",
 "Summary":"Relates to the parole supervision fee; relates to compensation paid to a prisoner for certain work; relates to incarceration fees; relates to probation administrative fees; prohibits certain fees associated with probation; provides for the termination and discharge of certain sentences.",
 "LawSection":"Correction Law",
 "LawCode":"Rpld §201 sub 9, §189 sub 2, amd §205, Cor L; rpld & add §257-c, amd §259-j, Exec L; rpld §60.35 sub 5 ¶b, Pen L",
 "ActClause":"AN ACT to repeal subdivision 9 of section 201 of the correction law, relating to the parole supervision fee, subdivision 2 of section 189 of the correction law, relating to compensation paid to a prisoner for certain work performed, paragraph b of subdivision 5 of section 60.35 of the penal law, relating to incarceration fees, and section 257-c of the executive law, relating to probation administrative fees; to amend the executive law, in relation to prohibiting certain fees associated with probation; and to amend the correction law and the executive law, in relation to termination and discharge of certain sentences"
}