{
 "PrintNo":"S8008","Version":"C","Session":2021,"Chamber":"SENATE","BillType":"Senate",
 "Published":"2022-01-19T16:57:17.674547Z","Status":"SIGNED_BY_GOV",
 "Milestones":[
  {"Type":"IN_SENATE_COMM","Date":"2022-04-08","Committee":"Finance"},{"Type":"SENATE_FLOOR","Date":"2022-04-08"},
  {"Type":"PASSED_SENATE","Date":"2022-04-08"},
  {"Type":"IN_ASSEMBLY_COMM","Date":"2022-04-08","Committee":"Ways And Means"},
  {"Type":"ASSEMBLY_FLOOR","Date":"2022-04-08"},{"Type":"PASSED_ASSEMBLY","Date":"2022-04-08"},
  {"Type":"DELIVERED_TO_GOV","Date":"2022-04-09"},{"Type":"SIGNED_BY_GOV","Date":"2022-04-09"}
 ],
 "Actions":[
  {"Text":"REFERRED TO FINANCE","Date":"2022-01-19","Chamber":"SENATE"},
  {"Text":"AMEND (T) AND RECOMMIT TO FINANCE","Date":"2022-02-22","Chamber":"SENATE"},
  {"Text":"PRINT NUMBER 8008A","Date":"2022-02-22","Chamber":"SENATE","Version":"A"},
  {"Text":"AMEND (T) AND RECOMMIT TO FINANCE","Date":"2022-03-13","Chamber":"SENATE","Version":"A"},
  {"Text":"PRINT NUMBER 8008B","Date":"2022-03-13","Chamber":"SENATE","Version":"B"},
  {"Text":"AMEND (T) AND RECOMMIT TO FINANCE","Date":"2022-04-08","Chamber":"SENATE","Version":"B"},
  {"Text":"PRINT NUMBER 8008C","Date":"2022-04-08","Chamber":"SENATE","Version":"C"},
  {"Text":"ORDERED TO THIRD READING CAL.749","Date":"2022-04-08","Chamber":"SENATE","Version":"C"},
  {"Text":"MESSAGE OF NECESSITY - 3 DAY MESSAGE","Date":"2022-04-08","Chamber":"SENATE","Version":"C"},
  {"Text":"PASSED SENATE","Date":"2022-04-08","Chamber":"SENATE","Version":"C"},
  {"Text":"DELIVERED TO ASSEMBLY","Date":"2022-04-08","Chamber":"SENATE","Version":"C"},
  {"Text":"REFERRED TO WAYS AND MEANS","Date":"2022-04-08","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"SUBSTITUTED FOR A9008C","Date":"2022-04-08","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"ORDERED TO THIRD READING RULES CAL.73","Date":"2022-04-08","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"MESSAGE OF NECESSITY - 3 DAY MESSAGE","Date":"2022-04-08","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"PASSED ASSEMBLY","Date":"2022-04-08","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"RETURNED TO SENATE","Date":"2022-04-08","Chamber":"ASSEMBLY","Version":"C"},
  {"Text":"DELIVERED TO GOVERNOR","Date":"2022-04-09","Chamber":"SENATE","Version":"C"},
  {"Text":"SIGNED CHAP.58","Date":"2022-04-09","Chamber":"SENATE","Version":"C"}
 ],
 "Votes":[
  {
   "VoteType":"COMMITTEE","Date":"2022-04-08","Version":"C","Chamber":"SENATE","Committee":"Finance",
   "Votes":[
    {"ID":1102,"Name":"Jamaal Bailey","Short":"BAILEY","Vote":"Aye"},
    {"ID":372,"Name":"Neil D. Breslin","Short":"BRESLIN","Vote":"Aye"},
    {"ID":888,"Name":"Leroy Comrie","Short":"COMRIE","Vote":"Aye"},
    {"ID":1229,"Name":"Andrew Gounardes","Short":"GOUNARDES","Vote":"Aye"},
    {"ID":1233,"Name":"Pete Harckham","Short":"HARCKHAM","Vote":"Aye"},
    {"ID":438,"Name":"Brad Hoylman-Sigal","Short":"HOYLMAN","Vote":"Aye"},
    {"ID":429,"Name":"Timothy M. Kennedy","Short":"KENNEDY","Vote":"Aye"},
    {"ID":401,"Name":"Liz Krueger","Short":"KRUEGER","Vote":"Aye"},
    {"ID":1225,"Name":"John Liu","Short":"LIU","Vote":"Aye"},
    {"ID":1227,"Name":"Julia Salazar","Short":"SALAZAR","Vote":"Aye"},
    {"ID":403,"Name":"Diane J. Savino","Short":"SAVINO","Vote":"Aye"},
    {"ID":1232,"Name":"James Skoufis","Short":"SKOUFIS","Vote":"Aye"},
    {"ID":400,"Name":"Toby Ann Stavisky","Short":"STAVISKY","Vote":"Aye"},
    {"ID":1223,"Name":"Kevin Thomas","Short":"THOMAS","Vote":"Aye"},
    {"ID":377,"Name":"Gustavo Rivera","Short":"RIVERA","Vote":"Aye"},
    {"ID":1370,"Name":"George Borrello","Short":"BORRELLO","Vote":"Nay"},
    {"ID":427,"Name":"Patrick M. Gallivan","Short":"GALLIVAN","Vote":"Nay"},
    {"ID":393,"Name":"Joseph A. Griffo","Short":"GRIFFO","Vote":"Nay"},
    {"ID":415,"Name":"Thomas F. O'Mara","Short":"O'MARA","Vote":"Nay"},
    {"ID":423,"Name":"Patty Ritchie","Short":"RITCHIE","Vote":"Nay"},
    {"ID":890,"Name":"Susan Serino","Short":"SERINO","Vote":"Nay"},
    {"ID":1103,"Name":"James Tedisco","Short":"TEDISCO","Vote":"Nay"}
   ]
  },
  {
   "VoteType":"FLOOR","Date":"2022-04-08","Version":"C",
   "Votes":[
    {"ID":384,"Name":"Joseph P. Addabbo Jr.","Short":"ADDABBO","Vote":"Aye"},
    {"ID":1102,"Name":"Jamaal Bailey","Short":"BAILEY","Vote":"Aye"},
    {"ID":1231,"Name":"Alessandra Biaggi","Short":"BIAGGI","Vote":"Aye"},
    {"ID":433,"Name":"Phil Boyle","Short":"BOYLE","Vote":"Aye"},
    {"ID":372,"Name":"Neil D. Breslin","Short":"BRESLIN","Vote":"Aye"},
    {"ID":1494,"Name":"Jabari Brisport","Short":"BRISPORT","Vote":"Aye"},
    {"ID":1101,"Name":"John E. Brooks","Short":"BROOKS","Vote":"Aye"},
    {"ID":1500,"Name":"Samra Brouk","Short":"BROUK","Vote":"Aye"},
    {"ID":1504,"Name":"Cordell Cleare","Short":"CLEARE","Vote":"Aye"},
    {"ID":888,"Name":"Leroy Comrie","Short":"COMRIE","Vote":"Aye"},
    {"ID":1501,"Name":"Jeremy Cooney","Short":"COONEY","Vote":"Aye"},
    {"ID":439,"Name":"Simcha Felder","Short":"FELDER","Vote":"Aye"},
    {"ID":1222,"Name":"Jim Gaughran","Short":"GAUGHRAN","Vote":"Aye"},
    {"ID":383,"Name":"Michael Gianaris","Short":"GIANARIS","Vote":"Aye"},
    {"ID":1229,"Name":"Andrew Gounardes","Short":"GOUNARDES","Vote":"Aye"},
    {"ID":1233,"Name":"Pete Harckham","Short":"HARCKHAM","Vote":"Aye"},
    {"ID":1497,"Name":"Michelle Hinchey","Short":"HINCHEY","Vote":"Aye"},
    {"ID":438,"Name":"Brad Hoylman-Sigal","Short":"HOYLMAN","Vote":"Aye"},
    {"ID":1230,"Name":"Robert Jackson","Short":"JACKSON","Vote":"Aye"},
    {"ID":918,"Name":"Todd Kaminsky","Short":"KAMINSKY","Vote":"Aye"},
    {"ID":1224,"Name":"Anna Kaplan","Short":"KAPLAN","Vote":"Aye"},
    {"ID":1140,"Name":"Brian Kavanagh","Short":"KAVANAGH","Vote":"Aye"},
    {"ID":429,"Name":"Timothy M. Kennedy","Short":"KENNEDY","Vote":"Aye"},
    {"ID":401,"Name":"Liz Krueger","Short":"KRUEGER","Vote":"Aye"},
    {"ID":1225,"Name":"John Liu","Short":"LIU","Vote":"Aye"},
    {"ID":1498,"Name":"John Mannion","Short":"MANNION","Vote":"Aye"},
    {"ID":1496,"Name":"Mike Martucci","Short":"MARTUCCI","Vote":"Aye"},
    {"ID":1492,"Name":"Mario Mattera","Short":"MATTERA","Vote":"Aye"},
    {"ID":1237,"Name":"Rachel May","Short":"MAY","Vote":"Aye"},
    {"ID":1143,"Name":"Shelley Mayer","Short":"MAYER","Vote":"Aye"},
    {"ID":1228,"Name":"Zellnor Myrie","Short":"MYRIE","Vote":"Aye"},
    {"ID":1489,"Name":"Anthony H. Palumbo","Short":"PALUMBO","Vote":"Aye"},
    {"ID":416,"Name":"Kevin S. Parker","Short":"PARKER","Vote":"Aye"},
    {"ID":914,"Name":"Roxanne J. Persaud","Short":"PERSAUD","Vote":"Aye"},
    {"ID":1226,"Name":"Jessica Ramos","Short":"RAMOS","Vote":"Aye"},
    {"ID":1495,"Name":"Elijah Reichlin-Melnick","Short":"REICHLIN-MELNICK","Vote":"Aye"},
    {"ID":377,"Name":"Gustavo Rivera","Short":"RIVERA","Vote":"Aye"},
    {"ID":1491,"Name":"Sean Ryan","Short":"RYAN","Vote":"Aye"},
    {"ID":1227,"Name":"Julia Salazar","Short":"SALAZAR","Vote":"Aye"},
    {"ID":432,"Name":"James Sanders Jr.","Short":"SANDERS","Vote":"Aye"},
    {"ID":403,"Name":"Diane J. Savino","Short":"SAVINO","Vote":"Aye"},
    {"ID":1142,"Name":"Luis R. Sepúlveda","Short":"SEPULVEDA","Vote":"Aye"},
    {"ID":373,"Name":"José M. Serrano","Short":"SERRANO","Vote":"Aye"},
    {"ID":1232,"Name":"James Skoufis","Short":"SKOUFIS","Vote":"Aye"},
    {"ID":400,"Name":"Toby Ann Stavisky","Short":"STAVISKY","Vote":"Aye"},
    {"ID":396,"Name":"Andrea Stewart-Cousins","Short":"STEWART-COUSINS","Vote":"Aye"},
    {"ID":1223,"Name":"Kevin Thomas","Short":"THOMAS","Vote":"Aye"},
    {"ID":1493,"Name":"Alexis Weik","Short":"WEIK","Vote":"Aye"},
    {"ID":913,"Name":"Fredrick J. Akshar II","Short":"AKSHAR","Vote":"Nay"},
    {"ID":1370,"Name":"George Borrello","Short":"BORRELLO","Vote":"Nay"},
    {"ID":427,"Name":"Patrick M. Gallivan","Short":"GALLIVAN","Vote":"Nay"},
    {"ID":393,"Name":"Joseph A. Griffo","Short":"GRIFFO","Vote":"Nay"},
    {"ID":951,"Name":"Pamela Helming","Short":"HELMING","Vote":"Nay"},
    {"ID":1235,"Name":"Daphne Jordan","Short":"JORDAN","Vote":"Nay"},
    {"ID":409,"Name":"Andrew J. Lanza","Short":"LANZA","Vote":"Nay"},
    {"ID":415,"Name":"Thomas F. O'Mara","Short":"O'MARA","Vote":"Nay"},
    {"ID":1499,"Name":"Peter Oberacker","Short":"OBERACKER","Vote":"Nay"},
    {"ID":885,"Name":"Robert Ortt","Short":"ORTT","Vote":"Nay"},
    {"ID":1502,"Name":"Edward Rath","Short":"RATH","Vote":"Nay"},
    {"ID":423,"Name":"Patty Ritchie","Short":"RITCHIE","Vote":"Nay"},
    {"ID":890,"Name":"Susan Serino","Short":"SERINO","Vote":"Nay"},
    {"ID":1490,"Name":"Dan Stec","Short":"STEC","Vote":"Nay"},
    {"ID":1103,"Name":"James Tedisco","Short":"TEDISCO","Vote":"Nay"}
   ]
  }
 ],
 "Title":"Enacts into law major components of legislation necessary to implement the state transportation, economic development and environmental conservation budget for the 2022-2023 state fiscal year",
 "Summary":"Enacts into law major components of legislation necessary to implement the state transportation, economic development and environmental conservation budget for the 2022-2023 state fiscal year; relates to providing for mass transportation payments, in relation to the amount of payments in the Capital District Transportation District; adds Montgomery County to such District (Part E); relates to the electronic submission and public posting of bids for New York state thruway authority construction, reconstruction and improvement contracts (Part F); increases the statutory threshold for mandatory use of design-build by the metropolitan transportation authority (Part H); relates to procurements conducted by the metropolitan transportation authority and the New York city transit authority (Part I); relates to the New York transit authority and the metropolitan transportation authority, in relation to extending authorization for tax increment financing for the metropolitan transportation authority (Part J); relates to establishing the accident prevention course internet technology pilot program, in relation to the effectiveness thereof (Part O); relates to increasing certain motor vehicle transaction fees, in relation to the effectiveness thereof; relates to the costs of the department of motor vehicles, in relation to the effectiveness thereof (Part P); establishes an identification card program; waives non-driver identification application fees for incarcerated individuals (Part Q); requires all state agencies to update all applicable forms and data systems to include a gender \"x\" option (Part R); authorizes the disclosure of records for the public service loan forgiveness program (Part S); relates to the pilot program for entertainment industry employees and the pilot program for displaced workers; relates to the New York state health insurance continuation assistance demonstration project, in relation to the effectiveness thereof (Part T); relates to brownfield opportunity areas (Part U); authorizes certain health care professionals licensed to practice in other jurisdictions to practice in this state in connection with the Winter World University Games; provides for the repeal of such provisions upon expiration thereof (Part X); relates to the powers of the New York state urban development corporation to make loans, in relation to extending loan powers (Part Y); extends the authority of the New York state urban development corporation to administer the empire state economic development fund (Part Z); amends the infrastructure investment act, in relation to requiring project labor agreements when undertaking certain authorized projects, and in relation to the effectiveness thereof; authorizes, for certain public works undertaken pursuant to project labor agreements, use of the alternative delivery method known as design-build contracts, in relation to the definition of authorized entity, and in relation to the effectiveness thereof (Part AA); relates to the excelsior linked deposit program (Part BB); creates the small business seed funding grant program (Part CC); relates to the powers and duties of the dormitory authority of the state of New York relative to the establishment of subsidiaries for certain purposes, in relation to the effectiveness thereof (Part DD); relates to the cannabis social equity fund (Part II); repeals certain provisions of law relating to fiber optic cable (Part JJ); t removes a program cap and allows funding of the solid waste mitigation program's inactive landfill initiative (Part KK); relates to eligibility for participation in the brownfield cleanup program, assignment of the brownfield redevelopment tax credits and brownfield opportunity areas; relates to brownfield redevelopment tax credits, remediated brownfield credit for real property taxes for qualified sites and environmental remediation insurance credits, in relation to the effectiveness thereof (Part LL); extends the waste tire management fee; conforms the applicable administrative provisions to article 28 of the tax law (Part MM); authorizes the creation of state debt in the amount of three billion dollars, in relation to creating the environmental bond act of 2022 \"restore mother nature\" for the purposes of environmental improvements that preserve, enhance, and restore New York's natural resources and reduce the impact of climate change; provides for the submission to the people of a proposition or question therefor to be voted upon at the general election to be held in November, 2022, in relation to creating the Clean Water, Clean Air, and Green Jobs Environmental Bond Act of 2022 (Part NN); relates to the implementation of the environmental bond act of 2022 \"restore mother nature\", in relation to renaming such act the \"clean water, clean air, and green jobs environmental bond act of 2022\" (Part OO); increases the transfer amount from the real estate transfer tax to the environmental protection fund (Part PP); relates to freshwater wetlands; (Part QQ); relates to the water pollution control revolving fund (Part UU); relates to the vessel surcharge (Part WW); relates to river regulating district payment of taxes on lands owned by the state (Part XX); relates to the powers, functions and duties of the state council of parks, recreation and historic preservation and the regional park, recreation and historic preservation commissions (Part YY); authorizes the energy research and development authority to finance a portion of its research, development and demonstration, policy and planning, and Fuel NY program, as well as climate change related expenses of the department of environmental conservation and the department of agriculture and markets' Fuel NY program, from an assessment on gas and electric corporations (Part AAA); authorizes utility and cable television assessments that provide funds to the department of health from cable television assessment revenues and to the department of agriculture and markets, department of environmental conservation, department of state, and the office of parks, recreation and historic preservation from utility assessment revenues; provides for the repeal of such provisions upon the expiration thereof (Part BBB); authorizes the power authority of the state of New York to enter into agreements with state instrumentalities and municipal entities for the use of excess capacity in its broadband technologies and infrastructure (Part FFF); establishes the commercial driver's license (CDL) class A young adult training program (Part GGG); expands the Restore New York's Communities Initiative (Part HHH); requires assessments to defray operating expenses on persons regulated by the department of financial services that engage in virtual currency business activity (Part III); requires the department of taxation and finance contract with an economic impact firm for the purposes of conducting an independent, comprehensive, analysis of each tax credit, tax deduction, and tax incentive (Part JJJ); enhances the state's flood mitigation and coastal resiliency activities (Part KKK); requires the metropolitan transportation authority to publish certain data relating to capital programs on the authority's website (Part LLL); enacts the \"working to implement reliable and equitable deployment of broadband act (WIRED broadband act)\" (Part MMM); relates to the reporting of economic development benefits and establishing a searchable state subsidy and aggregate economic development benefits database (Part NNN).",
 "LawSection":"Budget Bills","LawCode":"Amd Various Laws, generally",
 "ActClause":"AN ACT intentionally omitted (Part A); intentionally omitted (Part B); intentionally omitted (Part C); intentionally omitted (Part D); to amend part I of chapter 413 of the laws of 1999, relating to providing for mass transportation payments, in relation to the amount of payments in the Capital District Transportation District and adding Montgomery County to such District (Part E); to amend the public authorities law, in relation to the electronic submission and public posting of bids for New York state thruway authority construction, reconstruction and improvement contracts (Part F); intentionally omitted (Part G); to amend the public authorities law, in relation to increasing the statutory threshold for mandatory use of design-build by the metropolitan transportation authority (Part H); to amend the public authorities law, in relation to procurements conducted by the metropolitan transportation authority and the New York city transit authority (Part I); to amend part PP of chapter 54 of the laws of 2016 amending the general municipal law relating to the New York transit authority and the metropolitan transportation authority, in relation to extending authorization for tax increment financing for the metropolitan transportation authority (Part J); intentionally omitted (Part K); intentionally omitted (Part L); intentionally omitted (Part M); intentionally omitted (Part N); to amend chapter 751 of the laws of 2005, amending the insurance law and the vehicle and traffic law relating to establishing the accident prevention course internet technology pilot program, in relation to the effectiveness thereof (Part O); to amend part U1 of chapter 62 of the laws of 2003, amending the vehicle and traffic law and other laws relating to increasing certain motor vehicle transaction fees, in relation to the effectiveness thereof; and to amend part B of chapter 84 of the laws of 2002, amending the state finance law relating to the costs of the department of motor vehicles, in relation to the effectiveness thereof (Part P); to amend the correction law, in relation to establishing an identification card program; and to amend the vehicle and traffic law, in relation to waiving non-driver identification application fees for incarcerated individuals (Part Q); to amend the civil rights law, in relation to requiring all state agencies to update all applicable forms and data systems to include a gender \"x\" option (Part R); to amend the public officers law, in relation to authorizing the disclosure of records for the public service loan forgiveness program (Part S); to amend the insurance law, in relation to the pilot program for entertainment industry employees and the pilot program for displaced workers, and to amend chapter 495 of the laws of 2004, amending the insurance law and the public health law relating to the New York state health insurance continuation assistance demonstration project, in relation to the effectiveness thereof (Part T); to amend the general municipal law, in relation to brownfield opportunity areas (Part U); intentionally omitted (Part V); intentionally omitted (Part W); in relation to authorizing certain health care professionals licensed to practice in other jurisdictions to practice in this state in connection with the Winter World University Games; and providing for the repeal of such provisions upon expiration thereof (Part X); to amend chapter 393 of the laws of 1994 amending the New York state urban development corporation act relating to the powers of the New York state urban development corporation to make loans, in relation to extending loan powers (Part Y); to amend the urban development corporation act, in relation to extending the authority of the New York state urban development corporation to administer the empire state economic development fund (Part Z); to amend the infrastructure investment act, in relation to requiring project labor agreements when undertaking certain authorized projects, and in relation to the effectiveness thereof; and to amend chapter 749 of the laws of 2019 authorizing, for certain public works undertaken pursuant to project labor agreements, use of the alternative delivery method known as design-build contracts, in relation to the definition of authorized entity, and in relation to the effectiveness thereof (Part AA); to amend the state finance law, in relation to the excelsior linked deposit program (Part BB); to amend the New York state urban development corporation act, in relation to creating the small business seed funding grant program (Part CC); to amend chapter 584 of the laws of 2011, amending the public authorities law relating to the powers and duties of the dormitory authority of the state of New York relative to the establishment of subsidiaries for certain purposes, in relation to the effectiveness thereof (Part DD); intentionally omitted (Part EE); intentionally omitted (Part FF); intentionally omitted (Part GG); intentionally omitted (Part HH); to amend the state finance law and the public authorities law, in relation to the cannabis social equity fund (Part II); to repeal certain provisions of the highway law and transportation corporations law, relating to fiber optic cable (Part JJ); to amend the environmental conservation law, in relation to removing a program cap and allowing funding of the solid waste mitigation program's inactive landfill initiative (Part KK); to amend the environmental conservation law and the tax law, in relation to eligibility for participation in the brownfield cleanup program, assignment of the brownfield redevelopment tax credits and brownfield opportunity areas; and to amend part H of chapter 1 of the laws of 2003, amending the tax law relating to brownfield redevelopment tax credits, remediated brownfield credit for real property taxes for qualified sites and environmental remediation insurance credits, in relation to the effectiveness thereof (Part LL); to amend the environmental conservation law, in relation to extending the waste tire management fee and conforming the applicable administrative provisions to article 28 of the tax law (Part MM); to amend part TT of chapter 59 of the laws of 2021 authorizing the creation of state debt in the amount of three billion dollars, in relation to creating the environmental bond act of 2022 \"restore mother nature\" for the purposes of environmental improvements that preserve, enhance, and restore New York's natural resources and reduce the impact of climate change; and providing for the submission to the people of a proposition or question therefor to be voted upon at the general election to be held in November, 2022, in relation to creating the Clean Water, Clean Air, and Green Jobs Environmental Bond Act of 2022 (Part NN); to amend the environmental conservation law, the state finance law, and part UU of chapter 59 of the laws of 2021 amending the environmental conservation law and the state finance law relating to the implementation of the environmental bond act of 2022 \"restore mother nature\", in relation to renaming such act the \"clean water, clean air, and green jobs environmental bond act of 2022\" (Part OO); to amend the tax law, in relation to increasing the transfer amount from the real estate transfer tax to the environmental protection fund (Part PP); to amend the environmental conservation law, in relation to freshwater wetlands; and to repeal certain provisions of such law relating thereto (Part QQ); intentionally omitted (Part RR); intentionally omitted (Part SS); intentionally omitted (Part TT); to amend the environmental conservation law, in relation to the water pollution control revolving fund (Part UU); intentionally omitted (Part VV); to amend the vehicle and traffic law and the state finance law, in relation to the vessel surcharge; and to repeal certain provisions of the state finance law relating thereto (Part WW); to amend the environmental conservation law and the real property tax law, in relation to river regulating district payment of taxes on lands owned by the state (Part XX); to amend the parks, recreation and historic preservation law, in relation to the powers, functions and duties of the state council of parks, recreation and historic preservation and the regional park, recreation and historic preservation commissions; and to repeal certain provisions of such law relating thereto (Part YY); intentionally omitted (Part ZZ); to authorize the energy research and development authority to finance a portion of its research, development and demonstration, policy and planning, and Fuel NY program, as well as climate change related expenses of the department of environmental conservation and the department of agriculture and markets' Fuel NY program, from an assessment on gas and electric corporations (Part AAA); to authorize utility and cable television assessments that provide funds to the department of health from cable television assessment revenues and to the department of agriculture and markets, department of environmental conservation, department of state, and the office of parks, recreation and historic preservation from utility assessment revenues; and providing for the repeal of such provisions upon the expiration thereof (Part BBB); intentionally omitted (Part CCC); intentionally omitted (Part DDD); intentionally omitted (Part EEE); to amend the public authorities law, in relation to authorizing the power authority of the state of New York to enter into agreements with state instrumentalities and municipal entities for the use of excess capacity in its broadband technologies and infrastructure (Part FFF); to amend the vehicle and traffic law, in relation to establishing the commercial driver's license (CDL) class A young adult training program; and to repeal subdivision 36 of section 14 of the transportation law relating thereto (Part GGG); to amend the urban development corporation act, in relation to expanding the Restore New York's Communities Initiative (Part HHH); to amend the financial services law, in relation to requiring assessments to defray operating expenses on persons regulated by the department of financial services that engage in virtual currency business activity (Part III); to amend the tax law, in relation to requiring the department of taxation and finance contract with an economic impact firm for the purposes of conducting an independent, comprehensive, analysis of each tax credit, tax deduction, and tax incentive (Part JJJ); to amend the environmental conservation law, in relation to enhancing the state's flood mitigation and coastal resiliency activities (Part KKK); to amend the public authorities law, in relation to requiring the metropolitan transportation authority to publish certain data relating to capital programs on the authority's website (Part LLL); to amend the New York state urban development corporation act, the general municipal law and the labor law, in relation to enacting the \"working to implement reliable and equitable deployment of broadband act (WIRED broadband act)\" (Part MMM); and to amend chapter 174 of the laws of 1968, constituting the New York state urban development corporation act, the economic development law, and the public authorities law, in relation to the reporting of economic development benefits and establishing a searchable state subsidy and aggregate economic development benefits database (Part NNN)",
 "SameAsPrintNo":"A9008-2021"
}