{
 "PrintNo":"A3390","Session":2023,"Chamber":"ASSEMBLY","BillType":"Assembly","Published":"2023-02-02T14:58:58.381526Z",
 "Status":"IN_ASSEMBLY_COMM","Committee":"Ways And Means",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2024-01-03","Committee":"Ways And Means"}],
 "Actions":[
  {"Text":"REFERRED TO WAYS AND MEANS","Date":"2023-02-02","Chamber":"ASSEMBLY"},
  {"Text":"REFERRED TO WAYS AND MEANS","Date":"2024-01-03","Chamber":"ASSEMBLY"}
 ],
 "Sponsors":[
  {"ID":608,"Name":"Edward Ra","Short":"RA"},{"ID":574,"Name":"William A. Barclay","Short":"BARCLAY"},
  {"ID":631,"Name":"Kenneth Blankenbush","Short":"BLANKENBUSH"},{"ID":908,"Name":"Karl Brabenec","Short":"BRABENEC"},
  {"ID":656,"Name":"David DiPietro","Short":"DIPIETRO"},
  {"ID":469,"Name":"Michael J. Fitzpatrick","Short":"FITZPATRICK"},
  {"ID":636,"Name":"Christopher Friend","Short":"FRIEND"},{"ID":599,"Name":"Joseph Giglio","Short":"GIGLIO JM"},
  {"ID":642,"Name":"Andrew Goodell","Short":"GOODELL"},{"ID":589,"Name":"Stephen Hawley","Short":"HAWLEY"},
  {"ID":1125,"Name":"Brian D. Miller","Short":"MILLER"},{"ID":1135,"Name":"Angelo J. Morinello","Short":"MORINELLO"},
  {"ID":1126,"Name":"Michael J. Norris","Short":"NORRIS"},{"ID":635,"Name":"Philip Palmesano","Short":"PALMESANO"},
  {"ID":1127,"Name":"Mary Beth Walsh","Short":"WALSH"},{"ID":1248,"Name":"Robert Smullen","Short":"SMULLEN"},
  {"ID":1251,"Name":"Brian Manktelow","Short":"MANKTELOW"}
 ],
 "Title":"Relates to a ten-year state takeover of the local share of Medicaid; repealer",
 "Summary":"Relates to a ten-year state takeover of the local share of Medicaid outside of New York city; provides a twenty-year state takeover of fifty percent of the local share of Medicaid in New York city; creates a commission to reform public assistance benefits; expands the state earned income tax credit from thirty percent to forty-five percent of the federal credit amount; offers the option for individuals to receive the state earned income tax credit in monthly installments; expands the child and dependent care tax credit; provides for state assumption of the growth in property taxes for school districts and local governments that remain under the real property tax cap; creates a real property tax redesign team required to produce recurring savings; subjects New York city to the property tax cap.",
 "LawSection":"Social Services Law",
 "LawCode":"Amd Part C §1, Chap 58 of 2005; add Art 11-A §§500 - 502, Soc Serv L; amd §§606 & 686, rpld §606 sub§ (c) ¶1-a, Tax L; add §54-n, St Fin L; add §2023-c, Ed L; add §§3-d & 3-e, Art 12-J §239-aaa, Gen Muni L; amd §23, Munic Home R L",
 "ActClause":"AN ACT to amend part C of chapter 58 of the laws of 2005, relating to authorizing reimbursements for expenditures made by or on behalf of social services districts for medical assistance for needy persons and the administration thereof, in relation to providing for a ten-year state takeover of the local share of Medicaid outside of New York City (Part A); providing for a twenty-year state takeover of fifty percent of the local share of Medicaid in New York City (Part B); to amend the social services law, in relation to creating the Commission to Reform Public Assistance Benefits (Part C); to amend the tax law, in relation to expanding the state earned income tax credit from thirty percent to forty-five percent of the federal credit amount (Part D); to amend the tax law, in relation to offering the option for individuals to receive the state earned income tax credit in monthly installments (Part E); to amend the tax law, in relation to expanding the child and dependent care tax credit; and to repeal certain provisions of such law relating thereto (Part F); to amend the state finance law, the education law, and the general municipal law, in relation to the state assuming the growth in property taxes for school districts and local governments that remain under the real property tax cap (Part G); to amend the general municipal law, in relation to creating a property tax redesign team; and providing for the repeal of such provisions upon expiration thereof (Part H); and to amend the general municipal law and the municipal home rule law, in relation to establishing limitations upon real property tax levies in cities with a population of one million or more (Part I)",
 "PreviousVersions":["A9901-2017","A4088-2019","A5851-2021"]
}