{
 "PrintNo":"A9795","Version":"A","Session":2023,"Chamber":"ASSEMBLY","BillType":"Assembly",
 "Published":"2024-04-09T08:52:34.201497Z","Status":"IN_ASSEMBLY_COMM","Committee":"Transportation",
 "Milestones":[{"Type":"IN_ASSEMBLY_COMM","Date":"2024-05-31","Committee":"Transportation"}],
 "Actions":[
  {"Text":"REFERRED TO TRANSPORTATION","Date":"2024-04-09","Chamber":"ASSEMBLY"},
  {"Text":"AMEND (T) AND RECOMMIT TO TRANSPORTATION","Date":"2024-05-31","Chamber":"ASSEMBLY"},
  {"Text":"PRINT NUMBER 9795A","Date":"2024-05-31","Chamber":"ASSEMBLY","Version":"A"}
 ],
 "Sponsors":[
  {"ID":673,"Name":"Michaelle C. Solages","Short":"SOLAGES"},{"ID":576,"Name":"Donna Lupardo","Short":"LUPARDO"},
  {"ID":907,"Name":"Jo Anne Simon","Short":"SIMON"},{"ID":608,"Name":"Edward Ra","Short":"RA"},
  {"ID":1255,"Name":"Karen McMahon","Short":"MCMAHON"},{"ID":670,"Name":"Angelo Santabarbara","Short":"SANTABARBARA"},
  {"ID":1536,"Name":"Matthew Slater","Short":"SLATER"},{"ID":1238,"Name":"Joe DeStefano","Short":"DESTEFANO"}
 ],
 "Title":"Allows for individuals to enroll in the national bone marrow donor program at the time of application for or renewal of a driver's license or non-driver identification card",
 "Summary":"Allows for individuals to enroll in the national marrow donor program at the time of application for or renewal of a driver's license or non-driver identification card; directs the commissioner of motor vehicles to establish a process by which the department of motor vehicles shall refer driver's license and non-driver identification card applicants who consent to having their information shared with the national marrow donor program for the purposes of receiving information from the national marrow donor program about enrolling as a potential volunteer bone marrow or blood cell donor on the national registry operated by the national marrow donor program.",
 "LawSection":"Vehicle and Traffic Law","LawCode":"Amd §§490, 502 & 508, V & T L",
 "ActClause":"AN ACT to amend the vehicle and traffic law, in relation to allowing for individuals to consent to contact from the national marrow donor program to receive information about enrolling in the national registry operated by the national marrow donor program at the time of application for or renewal of a driver's license or non-driver identification card",
 "SameAsPrintNo":"S9133-2023"
}