{
 "PrintNo":"S5873","Session":2023,"Chamber":"SENATE","BillType":"Senate","Published":"2023-03-20T15:42:09.420434Z",
 "Status":"IN_SENATE_COMM","Committee":"Investigations And Government Operations",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2024-01-03","Committee":"Investigations And Government Operations"}],
 "Actions":[
  {"Text":"REFERRED TO INVESTIGATIONS AND GOVERNMENT OPERATIONS","Date":"2023-03-20","Chamber":"SENATE"},
  {"Text":"REFERRED TO INVESTIGATIONS AND GOVERNMENT OPERATIONS","Date":"2024-01-03","Chamber":"SENATE"}
 ],
 "Sponsors":[{"ID":416,"Name":"Kevin S. Parker","Short":"PARKER"},{"ID":1102,"Name":"Jamaal Bailey","Short":"BAILEY"}],
 "Title":"Authorizes the local enactment of residency requirements for certain employees of police departments; salary increases and civil service credit",
 "Summary":"Authorizes the enactment of local laws requiring residency in cities with a population of one million or more for members of the police force appointed to such positions; provides increased salaries for certain police officers who are residents of certain cities; provides additional credits on competitive exams for original appointment of police officers, tax credits, real property tax credits and student loan forgiveness based upon residency in certain cities.",
 "LawSection":"Public Officers Law",
 "LawCode":"Amd §3, Pub Off L; add §207-r, Gen Muni L; amd §58, Civ Serv L; amd §§1310 & 606, add §1330-a, Tax L; add §466-l, RPT L; add §677-b, Ed L",
 "ActClause":"AN ACT to amend the public officers law, the general municipal law and the civil service law, in relation to residency requirements, salary, and civil service exam credits for police officers in certain cities; to amend the tax law and the real property tax law, in relation to establishing certain tax credits for resident police officers; and to amend the education law, in relation to the police officer loan forgiveness program",
 "PreviousVersions":["S4281-2007","S3112-2009","S3025-2011","S85-2013","S2372-2015","S2263-2017","S4268-2019","S4751-2021"]
}