{
 "PrintNo":"S7967","Session":2023,"Chamber":"SENATE","BillType":"Senate","Published":"2024-01-04T10:19:06.075563Z",
 "Status":"IN_SENATE_COMM","Committee":"Veterans, Homeland Security And Military Affairs",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2024-01-04","Committee":"Veterans, Homeland Security And Military Affairs"}],
 "Actions":[{"Text":"REFERRED TO VETERANS, HOMELAND SECURITY AND MILITARY AFFAIRS","Date":"2024-01-04","Chamber":"SENATE"}],
 "Sponsors":[{"ID":416,"Name":"Kevin S. Parker","Short":"PARKER"}],
 "Title":"Requires operators of nuclear power plants to give notice of scheduled and unscheduled releases of radioactive materials and of breakdowns or malfunctions",
 "Summary":"Requires operators of nuclear power plants (or designee) to give notice of: scheduled releases of radioactive materials at least 24 hours before the release is planned to occur; unscheduled releases of such materials as soon as possible, but not more than 24 hours after discovery of the release; and breakdowns or malfunctions; specifies that such notice shall be given to specified parties, including to the public via a toll free number; specifies elements to be contained in the notice (i.e. the total amount of radioactivity released or planned to be released, the estimated individual dose that may occur due to the event, weather conditions at the time of release, the area affected or anticipated to be affected, the equipment that malfunctioned or the operator error or other condition that caused the release, and the corrective action taken); requires study thereof by the commissioner of health; requires preparation and distribution of a report thereupon by the commissioner of health; provides for submission of annual reports by operators of nuclear power plants; provides monetary penalties for violations.",
 "LawSection":"Executive Law","LawCode":"Add ยง29-f, Exec L",
 "ActClause":"AN ACT to amend the executive law, in relation to notice of emissions at nuclear power plants",
 "PreviousVersions":["S244-2007","S1530-2009","S3395-2011","S3115-2013","S2572-2015","S2874-2017","S3606-2019","S3168-2021"]
}