{
 "PrintNo":"S9898","Session":2023,"Chamber":"SENATE","BillType":"Senate","Published":"2024-08-28T15:06:04.765691Z",
 "Status":"IN_SENATE_COMM","Committee":"Rules",
 "Milestones":[{"Type":"IN_SENATE_COMM","Date":"2024-08-28","Committee":"Rules"}],
 "Actions":[{"Text":"REFERRED TO RULES","Date":"2024-08-28","Chamber":"SENATE"}],
 "Sponsors":[
  {"ID":415,"Name":"Thomas F. O'Mara","Short":"O'MARA"},{"ID":1370,"Name":"George Borrello","Short":"BORRELLO"},
  {"ID":427,"Name":"Patrick M. Gallivan","Short":"GALLIVAN"},{"ID":393,"Name":"Joseph A. Griffo","Short":"GRIFFO"},
  {"ID":1521,"Name":"Dean Murray","Short":"MURRAY"},{"ID":1489,"Name":"Anthony H. Palumbo","Short":"PALUMBO"},
  {"ID":1490,"Name":"Dan Stec","Short":"STEC"},{"ID":1523,"Name":"Mark Walczyk","Short":"WALCZYK"}
 ],
 "Title":"Establishes the commission on reopening the Indian Point energy center; relates to definitions relating to renewable energy; repeals provision of public service law; directs a feasibility study on nuclear SMRs",
 "Summary":"Establishes the commission on reopening the Indian Point energy center; relates to definitions of certain terms relating to renewable energy; repeals provisions relating to electric generating facilities; directs the New York state energy research and development authority to conduct a feasibility study on nuclear small modular reactors.",
 "LawSection":"Energy Law",
 "LawCode":"Amd §1-103, Energy L; amd §119-ff, Gen Muni L; amd §1851, Pub Auth L; amd §66-p, rpld §162 sub 4 ¶(a), Pub Serv L",
 "ActClause":"AN ACT to establish the commission on reopening the Indian Point energy center; to amend the energy law, the general municipal law, the public authorities law, and the public service law, in relation to definitions of certain terms relating to renewable energy; to repeal paragraph (a) of subdivision 4 of section 162 of the public service law, relating to electric generating facilities; and directing the New York state energy research and development authority to conduct a feasibility study on nuclear small modular reactors"
}